[
    {
      "country": "Afghanistan",
        "information": "Afghanistan remained neutral during World War I, despite German encouragement of anti-British feelings and Afghan rebellion along the borders of British India. The Afghan king's policy of neutrality was not universally popular within the country, however. Habibullah, Abdur Rahman's son and successor, was assassinated in 1919, possibly by family members opposed to British influence. His third son, Amanullah, regained control of Afghanistan's foreign policy after launching the Third Anglo-Afghan war with an attack on India in the same year. During the ensuing conflict, the war-weary British relinquished their control over Afghan foreign affairs by signing the Treaty of Rawalpindi in August 1919. In commemoration of this event, Afghans celebrate August 19 as their Independence Day.",
        "flag": "https://www.worldometers.info/img/flags/af-flag.gif"
    },
    {
      "country": "Albania",
        "information": "Albania began as a colony established by the Greeks over 600 years before Christ. After periods under the control of the Romans, Byzantines, Normans, Venetians, Slavs, and kings of Naples, Albania came under the control of the Ottoman Empire for over 400 years. Independence was achieved in 1912, although the country was occupied by Austria-Hungary and Italy, countries which had been instrumental in its creation. Eventually, a tribal chief named Ahmed Zogu was named president of the republic in 1924, though he named himself King Zog I, four years later. A socialist republic was established in 1946, after World War II. During that war, a resistance leader emerged, named Enver Hoxha. He had seized power in 1944. After 1946, the country was virtually closed to the outside world and a totalitarian regime developed. Hoxha became closely involved with China, following his break with the Soviet Union over Communist doctrine. That link, too, was broken in 1977 and Albania all but ceased to participate in any world affairs. Hoxha died in 1985 and by the early 1990s, anarchy and chaos was the norm in the country. In 1994, a measure of order was restored, only to have problems return in 1997. NATO came to help establish an Albanian army in 1998 at a time when ethnic Albanians began rebelling in Kosovo (Yugoslavia) and were ultimately driven out of that province and into Albania. In late 1998, internal disarray continued with violence erupting between the Democratic Party and the Socialists, who had been in control since 1997.",
        "flag": "https://www.worldometers.info/img/flags/al-flag.gif"
    },
    {
        "country": "Algeria",
        "information": "Algeria is an ancient country with a history that extends back several thousand years to the time of the Phoenicians. The Romans, followed by the Germanic Vandal tribes and the Byzantines all ruled the area. When Islam grew mighty in the 8th century A.D., the Berbers of Algeria were converted to that religion and a unique civilization flourished. Some eight centuries later, Spain conquered Algiers and other cities but was driven out by Barbarossa who brought Algeria into the Turkish Ottoman Empire. From this point, piracy became an important money-making tool for the country, so much so that by 1800, the US, England, and France joined in an effort to combat piracy in the Mediterranean. Ottoman rule over the country was brought to an end by the French in 1830. In 1848, following an Islamic rebellion, France made Algeria a legal part of France. In the mid-1950s, a guerilla effort arose to oust the French led by the FLN (Front de Liberation Nationale) and in 1962, independence was declared. Immediately, about a million colonists left Algeria for France. Times have been turbulent for Algeria since independence, including close relations with the Soviet Union and a struggle between fundamentalist Islamists and the military. Since 1992, over 40,000 people have died due to civil unrest and assassinations. In 1999, elections were held; only one candidate remained in the race: Abdelazziz Bouteflika. His government reached agreement with the Islamic rebels in September 1999.",
        "flag": "https://www.worldometers.info/img/flags/ag-flag.gif"
    },
    {
      "country" : "Angola",
        "information": "Angola's land has been inhabited by Bantu tribes for thousands of years. The Portuguese arrived in 1575 and began an enormous slave trade from Angola to Brazil that took over 3 million people into slavery over the course of 3 centuries. By the late 19th century, Angola was a colony of Portugal, with Portuguese in control of the local government, commerce, and agriculture. But by the 1950s, there was a call for independence, led by the National Front. Guerilla activity soon ensued. The Portuguese ultimately fled and independence was declared on November 11, 1975. Peace did not arrive, however, with civil war erupting between the MPLA and UNITA factions. Though the MPLA set up a Marxist regime, many parts of the country were actually under UNITA control. Fighting continued through the 1980s and it was not until 1991 that a cease-fire was obtained between the government and UNITA. It was short-lived, however, since renewed fighting began after the results of the 1992 elections (the first in the country since 1975). The MPLA won but UNITA's Jonas Savimbi did not accept the election outcome. Though the United Nations tried for 4 years to get the situation under control, the conflict continues and has taken at least 100,000 lives since the 1970s.",
        "flag": "https://www.worldometers.info/img/flags/ao-flag.gif"
    },
    {
      "country" : "Antigua",
        "information": "Antigua was claimed by Christopher Columbus in 1493 and settled by the British some 140 years later. Tobacco and sugar were the two commercial mainstays but with slavery abolished in 1834, several natural disasters occurring in the 1840s, and the closing of a Royal Dockyard in 1854, the economy suffered. Independence was granted in 1981 and the Antigua Labor Party remains at the government helm. Tourism forms the principal economic base of the country today.",
        "flag": "https://www.worldometers.info/img/flags/ac-flag.gif"
    },
    {
        "country" : "Argentina",
        "information": "Europeans first discovered Argentina in 1502 during the voyage of Amerigo Vespucci. In 1580 the Spanish founded a colony in Buenos Aires. By 1800 Buenos Aires had a population of 50,000. In 1816 Argentina declared it independence from Spain. In 1824 a constitutional assembly passed a constitution. Conservative political forces for the rest of the 19th century dominated Argentina. During this period the country grew rapidly. In 1916 Radical forces took control of the government. They were ousted in 1935. In 1946 Juan Peron took control of the government. Peron was ousted in 1955 by the military. The military maintained power until 1973, when violence forced the military to allow the return of Peron. He died the next year and his third wife Isabella Peron took over. She was able to maintain power for only two years. The military regained power and instituted a very repressive regime in which 20,000 leftist disappeared. When Argentina occupied the Falkland Islands in 1982 the British defeated the Argentineans and reoccupied the Falklands. The defeat resulted in the fall of military government. In 1989 Carlos Memen became the President of the country and began serious economic and political reform.",
        "flag": "https://www.worldometers.info/img/flags/ar-flag.gif"
    },
    {
        "country" : "Armenia",
        "information": "After the destruction of the Seleucid Empire, the first Armenian state was founded in 190 BC. At its zenith, from 95 to 55 BC, Armenia extended its rule over the area of what is now eastern Turkey. For a time, Armenia was the strongest state in the Roman East. It became part of the Roman Empire and adopted a Western political, philosophical, and religious orientation. In 301 AD, Armenia became the first nation to adopt Christianity as a state religion, establishing in the 6th century a church that still exists independently of both the Catholic and the Eastern Orthodox churches. During its later political eclipses, Armenia depended on the church to preserve and protect its unique identity. Between the 4th and 19th centuries, Armenia was conquered and ruled by, among others, Persians, Byzantines, Arabs, Mongols, and Turks. For a brief period from 1918 to 1920, it was an independent republic. In late 1920, the communists came to power, and in 1922, Armenia became part of the Trans-Caucasian Soviet Socialist Republic. In 1936, it became the Armenian Soviet Socialist Republic. Armenia declared its independence from the Soviet Union on September 23, 1991.",
        "flag": "https://www.worldometers.info/img/flags/am-flag.gif"
    },
    {
        "country" : "Australia",
        "information": "In 1770 Captain James Cook discovered Australia in 1770. The British first settled Australia in 1788 as a penal colony. On January 1 1901 commonwealth was declared in Australia. Australian forces fought in both World Wars. In 1973 racially discriminatory immigration policies were ended. IN 1998 the Australian Constitutional Convention voted to sever all ties with Great Britain. A national referendum failed to approve this move.",
        "flag": "https://www.worldometers.info/img/flags/as-flag.gif"
    },
    {
        "country" : "Austria",
        "information": "The Austro-Hungarian Empire played a decisive role in central European history. It occupied strategic territory containing the southeastern routes to Western Europe and the north-south routes between Germany and Italy. Although present-day Austria is only a tiny remnant of the old empire, it retains this unique position. Soon after the Republic of Austria was created at the end of World War I, it faced the strains of catastrophic inflation and of redesigning a government meant to rule a great empire into one that would govern only 6 million citizens. In the early 1930s, worldwide depression and unemployment added to these strains and shattered traditional Austrian society. Resultant economic and political conditions led in 1933 to a dictatorship under Engelbert Dollfuss. In February 1934, civil war broke out, and the Socialist Party was outlawed. In July, a coup d'etat by the National Socialists failed, but Dollfuss was assassinated by Nazis. In March 1938, Austria was incorporated into the German Reich, a development commonly known as the ''Anschluss'' (annexation).",
        "flag": "https://www.worldometers.info/img/flags/au-flag.gif"
    },
    {
        "country": "Azerbaijan",
        "information": "This ancient region has been occupied by a variety of peoples including the indigenous nomadic Azeris, as well as Persians, Muslims, Arabs, Turks, Mongols, and Russians. Because of its geographic location, the capital Baku has been important in controlling the Caspian Sea. Though the Persians, Ottomans, and Russians wrestled with each other for hegemony over the area during the 18th and 19th centuries, it was the Russians who eventually gained the upper hand through the Treaty of Turkmenchai (1828), which gave them the northern part of the land. Persia got the southern half. The Russians transformed Azerbaijan into an industrial center. It also became a revolutionary center. Though the first republic established in 1918 was overthrown in 1920 by the Soviet Red Army, a separate Azerbaijan Soviet Socialist Republic did come into being. During the period under Soviet domination, the country underwent industrial growth, collectivization of agriculture, and religious persecution. In 1988, Azerbaijan went to war against neighboring Armenia over the Naborno-Karabakh region (ethnically Armenian, but within Azerbaijan territory). The ensuing hostilities continue. With the fall of the Soviet Union, Azerbaijan has had difficulties with issues of democracy as it tried to hold free and honest elections in 1995 and 1998. Charges of vote-rigging persist and officials sent to monitor the elections of 1998 charged that there were serious irregularities in the process.",
        "flag": "https://www.worldometers.info/img/flags/aj-flag.gif"
    },
    {
        "country": "Bahamas",
        "information": "In 1492, Christopher Columbus made his first landfall in the Western Hemisphere in The Bahamas. Spanish slave traders later captured native Lucayan Indians to work in gold mines in Hispaniola, and within 25 years, all Lucayans perished. In 1647, a group of English and Bermudan religious refugees, the Eleutheran Adventurers, founded the first permanent European settlement in The Bahamas and gave Eleuthera Island its name. Similar groups of settlers formed governments in The Bahamas until the islands became a British Crown Colony in 1717. The first Royal Governor, a former pirate named Woodes Rogers, brought law and order to The Bahamas in 1718, when he expelled the buccaneers who had used the islands as hideouts. During the American Civil War, The Bahamas prospered as a center of Confederate blockade-running. After World War I, the islands served as a base for American rumrunners. During World War II, the Allies centered their flight training and anti-submarine operations for the Caribbean in The Bahamas. Since then, The Bahamas has developed into a major tourist and financial services center. Bahamians achieved self-government through a series of constitutional and political steps, attaining internal self-government in 1964 and full independence within the Commonwealth on July 10, 1973.",
        "flag": "https://www.worldometers.info/img/flags/bf-flag.gif"
    },
    {
        "country": "Bahrain",
        "information": "For thousands of years, the area of Bahrain has been on the trade route between India and Arabia. Though the Portuguese managed to gain control of the area in the 16th century, the Persians ousted them in the 17th century. A century later, Bahrain was a sheikhdom of the Ottoman Empire and by 1861, it was a British protectorate. It took over another 100 years for the country to achieve independence. At present, the United States maintains a base here that played an important role during the Gulf War of 1991. Though there has been unrest in the country, reflecting its high unemployment, repressive government, and the vast gap between rich and poor, the family-run government has maintained control with Hamad bin Isa al-Khalifa succeeding his father, the founding emir, in 1999.",
        "flag": "https://www.worldometers.info/img/flags/ba-flag.gif"
    },
    {
        "country": "Bangladesh",
        "information": "The area that came to be Bangladesh was ruled by Buddhist kings for 400 hundred years until being conquered by the Muslims about 1200 A.D. In the 16th century it was absorbed into the Moghul Empire and by 1642 the British had arrived in the form of the British East India Company. One hundred years later, the area was entirely under British rule. In 1947, India achieved independence with Hindu (West) Bengal assigned to India and the East (Muslim) area given to Pakistan. Nearly a quarter of a century later, the Eastern Bengal claimed its own independence with civil war ensuing. An astounding 10 million refugees fled to India. Since independence, Bangladesh has remained one of the world's poorest nations, marked by instability in every realm along with a tendency to be in the path of natural disasters.",
        "flag": "https://www.worldometers.info/img/flags/bg-flag.gif"
    },
    {
        "country": "Barbados",
        "information": "Great Britain claimed Barbados in 1620 by that time all local inhabitants were removed by the Spanish. The island remained a British colony, until it achieved independence in 1963. It remains part of the British Commonwealth.",
        "flag": "https://www.worldometers.info/img/flags/bb-flag.gif"
    },
    {
        "country": "Belarus",
        "information": "Belarus has been inhabited since prehistoric times, and the first recorded settlements date back to the 6th century AD. The princes of Kiev ruled Belarus until the invasion of the Mongols in 1240, when most of its towns were destroyed. The region came under the control of powerful Lithuanians and, in 1386, under the Lithuanian-Polish Jagiellonian Dynasty. For centuries, the Poles and the Muscovites struggled bitterly over Belarus. In 1772, Catherine the Great gained control over part of the country, and, by 1795, Russia ruled all of Belarus. During the 19th and 20th centuries, the country again became a European battleground. Napoleon passed through Belarus--and fought there--in 1812, and the Germans fought the Soviets on Belarusian territory in World War I. Although a Soviet Socialist Republic was proclaimed in January 1919, fighting with Poland continued until 1921. Belarus suffered heavy losses in World War II, when some 2.2 million inhabitants perished. The postwar period saw a significant rebirth-- especially in the economic sphere. On August 25, 1991, Belarus declared its independence from the Soviet Union.",
        "flag": "https://www.worldometers.info/img/flags/bo-flag.gif"
    },
    {
        "country": "Belgium",
        "information": "From the time of Julius Caesar Belgium was ruled by a series of rulers. In 1830 Belgium became and an independent monarchy. In both World War I and World War II Belgium's neutrality was violated by the Germans who invaded. It was a major battleground during the war. Belgium recovered rapidly from World War II and was a founding member of European Union.",
        "flag": "https://www.worldometers.info/img/flags/be-flag.gif"
    },
    {
        "country": "Belize",
        "information": "The Mayan civilization spread into the area of Belize between 1500 BC and AD 300 and flourished until about AD 1200. Several major archeological sites -- notably Caracol, Lamanai, Lubaantun, Altun Ha, and Xunantunich -- reflect the advanced civilization and much denser population of that period. European contact began in 1502 when Columbus sailed along the coast. The first recorded European settlement was begun by shipwrecked English seamen in 1638. Over the next 150 years, more English settlements were established. This period was also marked by piracy, indiscriminate logging, and sporadic attacks by Indians and neighboring Spanish settlements. Great Britain first sent an official representative to the area in the late 18th century, but Belize was not formally termed the Colony of British Honduras until 1840. It became a crown colony in 1862. Subsequently, several constitutional changes were enacted to expand representative government. Full internal self-government under a ministerial system was granted in January 1964. The official name of the territory was changed from British Honduras to Belize in June 1973, and full independence was granted on September 21, 1981.",
        "flag": "https://www.worldometers.info/img/flags/bh-flag.gif"
    },
    {
      "country":"Benin",
        "information": "Benin was a center of African civilization, wealth, and strength seven hundred years ago, though its early history goes back even farther. Much of its commercial success came as a result of the slave trade, which began after Europeans arrived there in the late 15th century and continued until 1885. Under French domination until independence in 1960, the country found it hard to stabilize after the French withdrew. Over two decades of corrupt Marxist-led rule left the economy in disastrous shape and led to the ouster of the Marxist regime in 1991. In 1995, the Marxists regained power but in 1998, were again ousted.",
        "flag": "https://www.worldometers.info/img/flags/bn-flag.gif"
    },
    {
      "country":"Bhutan",
        "information": "A Lamaistic Buddhist theocracy was established in Bhutan in the 16th century. Bhutan came under the domination of the British in India in 1865. It became a British protectorate in 1910. After India was granted independence from Great Britain, it granted Bhutan independence in 1949.",
        "flag": "https://www.worldometers.info/img/flags/bt-flag.gif"
    },
    {
      "country":"Bolivia",
        "information": "Bolivia was part of the Incan Empire from the 13 th century until the Spanish conquered it in the 1500's. The Spanish discovered large amounts of silver which in the area, and that became the primary focus of the colony. Simon Bolivar liberated Bolivia in 1825, being the last Spanish possession in South America to achieve independence. . Bolivia was on the losing side of a number of wars over the years with its neighbors; each war resulted in Bolivia losing territory to its neighbors. From 1962 until 1984 Bolivia was ruled by the military.",
        "flag": "https://www.worldometers.info/img/flags/bl-flag.gif"
    },
    {
      "country":"Bosnia and Herzegovina",
        "information": "It geographic location has placed the region squarely in the midst of European political power struggles for hundreds of years. Racial divisions, made worse by ever-changing borders and religious rivalries: Muslim, Roman Catholic, and Eastern Orthodoxy. While Yugoslavia kept the peace under Marshall Tito (and for a time after his death, as well) the fall of Communism signaled the beginning of the end for the tenuous unity of the area. In 1992, Bosnia and Herzegovina voted for independence, but the military (of Yugoslavia and mostly Serb) refused to recognize this move and began the siege of Sarajevo. Horrific episodes of so-called ''ethnic cleansing'' began as the Serbs attempted to clear Bosnia of Muslims and Croats. In 1995, a peace accord was finally signed dividing the region into a Serb republic and a Muslim-Croat federation, which would be governed under the same president and legislature. UN peacekeeping have been in the area since 1995.",
        "flag": "https://www.worldometers.info/img/flags/bk-flag.gif"
    },
    {
      "country":"Botswana",
        "information": "The Batswana, a term inclusively used to denote all citizens of Botswana, also refers to the country's major ethnic group (the ''Tswana'' in South Africa), which came into the area from South Africa during the Zulu wars of the early 1880s. Prior to European contact, the Batswana lived as herders and farmers under tribal rule. In the late 19th century, hostilities broke out between the Batswana and Boer settlers from the Transvaal. After appeals by the Batswana for assistance, the British Government in 1885 put ''Bechuanaland'' under its protection. The northern territory remained under direct administration and is today's Botswana, while the southern territory became part of the Cape Colony and is now part of the northwest province of South Africa; the majority of Setswana-speaking people today live in South Africa.",
        "flag": "https://www.worldometers.info/img/flags/bc-flag.gif"
    },
    {
      "country":"Brazil",
        "information": "Portuguese arrived in Brazil in 1500. They found a local Indian population. They first began trading with the Indians and then subdued them. The Portuguese and other Europeans started growing sugar in Brazil. The Portuguese gained full control over the early part of the 17th century. In 1822 Brazil became independent, with Don Pedro as the emperor. In 1865 Brazil became involved in a bloody five-year war with Paraguay. In 1888 slavery was abolished and the next year the emperor was overthrown by the military. 1889-1930 was the period of the ''old Republic''. It was overthrown by the military in 1930. From 1945 until 1964 the Second Republic was in power. Democracy was reinstituted in 1985.",
        "flag": "https://www.worldometers.info/img/flags/br-flag.gif"
    },
    {
      "country":"Brunei",
        "information": "The Brunei Empire achieved its height during between the 15 and 17th centuries. European influence resulted in the decline of the empire. Brunei was part of the British sphere of influence, and in 1881 it became a British protectorate. The discovery of oil in Brunei insured the fact that the colony became very wealthy. In 1984 Brunei was granted independence from Great Britain.",
        "flag": "https://www.worldometers.info/img/flags/bx-flag.gif"
    },
    {
      "country":"Bulgaria",
        "information": "Bulgaria was initially a part of the Byzantine Empire. When the Byzantine Empire fell it became independent. The Ottoman Empire conquered it in 1396. Bulgaria remained a member of the empire until 1878 when it became partially independent. It achieved full independence in 1908. Bulgaria participated in the Balkans Wars, which resulted in its loss of territory. During World War II Bulgaria was allied with Germany. At the end of the war the Soviet Union occupied the country and installed a communist government in Bulgaria. In 1990 a democratic government took control of Bulgaria.",
        "flag": "https://www.worldometers.info/img/flags/bu-flag.gif"
    },
    {
      "country":"Burkino",
        "information": "Until the end of the 19th century, the history of Burkina Faso was dominated by the empire-building Mossi, who are believed to have come from central or eastern Africa sometime in the 11th century. For centuries, the Mossi peasant was both farmer and soldier, and the Mossi people were able to defend their religious beliefs and social structure against forcible attempts to convert them to Islam by Muslims from the northwest. When the French arrived and claimed the area in 1896, Mossi resistance ended with the capture of their capital at Ouagadougou. In 1919, certain provinces from Cote d'Ivoire were united into a separate colony called the Upper Volta in the French West Africa federation. In 1932, the new colony was dismembered in a move to economize; it was reconstituted in 1937 as an administrative division called the Upper Coast. After World War II, the Mossi renewed their pressure for separate territorial status and on September 4, 1947, Upper Volta became a French West African territory again in its own right.",
        "flag": "https://www.worldometers.info/img/flags/uv-flag.gif"
    },
    {
      "country":"Burundi",
        "information": "The Hutu were the original settlers of Burundi. A few hundred years ago the Tutsi's arrived in the area and gained control over the Hutu in a semi feudal arrangement. European exploration of Burundi began in 1858. In 1899 Burundi was incorporated into German East Africa. Following World War I the League of Nations award the Burundi territory to Belgium. In 1962 Burundi achieved independence. Its government was initially a constitutional monarchy, but a military coup soon brought the military to power. In 1972 a Hutu rebellion left 10, Tutsi dead, a year later the Tutsi responded by slaughtering 150,000 Hutu. In the years, since Burundi has had one unstable government after another. Violence between Hutu and Tutsi has continued on and off throughout these years.",
        "flag": "https://www.worldometers.info/img/flags/by-flag.gif"
    },
    {
      "country":"Cambodia",
        "information": "Cambodia was an important power in Southeast Asia as far back as 13 centuries ago, with the Khmer Empire stretching from Cambodia, to Thailand, to Laos, and Vietnam. Their dominance of the area waned in the 14th century and the area eventually became a French protectorate (1863). Japan occupied Cambodia during World War II, but the French returned following the war's conclusion. In 1953, Prince Norodom Sihanouk led Cambodia to independence, the french having been defeated in Indochina. Cambodia's stability was severely challenged during the Vietnam War with the rise of the Khmer Rouge (Communist rebels). Sihanouk was deposed in 1970 by Lon Nol. Five years later, the Khmer Rouge captured Phnom Penh. Their leader, the despotic Pol Pot , conducted a reign of terror unlike any every seen in Asia. His regime was responsible for the deaths of at least 3 million people and the dispersion of hundreds of thousands more. Through the 1980s and early 1990s, various degrees of chaos plagued the country, which finally held elections in 1993. Though the Royalist forces captured about 40% of the vote, they agreed to join with the Cambodian People's Party in government sharing but by 1997, the coalition plan had deteriorated and Sihanouk was exiled. New elections were held in 1998 with the People's Party candidate Hun Sen victorious. Another coalition government was organized with Hun Sen as Premier and Sihanouk's son as President of the Assembly. By 1999, the last of the Khmer Rouge had surrendered or captured. The delicate balance of peace in Cambodia may hang on how the country handles the issue of war trials in the near future.",
        "flag": "https://www.worldometers.info/img/flags/cb-flag.gif"
    },
    {
      "country":"Cameroon",
        "information": "This African nation was settled over a millennium ago. Outsiders, in the form of the Portuguese who arrived about 500 years ago, eventually made their way to this coastal region. The brisk slave trade decimated the indigenous population, leaving the country unable to resist foreign domination. The Germans created it a protectorate in 1884, but the British and French invaded the area during World War I. The war's end saw Cameroon divided into French and British mandated regions. During the Second World War, the French mandate declined to accept Vichy control and instead made itself available to the Free French forces under Charles de Gaulle. In 1960, independence was achieved following the elimination of the French mandate. A portion of the British mandate later joined with Cameroon with the remaining areas choosing to unite with Nigeria. In 1972, the United Republic of Cameroon was created, though it became once again the Republic of Cameroon in 1984. Over the ensuing decades, the political structure has evolved from a one-party system to multiparty with the first such elections held in 1992.",
        "flag": "https://www.worldometers.info/img/flags/cm-flag.gif"
    },
    {
      "country":"Canada",
        "information": "Canada's earliest inhabitants arrived via the Berling land bridge 15,000 years ago. The first Europeans were the Vikings who established a short-lived colony in New Foundland. In 1608 a French trading post was established at Quebec. In 1663 New France was organized as a French colony. The French lost Canada to the British in the French and Indian war which lasted from 1756-63. During the US Revolutionary War 40,00 loyalist fled the American colonies for Canada. The US failed to capture Canada during the War of 1812. After the war of 1812 Britain e3ncouraged large scale immigration to Canada from Great Britain. In 1867 the Dominion of Canada a self-governing body within the British Empire was established. Sir J.A. Macdonald became the dominions first Prime Minister.",
        "flag": "https://www.worldometers.info/img/flags/ca-flag.gif"
    },
    {
      "country":"Central A. R.",
        "information": "Though this African region has been open to development since the 1800s, it was not until 1889 that a European settlement was set up by the French. Five years later, the region became the territory of Ubangi-Shari and in 1910, became part of French Equatorial Africa. Self-governing since 1958, the country was granted independence two years later. Originally a republic, the army overthrew the elected government in 1966. The coup leader, Jean-Bedel Bokassa, was given the title of president-for-life in 1972 but four years later, declared himself an emperor and the country the Central African Empire. In 1979, Bokassa was exiled to France and country became a republic once more. But in 1981, the army once again took over, banning political parties and it was not until 1991 that the country legalized opposition parties. Since elections in 1993, the government led by Ange Felix Patisse has attempted to limit the powers of the army but the military has not been quelled. In 1996 alone, France was asked to help Patisse twice in keeping army-led rebellions in check.",
        "flag": "https://www.worldometers.info/img/flags/ct-flag.gif"
    },
    {
      "country":"Chad",
        "information": "A nation long on history but short on development, Chad has faced serious difficulties over the centuries since ancient settlements were supplanted by the kingdoms of Kanem-Bornu, Baguirmi, and Ouaddai. For three hundred years beginning in 1500, the slave trade was active in the area, with Arab raiders providing slaves for European traders. In the lat 19th century, the French penetrated into the area and fought the Arab Muslim local leaders until the region became a French governorship in 1905. Control was not easy for the French to establish, and it took nearly another decade until French dominance was complete. It became a colony within French Equatorial Africa in 1920. After the dissolution of FEA in 1950, Chad became a member of the French Community, with full independence achieved in 1960. Five years later, a civil war began pitting the Muslim north and east against the southern-led government. French assistance was unsuccessful in preventing the hostilities. A military coup in 1975 was an attempt to bring the dispute to a close but it filed and despite some transient governmental compromises, civil war flared again in 1980. Libya was asked to help restore the peace, which it did, briefly before civil war broke out again in 1982. It was not until 1988 that the war was declared over. Stability was still not in sight as the 1990s dawned with another attempt to change the system by force: General Idriss Deby ousted the ruling government, with the idea of instituting a multiparty democracy. Deby won elections that were held in 1996. The country remains desperately poor and underdeveloped industrially.",
        "flag": "https://www.worldometers.info/img/flags/cd-flag.gif"
    },
    {
      "country":"Chile",
        "information": "The Spanish came to the region in the 1530s, but indigenous peoples had long populated the area. For several hundred years, Spanish rule continued but eventually the forces of independence won out in 1818. With independence did not come stability, however, and a decade-and-a-half elapsed until a constitution was promulgated that established the government format for almost the next 60 years when a civil war erupted between presidential forces and the Congress. With the defeat of the presidentialists, the system shifted to one of parliamentary dominance. This led to difficulties in political and social decision-making with the result being strikes and other problems at the turn of the century. The military, responding to the government's inability to arrange for their wages, ousted the parliamentary government in 1925. By 1933, a new constitution had been instituted, which set the tone for government for almost the next four decades. In 1970, Dr. Salvador Allende Gossens became president after an intense Congressional debate. Allende proceeded to nationalize the country's vital copper industry and the international community responded with a boycott that helped cripple the economy, particularly as the government also nationalized the coal and steel industries and much of the banks. Unhappiness in the country reached such levels that the military took action in 1973, taking over the government and killing Allende. General Augusto Pinochet Ugarte became president and the next years saw thousands of Chileans arrested and killed by the junta. Pinochet lasted until 1988 as calls for the end of the Pinochet dictatorship became impossible to resist. He was replaced by a member of the Christian Democratic Party in 1990, bringing to a close 17 years of military rule.",
        "flag": "https://www.worldometers.info/img/flags/ci-flag.gif"
    },
    {
      "country":"China",
        "information": "China, an ancient civilization, was largely indifferent to the ebb and flow of European concerns until the late 18th century when social and other pressures led to the country acceding to the establishment of foreign enclaves in Chinese territory. In the decades between 1850 and 1870, more than 20 million Chinese died as a result of multiple uprisings including the Taiping Rebellion. The country's movement towards a non-imperial political system began with the fall of the last dynasty in 1911 and the rise of Sun Yat-sen's Nationalist Party in 1919 and Mao Zedong's Chinese Communist Party in 1921. Though the two briefly collaborated in 1922, they eventually parted company when Chiang Kai-shek took over the Nationalist party after the death of Sun Yat-sen in 1925. The fierceness of their rivalry led to civil war following World War II. The Nationalist forces fled to Taiwan and the Communists declared a People's Republic in 1949. During much of the early Cold War, the Soviet Union and China were cooperative partners but Chinese fears about Soviet intentions in the nuclear arena led Mao to expel Soviet advisors in 1958 and break with the USSR.",
        "flag": "https://www.worldometers.info/img/flags/ch-flag.gif"
    },
    {
      "country":"Columbia",
        "information": "Another of the South American regions that fell to conquerors in the 1500s, Colombia was part of the Spanish Viceroyalty of Peru till the mid-18th century when it became part of a new viceroyalty encompassing what is now Colombia, Ecuador, Panama, and Venezuela. In 1810, the region achieved independence from Spain but it would not be until 1886 that Colombia was made a single republic. As in much of the world, the depression of 1929 augured serious economic and political problems for the country and a civil war broke out in 1930. In 1934, President Alfonso Lopez Pumarejo put forth a plan for reform known as ''Revolution on the March.'' In the decade between 1948 and 1957, 'La Violencia' erupted, leading to the deaths of hundreds of thousands of Colombians. The 1957 plan that ended the violence laid out the provisions for power-sharing between the warring Conservative and Liberal parties. This system came to be weakened with the rise of terrorist and other groups -- both left and right -- that challenged the two-party arrangement. Fighting the mushrooming drug trade has taken center stage in Colombia for decades and with it, violence against the government, the military, and civilians.",
        "flag": "https://www.worldometers.info/img/flags/co-flag.gif"
    },
    {
      "country":"Comoros",
        "information": "This island nation has been Islamic since the 16th century. French colonial rule was advanced in the decades between 1841 and 1912; political autonomy was not granted until 1961 and independence not until 1975. The president, Ahmed Abdallah Abderemane, was ousted that year by a mercenary force, though he returned to power three years later. In 1989, he was assassinated but the rebels responsible were forced to back down under French pressure. The 1990s brought a new constitution and the first democratic elections in 1992. Problems such as difficult weather, the lack of much arable land, and a poor infrastructure linking the islands has kept the Comoros underdeveloped.",
        "flag": "https://www.worldometers.info/img/flags/cn-flag.gif"
    },
    {
      "country":"Dem. Rep. Congo",
        "information": "Portuguese traders and explorers brought the slave trade to the Congo, wreaking havoc on the native peoples of the region. The Belgians hired Henry Stanley to set up trading stations along the Congo River in 1878; soon after, King Leopold created the Congo Free State as a personal possession that he ruled both as king and as chief shareholder! The harsh conditions of the Free State drew the ire of both the US and Britain and, with promises of reform, Belgium transformed the Free State into a true colony called the Belgian Congo. The region was rich in natural resources and by the 1920s, it was a major provider of diamonds, gold, copper, rubber, and other products. The entire infrastructure of the country was in the hands of the Belgians -- native peoples participated in only the most local levels of government. Independence was declared in 1960 -- and many Europeans fled immediately, fearing the consequences: a bloody conflict and many atrocities.",
        "flag": "https://www.worldometers.info/img/flags/congo-flag.gif"
    },
    {
      "country":"Costa Rica",
        "information": "Costa Rica became an independent republic in 1838. Democratic elections did not occur until more than 50 years later. While the country has enjoyed a largely peaceful history since 1948 when a brief civil war erupted over the issue of electoral fraud. After the hostilities ceased, the Costa Rican army was abolished. Major government concerns at present revolve around the economy with attempts to reign in government spending.",
        "flag": "https://www.worldometers.info/img/flags/cs-flag.gif"
    },
    {
      "country":"Croatia",
        "information": "Croatia's history as an independent nation dates back to the 10th century. In 1102, Hungary's king began to rule over the Croats. From the 1300s on, Croatia, together with Hungary and Serbia, represented Europe's defensive wall against the encroaching Ottoman empire. In 1526, the region was added to the Habsburg dynasty, coming under Austrian control. After the collapse of the Habsburgs during the first World War, Croatia became part of Yugoslavia but chafed under Serbian control. During World War II, the Croats engaged in ''ethnic cleansing'' such that about 100,000 Serbs and Jews were murdered in Croatia. In 1946, the Croats joined the newly re-established Yugoslavia (Tito was himself a Croat). They declared their secession from the republic in 1991 and war broke out. In 1996, the Yugoslav-Croat war was ended with Yugoslavia recognizing formal borders for Croatia and establishing diplomatic relations.",
        "flag": "https://www.worldometers.info/img/flags/hr-flag.gif"
    },
    {
      "country":"Cuba",
        "information": "Indigenous peoples of several tribes occupied Cuba by the time Columbus first made his way there in 1492. And while much of Spain's American empire dissolved in the early part of the 19th century, Cuba remained a colonial outpost of Spain until the 1890s. With the end of the Spanish American War, Cuba was made a US protectorate and the United States was given the right to intercede in Cuba as it saw fit. In the first half of the 20th century, Cuba experienced many political problems, starting with corruption and going on to include repression. When Fidel Castro and his revolutionary followers overthrew the long-time dictator Batista in 1959, there was hope and expectation that he would usher in democratic reform to the island. Instead, Castro has ruled Cuba since then with an iron hand. It has angered the US with its support for left-leaning regimes and its stubborn adherence to Communism even after the fall of its chief patron, the USSR.",
        "flag": "https://www.worldometers.info/img/flags/cu-flag.gif"
    },
    {
      "country":"Cyprus",
        "information": "Cyprus been revealed through archeological work as having been inhabited for at least 10,000 years. Long an important part of eastern Mediterranean trade, Cyprus saw civilizations come and go: the Phoenicians, the Romans, the Byzantines, even the English passed through during the Crusades as Richard the Lion-Hearted established a crusader entity at the end of the 12th century. In 1489, Venice took over Cyprus and then came the Ottomans in 1571. Placed under British control by the Congress of Berlin in 1878, it was annexed by Britain in 1914. Eleven years later, Britain made Cyprus a formal colony. Tensions between the Greek Cypriots and the Turkish Cypriots have led to violence at various points, post World War II. In 1974, Turkey invaded Cyprus and occupied the northern 40% of the island. The occupation has continued, though the international community has not seen fit to recognize the area's self-proclaimed status as the Turkish Republic of Northern Cyprus (1983). The rest of the island has prospered with reasonable political stability, foreign investment, and tourism.",
        "flag": "https://www.worldometers.info/img/flags/cy-flag.gif"
    },
    {
      "country":"Czech Rep.",
        "information": "The origins of the Czech republic go back to the Moravian empire of the ninth century. After being destroyed by the Magyars, Bohemia and Moravia existed as an independent kingdom within the Holy Roman Empire. From 1526 until the first World War, the throne was held by the Habsburgs. Of the entire Austro-Hungarian empire, no where was richer than this region due to a combination of natural resources and well-developed agriculture. Industry was also pursued in urban areas and comfortable middle classes developed, principly Jewish and German. The state of Czechoslovakia was an outgrowth of the end of the Habsburg monarchy. Czechs (less than half the population) were placed in the position of controlling a variety of different ethnicities including Germans, Slovaks, magyars, Poles and Ukrainians. This relatively stable and workable arrangement came to an end with Hitler's annexation of the Sudetenland in 1938.",
        "flag": "https://www.worldometers.info/img/flags/ez-flag.gif"
    },
    {
      "country":"Denmark",
        "information": "Denmark controlled an enormous swath of land in the 1000s: Iceland, Greenland, Britain, Norway, and more. Several hundred years later, Britain was out of Denmark's orbit but Sweden and Finland had been acquired. But through the succeeding centuries, Finland, Sweden, and Norway all took different paths -- Finland and Sweden to independence and Norway to the control of Sweden. Other possessions went to Prussia (Schleswig-Holstein) and even the United States (Virgin Islands, sold in 1914). Iceland became independent, too, in 1944. Before World War II, Denmark signed a nonaggression agreement with Germany which was broken months later when the Nazis invaded Denmark. Despite this occupation, the Danes managed to save over 7,000 Jews by sending them to safe haven in Sweden. Post-war, Denmark has enjoyed peace and fluctuating economic fortunes. As in many of the Scandinavian countries, Denmark's comprehensive social welfare policies requires high taxes and even Denmark's generally impressive economic growth faltered in the 1970s. But, along with the rest of the world, Denmark's economy improved in the 1980s.",
        "flag": "https://www.worldometers.info/img/flags/da-flag.gif"
    },
    {
      "country":"Djibouti",
        "information": "This strategically-located small region became important in 1869 with the opening of the Suez Canal. The French maintained their sphere of influence, called French Somaliland, through agreements with Ethiopia. After the Italian invasion of Ethiopia in the 1930s, tensions flared between the French and the Italians. With the outbreak of World War II, the territorial government initially sided with Vichy France, but shortly thereafter went with the Free French and the Allies. Though it became part of the French Overseas community in 1958, nationalist fervor was growing and in 1977, the republic was born.",
        "flag": "https://www.worldometers.info/img/flags/dj-flag.gif"
    },
    {
      "country":"Dominica",
        "information": "Before Columbus' voyages to the Caribbean, Dominica was inhabited by Carib indians. Though Spanish ships passed through from then on, the island was actually settled by Europeans in the 17th century and those Europeans were French missionaries. The island came under British rule in 1763. Variously tied to the Leeward Islands, the Windward Islands, and then the West Indies Federation, Dominica embarked upon a political relationship with Britain (1967) which culminated in independence for Dominica in 1978.",
        "flag": "https://www.worldometers.info/img/flags/do-flag.gif"
    },
    {
      "country":"Dominican Rep.",
        "information": "Two-thirds of the island of Hispaniola is accounted for by the Dominican Republic (the rest of the island is Haiti). Another of Columbus' stops in 1492, the Dominican Republic boasts the oldest continually inhabited European-founded settlement in the New World. The hemisphere's oldest monastery, hospital and cathedral are all here. Variously under Spanish, Haitian, and even US rule, the Dominican Republic came under the dictatorial rule of Rafael Trujillo in 1930 that lasted for the next three decades. In the 1960s, political instability in the country led to a US invasion in 1965. From 1966 to 1978, Joaquin Balaguer served as president. He was returned to the office in 1986, 1990, and 1994 (although the last election was challenged on the grounds of fraud leading Balaguer to serve only until 1996 (he was 89 years old at the time).",
        "flag": "https://www.worldometers.info/img/flags/dr-flag.gif"
    },
    {
      "country":"Ecuador",
        "information": "Under the rule of the Incan empire until the coming of the Spanish in 1532, Ecuador came to serve as an important administrative center for the viceroyalty of Peru. Independence came centuries later in 1822. For the next eight years, Ecuador was part of the Gran Colombia federation. Eventually, the Catholic Church achieved special prominence in the country such that citizenship was linked to the religion, Jesuits were brought in to oversee education, among other actions. But in 1895, the anti-church party, the Radical Liberals, seized power and held it for the next half-century. Politically, the country has been essentially stable with the economy generally secure, particularly as oil was discovered in the 1960s.",
        "flag": "https://www.worldometers.info/img/flags/ec-flag.gif"
    },
    {
      "country":"El Salvador",
        "information": "The indigenous people of El Salvador resisted the coming of the Spanish in 1524. But it took another three hundred years for them to finally throw off the yoke of Spain, becoming first a jurisdiction of Mexico, and then a member of the United Provinces of Central America. in 1840, after a bloody civil war, El Salvador achieved independence as a republic. Coffee was the mainstay of the country's economy from about 1860 and the country structured its laws such that a coffee oligarchy was created. A reform candidate who won election in 1931 was dismissed by the military which set off a revolt that killed perhaps 20,000 citizens, mostly peasants. But from that period until the 1970s, the country experienced political stability. But in 1979, a military-led coup overthrew the government and a civil war was unleashed that lasted for over 12 years and caused over 70,000 deaths. Peace was officially restored by treaty in 1992.",
        "flag": "https://www.worldometers.info/img/flags/es-flag.gif"
    },
    {
      "country":"Egypt",
        "information": "One of the best known of the ancient civilizations was that of Egypt. At least 5000 years before Christ, there arose on the Nile a culture of brilliance which still captivates the world. Dynasty followed dynasty until the Persians replaced the last one about 340 years before Christ. But the Persians were themselves overthrown by Alexander, the Ptolemys, and finally the mighty Romans. But with the crumbling of the Roman empire, the Byzantine arose which ruled until the Arab Islamic wave spread over the region. The Mamelukes controlled Egypt from about 1250 until their defeat by the Ottomans in 1517.",
        "flag": "https://www.worldometers.info/img/flags/eg-flag.gif"
    },
    {
      "country":"Eq. Guinea",
        "information": "This western African country includes both mainland territory and a number of islands. The indigenous Pygmy population was supplanted by various peoples from about the 1600s on. The Portuguese explorer Fernando Po came to the islands in 1473 and the area remained under Portuguese control until 1778, when it was relinquished to Spain. Development, however, was sparse under the Spanish, with the exception of plantations devoted to the production of cocoa. The region was accorded the status of a Spanish province in 1959 and at this point, investment from the mother country made Equatorial Guinea's population one of the most prosperous and well-educated in Africa. Granted autonomy in 1963, independence followed in 1968. The country's first president banned opposition parties two years later and in 1972, made himself president for life. His rule by decree was marked by a reign of terror such that at least a third of the population was killed or exiled. Nigerian workers, who had long formed the backbone of the plantation economy, were expelled (along with other foreigners) in 1976, a move which proved ruinous to the once-healthy economy.",
        "flag": "https://www.worldometers.info/img/flags/ek-flag.gif"
    },
    {
      "country":"Eritrea",
        "information": "This region once part of Ethiopia, fought for thirty years to gain independence and in May 1993, the Eritrean People's Liberation Front declared itself independent, a move recognized by the US, Sudan, and other countries, including Ethiopia. Part of the Italian empire in the beginning of the 20th century, it was ruled by Britain during World War II. Though Britain appended the area to Ethiopia in 1952, secession efforts commenced almost immediately. Though hopes were high that independence would bring all hostilities to a close, in 1995, Eritrea began to skirmish with Yemen over control of Greater Hanish Island in the Red Sea. Then, in 1998, Eritrea and Ethiopia heated up their border. This costly effort has resulted in many casualties on both sides, though the US tried to mediate. The war came to an end with a ceasefire in June 2000.",
        "flag": "https://www.worldometers.info/img/flags/er-flag.gif"
    },
    {
      "country":"Estonia",
        "information": "Though related to the people of Finland, the Ests of Estonia had been a colony of Denmark, the Teutonic Knights, Swedes, Poles, and Russians. And through it all, Germanic burghers ruled the towns of the region. The Ests, tied to the land, were primarily serfs (serfdom not being abolished until 1819). A nationalist spirit began to surface with interest in folklore, language, and history. In 1920, a fully independent Estonia emerged thanks to the 1918 Treaty of Brest-Litovsk. This period of independence came to a halt with the 1939 Hitler-Stalin pact as Estonia was given over to the Soviets as a sphere of influence.",
        "flag": "https://www.worldometers.info/img/flags/en-flag.gif"
    },
    {
      "country":"Ethiopia",
        "information": "Legend tells us that Ethiopia was founded by the son of King Solomon and the Queen of Sheba. Whether this is so or not, indisputable is that Ethiopia was known as an important part of classical trade routes as far back as 500 years before Christ. Christianized in the 4th century, Ethiopia managed to counter Islamic invasion in the 600s. But its Coptic Christians were then cut off from Christian centers by the now-Islamic countries of northern Africa and the rest of the Middle East. Portugal arrived in the 15th century, using Ethiopia to bolster their trade across the Indian Ocean. The Portuguese tried to introduce Roman Catholicism to little avail. In the early 17th century, Ethiopia expelled all missionaries. An Italian effort to invade in 1880 was also successfully foiled.",
        "flag": "https://www.worldometers.info/img/flags/et-flag.gif"
    },
    {
      "country":"Fiji",
        "information": "Though the islands of Fiji were first visited by Abel Tasman in the mid-17th century, it was not until 1874 that the region was made a British crown colony. To work the enormous sugar plantations, the British brought in so many Indians, that the indigenous population soon was outnumbered by those of Indian heritage. In 1970, Fiji was declared an independent parliamentary democracy with most of the power resting in the hands of the Fijian minority. Seventeen years later, the Indian party came to power but was ousted in a military coup almost immediately. Lt. Col. Sitiveni Rabuka took over the government; five years later he became prime minister. A new constitution was adopted that guaranteed ethnic Fijians the majority of seats in the legislature. In May 1999, new elections brought another Indo-Fijian candidate to the premiership but simmering resentments came to the boiling point a year later when ethnic Fijians overthrew the government.",
        "flag": "https://www.worldometers.info/img/flags/fj-flag.gif"
    },
    {
      "country":"Finland",
        "information": "Originally from the Ural mountains and with a semi-unique language related more to Hungarian and Estonian than to any of the Scandinavian tongues, Finns came to their land via Siberia in the 700s. The indigenous peoples, the Lapps, were displaced into the northernmost areas of Scandinavia. Four hundred years later, Christianity arrived in the form of Swedish conquerors. In the 1500s, the land of the Finns became a Swedish grand duchy and even today, ethnic Swedes comprise about 7% of the population. Located unluckily between Sweden and Russia, Finland was often the site of battles between the dueling competitors. In 1809, the country was ceded to Russia. After the communist revolution, Finland perceived its chance to try for independence; after a civil war, Finland became independent for the first time ever in its history.",
        "flag": "https://www.worldometers.info/img/flags/fi-flag.gif"
    },
    {
      "country":"France",
        "information": "Celtic tribes were the original inhabitants of the territory known as Gaul. Two hundred years before Christ, the Romans conquered the Mediterranean coast, colonized long before by Phoenicians and Greeks. Julius Caesar successfully conquered all of Gaul between 58 and 51 B.C., making the region a province of the Roman empire. Christianity quickly reached Gaul in the first century A.D. Visigoths, Franks, and Burgundii, barbarian invaders all, arrived in the fifth century and by 486, the Franks had unified the country, become Christians, and established the Merovingian line. Saracens attacked in the 600s but in 732, they were defeated by Charles Martel, whose grandson was Charlemagne. The Pope declared Charlemagne ruler of the West in 800. As a result of waves of Viking assaults in the ninth century, France was broken up into regions that were ruled by nobles -- some were actually independent states, more or less, such as Aquitaine, Burgundy, Flanders, Anjou, and Blois.",
        "flag": "https://www.worldometers.info/img/flags/fr-flag.gif"
    },
    {
      "country":"Gabon",
        "information": "This western African republic's population is a eclectic blend of peoples who arrived there over the course of some 700 years. The Portuguese first came in the 1400s, and then the Dutch, French, and british arrived several hundred years later, their eyes on the slave trade, primarily. France made the area a semi-protectorate in 1839-41 and worked to abolish the still-active slave trade. In 1903, France put a colonial administration in place and in 1910, the region became part of French Equatorial Africa. In gratitude for the part played by its residents during World War II (it was a base for Free French activity), Charles de Gaulle gave French citizenship to all the territory's people. Gabon became independent in 1960. Politically, the country has been relatively stable since independence and has recently been successful in drawing foreign investment to the country, particularly since it has evolved into a multiparty democracy.",
        "flag": "https://www.worldometers.info/img/flags/gb-flag.gif"
    },
    {
      "country":"Gambia",
        "information": "French and British colonial interests collided on this region around the Gambia river in Africa. The Portuguese arrived first in 1455, but British traders obtained from them exclusive rights to the river in 1588. The French and British tussled for two centuries to control the area but in 1783, the French conceded. It became a British crown colony in 1889 and a constitutional monarchy within the British Commonwealth in 1965. Five years later, The Gambia became a republic, under Sir Dawda K. Iawara. His rule lasted until 1994, when he was ousted in a coup led by Yahya Jammeh. The US, the UK and the European Union all cut off further aid until such time as democracy would be restored.",
        "flag": "https://www.worldometers.info/img/flags/ga-flag.gif"
    },
    {
      "country":"Georgia",
        "information": "Though first independent four centuries before Christ in the time of Alexander the Great, Georgia's history since is one of domination by other powers and peoples. From the Persians to the Mongols, to the Turks and Persians again, the region of the Gorj people was divided up into petty principalities, some under Turkish rule and others under Persian. The Persian principalities were absorbed into Russia in 1801 and by the turn of the 20th century, the remaining Turkish hold-out was also taken by Russia. The communist revolution of 1917 seemed to be an opportunity for Georgia to reassert its independence, Georgia was incorporated into the Soviet Union in 1921 and made one of the union republics in 1936. But nationalism has always been strong in Georgia, and in 1988 the call became irresistible. But though Georgia was seeking to break free of the Soviet Union, some of its provinces were trying to break free of Georgia. Fighting broke out, particularly in Abkhazia, and the conflict raged for two years (1991-1993). More than 2,000 died. President Eduard Shevardnadze asked his Parliament to grant him extraordinary powers to put down the rebellion. In 1994, Georgia became a member of the Commonwealth of Independent States. In 1995, Shevardnadze won reelection to a new term, but the unrest in Abkhazia continues, Russian troops are still present, and there have been attempts on Shevardnadze's life, which make future developments difficult to predict.",
        "flag": "https://www.worldometers.info/img/flags/gg-flag.gif"
    },
    {
      "country":"Germany",
        "information": "The region that would become Germany was populated by Germanic tribes well before the coming of the Roman empire to the region. Though they largely resisted Rome, some served in the Roman legions. Germanic barbarian invasions did, however, contribute to the ultimate fall of Rome. Charlemagne united most of the region, but it was a fragile unity and during the time of the Holy Roman Empire, there were several hundred individual political bodies in the territory of the Germanic peoples. The political fragmentation grew only more complex in the 16th century with the Protestant Reformation, which had its roots in Germany. The Congress of Vienna agreed to the creation of a German League composed of 39 states. Of these were 5 kingdoms including Prussia which went on to conquer its neighboring states and declare a German empire under its chancellor, Otto von Bismarck. Germany became an industrial powerhouse in the late 19th century, with a modest colonial empire and serious military aspirations. Kaiser Wilhelm II ruled the german empire at its height just prior to the First World War. Germany's defeat in that war was so complete, however, and the terms of its surrender so humiliating that the seeds were sown for an even greater catastrophe, the Second World War. The Weimar Republic, set up after the war, was never able to truly overcome the economic problems, labor unrest, and political fragmentation of the post-war period. Hitler became chancellor in 1933, functionally ending the Weimar Republic and ushering in one of the darkest chapters in world history.",
        "flag": "https://www.worldometers.info/img/flags/gm-flag.gif"
    },
    {
      "country":"Ghana",
        "information": "The Portuguese first came to the area in 1471, lured by gold and slavery. The British, Danes, and Dutch all came to trade slaves here and this is where most American slaves originated. After the abolition of the slave trade, the British made the region a protectorate in 1871 and a colony in 1886. In 1952, Kwame Nkrumah became the colony's prime minister and later, the country's first prime minster after independence was achieved in 1960. Blessed with gold and diamonds, the country seemed poised for development and economic wealth. But Nkrumah began to look to the Communist bloc; he also outlawed opposition in 1964. In 1966, Nkrumah was ousted by a military council. Though there have been some civilian governments since, in 1981 another military man took power. Flt. Lt Jerry Rawlings had been unable to improve Ghana's serious economic difficulties until the World Bank intervened. In 1989, Ghana managed a 6% growth rate, although political instability remains. In 1994, fighting erupted between the Konkomba and Manumba peoples in the north of the country, leaving many dead and over 150,000 refugees.",
        "flag": "https://www.worldometers.info/img/flags/gh-flag.gif"
    },
    {
      "country":"Greece",
        "information": "Greece produced the most brilliant of the ancient civilizations. At its apex, between the fifth and third centuries B.C., the Greeks were the indisputable leaders of the world in philosophy, art, politics, and science. The civilization of Greece was spread by commerce and by war, as much of the known world fell to Alexander the Great. Upon his death, however, the empire began to disintegrate. It was absorbed into the Roman Empire, and later into the Byzantine. When the Ottomans swept to power, they also took over Greece (1460) which they controlled for the next 350 years. Under the Ottomans, the Greeks preserved their national heritage and in 1821, Greece rebelled against the Ottomans. Supported by a powerful trio of friends (Russia, Britain, and France), Greece declared its independence in 1827.",
        "flag": "https://www.worldometers.info/img/flags/gr-flag.gif"
    },
    {
      "country":"Grenada",
        "information": "Grenada was under the control of the Carib Indians in the 1600s. Then the British and French struggled to establish control over the island until 1783 when the British won. Gaining independence in 1974, the government was displaced in a coup headed by the leftist New Jewel Movement in 1979. Another coup in 1983 ended with the assassination of New Jewel Movement leader Maurice Bishop. The United States invaded and power was restored to the hands of the governor-general. In the early 1990s, a coalition government was in place until 1995 when the New National party, headed by Keith Mitchell, gained a majority in Parliament. Mitchell became prime minister. In 1999 elections, the party won all 18 seats in Parliament.",
        "flag": "https://www.worldometers.info/img/flags/gj-flag.gif"
    },
    {
      "country":"Guatemala",
        "information": "Heart of the Mayan empire, the region that would become Guatemala, was taken by the Spanish in 1524. Guatemala also became the center of the United Provinces of Central America after 1821, when Spanish rule was overthrown. In 1838, Guatemala became independent, following the dissolution of the United Provinces. For nearly a century, the Liberal party held power in Guatemala. Communist support became evident in the 1945 elections and Jacobo Arbenz was deposed in 1954 in a US-supported military coup. Since then, it has been the military which controls Guatemala's government. All has not been peaceful, however, as civil war between the military and antigovernment guerrillas raged from 1960 to the 1990s. In 1994, an agreement was reached to bring the civil war to a close, but implementation stalled while aspects of the pact were debated including amendments to the constitution. The US, angered by the country's failure to bring to justice military officers who had committed war crimes. In 1997, the 36-year long civil war seemed to have been concluded.",
        "flag": "https://www.worldometers.info/img/flags/gt-flag.gif"
    },
    {
      "country":"Guinea",
        "information": "A trade crossroads long before Europeans appeared on the scene, Guinea was part of several empires over the 500 year period between the 10th and 15th centuries. The French came early in the 1600s and in 1845, they formalized the relationship by making Guinea a French colony (it was named French Guinea in 1893). After World War II, French Guinea became part of the Federation of French West Africa. In 1958, the region rejected membership in the Fifth French Republic and all political ties were dissolved. Independence was declared. Sekou Toure led the new government, remaining in power until his death in 1984. A military government, headed by General Lansana Conti, took over almost immediately upon Toure's passing. Conti was elected president in 1993 and in 1995, Guineas's first multiparty elections took place, with Conti's Unity Progress party taking 71 of 114 seats in the legislature. In 1996, Conti was succeeded by Sidia Toure.",
        "flag": "https://www.worldometers.info/img/flags/gv-flag.gif"
    },
    {
      "country":"Guyana",
        "information": "The Dutch began colonizing this South American region in the early 17th century. The British and the French also sought to dominate here and eventually, the British succeeded: it became a British colony in 1831. In 1966, independence was declared and from then till 1992, the same party was in power (People's National Congress). The party, socialist in ideology, nationalized most of the large companies in the country which contributed to a resource-rich country remaining relatively poor and dependent on foreign aid. In 1992, the People's Progressive Party took over but made little inroads into privatizing the potentially lucrative bauxite and sugar industries. After the death of party leader Cheddi Jagan in March 1997, the prime minister became president and Jagan's widow became prime minister. Elections held later that year brought Mrs. Jagan into power but opposition to these results by the members of the People's National Congress led to mass demonstrations and rioting. The PNC represents the interests of black Guyanese while the PPP is primarily the party of Guyana's East Indians. In 1999, Mrs. Jagan resigned and was succeeded by Bharrat Jagdeo.",
        "flag": "https://www.worldometers.info/img/flags/gy-flag.gif"
    },
    {
      "country":"Haiti",
        "information": "Haiti occupies part of the island of Hispaniola, which was 'discovered' by Columbus in 1492. The indigenous tribe, the Arawaks, were either murdered, worked to death, or killed off by European diseases against which they had no defenses. The french got control of the western third of the island in 1697 because French pirates so relentlessly beleaguered the area. Slaves made the region economically advantageous to the French. A slave revolt, however, resulted in abolition of slavery. Independence was declared in 1804, but political stability would be a long time coming for the country. From the mid-1800s through the mid-1900s, the US began to exert considerable influence in Haiti. For nearly two decades, in fact, Haiti was under US military occupation (1915-194). In 1957, Francois ''Papa Doc'' Duvalier seized control and commenced a repressive rule of the country. His son, Jean-Claude (''Baby Doc'') came to power in 1971. under the Duvalier's most of the better-educated and wealthy citizens fled to more hospitable locales. ",
        "flag": "https://www.worldometers.info/img/flags/ha-flag.gif"
    },
    {
      "country":"Honduras",
        "information": "Though the Mayan empire extended to the area of what became Honduras, the region became important to Europeans in the 1570s when silver was discovered. Honduras was a province of Spain in the 1700s, though the British controlled the Caribbean coast. Honduras joined the federation United Provinces of Central America, after winning its freedom from Spain, and later, Mexico, but the United Provinces fell in 1838, leaving Honduras an independent republic. An element of political unrest was constant in Honduras until 1932 when gen. Tuburcio Carias Andino became president, a position he held until 1949. Civilian rule was interrupted in 1963 with a military coup. The military controlled the country until 1982. The civil wars raging in Nicaragua and El Salvador were of concern to Honduras, particularly since the Nicaraguan Contras used Honduran territory. The US, which supported the Contras, also funneled military and other aid to Honduras. With the demobilization of the Contras, tensions were relieved and Honduras began to concentrate on reducing the power of the military. In 1999, the legislature voted to put the military, heretofore sacrosanct, under civilian control.",
        "flag": "https://www.worldometers.info/img/flags/ho-flag.gif"
    },
    {
      "country":"Hungary",
        "information": "Since its conversion to Western Christianity before AD 1000, Hungary has been an integral part of Europe. Although Hungary was a monarchy for nearly 1,000 years, its constitutional system preceded by several centuries the establishment of Western-style governments in other European countries. Following the defeat of the Austro-Hungarian Dual Monarchy (1867-1918) at the end of World War I, Hungary lost two-thirds of its territory and nearly as much of its population. It experienced a brief but bloody communist dictatorship and counterrevolution in 1919, followed by a 25-year regency under Adm. Miklos Horthy. Although Hungary fought in most of World War II as a German ally, it fell under German military occupation following an unsuccessful attempt to switch sides on October 15,1944. In January 1945, a provisional government concluded an armistice with the Soviet Union and established the Allied Control Commission, under which Soviet, American, and British representatives held complete sovereignty over the country. The Commission's chairman was a member of Stalin's inner circle and exercised absolute control.",
        "flag": "https://www.worldometers.info/img/flags/hu-flag.gif"
    },
    {
      "country":"Iceland",
        "information": "The Vikings came to Iceland in the ninth century. There, Europe's oldest representative body was founded, the Althing. About the year 1000, Christianity arrived. First under Norwegian rule (1200s) and then under the Danish (1380), Iceland had to wait until 1918 to gain its independence, although it continued to share a king with Denmark. When the Nazis occupied Denmark during World War II, Iceland declared itself a republic. An early member of the United Nations and NATO, Iceland has no armed forces (the US operated a base at Keflavik). The population of Iceland is one of the world's most educated and healthiest; comprehensive social benefits are available to all thanks to the country's Scandinavian-style welfare state.",
        "flag": "https://www.worldometers.info/img/flags/ic-flag.gif"
    },
    {
      "country":"India",
        "information": "Dating back at least 5000 years, civilization in India has been a rich and complicated mix of peoples and religions. Brahminism, Buddhism, Jain, Hinduism all developed here in a series of kingdoms and empires. The Gupta dynasty ruled over a golden age for north India for about two hundred years (320-544 A.D.). In the 600s, the Indus River Valley was invaded by Arabs, who brought with them Islam, which took hold in northern India. The Sultanate of Delhi was established in 1206. It managed to withstand repeated Mongol invasions and eventually succeeded in bringing together nearly all of India (with the exception of some of the southern states). But the Sultanate of Delhi was weakened by the stresses of internal rebellion, particularly when combined with the attack of Timur Leng (Tamerlane) in 1398. In 1526, Babur established the Moghul empire, whose culture thrived under Akbar the Great. Threats to the Moghul empire from Marathan and Rajput were compounded by the encroaching interests of the European powers, who came to india in 1498 in the person of Vasco de Gama.",
        "flag": "https://www.worldometers.info/img/flags/in-flag.gif"
    },
    {
      "country":"Indonesia",
        "information": "The region once known as the East Indies was home to several Hindu and Islamic kingdoms long before Europeans arrived in the 16th century. A century later, the Dutch East India Company was largely in control, although in 1799, its bankruptcy forced the Dutch government to establish direct rule, The Dutch managed to maintain their hold on the East Indies, even in the face of growing nationalism and anticolonial uprisings. Though the Japanese captured the islands during World War II -- and some viewed them as liberators -- the nationalists prevailed and in 1945, declared Indonesia's independence under Sukarno. Indonesia took its place as a leader of the nonaligned nations of the Third World. Under Sukarno, Indonesia moved left (looking towards China) but when the army crushed an attempted coup in 1965, the ensuing turmoil resulted in the deaths of hundreds of thousands, killed as suspected communists.",
        "flag": "https://www.worldometers.info/img/flags/id-flag.gif"
    },
    {
      "country":"Iran",
        "information": "Persia and Babylonia were unified into the Persian Empire by Cyrus the Great in 549 B.C. Though Alexander the Great conquered Persia about two hundred years later, Persia did regain its independence after Alexander's death. The Persian Sassanian empire established in 226 A.D. was a formidable rival to the Roman Empire. It remained until Islam swept into the region in 641, displacing Zoroastrianism which had been the principal religion. The Mongols arrived in the early 1200s and their rule persisted until 1502. The Safavid dynasty ruled until 1736 but its end ushered in two hundred years of decline for Persia. Britain and Russia began to assert control over Persia in the 19th century. The defacto situation was formalized in a 1907 agreement between the two powers that divided Persia into specified spheres of influence. After the First World War, Persia was independent -- but in reality, the country was still treated as a protectorate of Britain. By 1921, the Soviet Union had given up all claims to Persian territory.",
        "flag": "https://www.worldometers.info/img/flags/ir-flag.gif"
    },
    {
      "country":"Iraq",
        "information": "Mesopotamia, the ancient name for the region now known as Iraq, was the birthplace of one of the oldest civilizations known to mankind. The Sumerians arose some 3000 years before Christ and from their city-states, the empire of Babylonia developed. Babylon fell to the Assyrians in 1350 B.C., and then to the Persians under Cyrus and Darius. persian rule would define the area for the next millennium. Islam began expanding in the 600s A.D. and quickly absorbed the Persian-ruled areas. The Caliphate was moved to Baghdad in 762. After the Mongols attacked Baghdad in 1258, the region declined such that it was easy pickings for the Ottomans in 1534 and thus Iraq remained for nearly 400 years. In 1915, the British occupied Iraq and after World War I, Britain continued to govern under the provisions of a League of Nations mandate. Under British supervision, a Hashemite monarchy was established in 1921. The kingdom became independent in 1932 but continued its close relationship with Britain, one predicated on the oil and defense interests of the British.",
        "flag": "https://www.worldometers.info/img/flags/iz-flag.gif"
    },
    {
      "country":"Ireland",
        "information": "St. patrick converted the Celtic tribes of Ireland to Christianity in the fifth century. Irish missionaries then went out to Scotland, England, and Europe and, while Rome disintegrated, Ireland stood as a cultureal, religious, and educational center. But the Viking invasion changed Ireland: the destruction wrought in the 9th and 10th centuries left ireland isolated and poor. In 1014, Brian Boru reestablished an Irish monarchy. A century later, England turned its eye to Ireland as henry II became overlord. Eventually, another Henry -- the Eighth -- would declare himself monarch of Ireland as well. Henry brought the Reformation to Ireland at great hardship to the Catholic country. The Catholic Mass was made an act of treason. When rebellion arose in 1641, it was crushed by Cromwell over the course of a ten-year struggle, ending with the terrible massacre at Drogheda. The Irish supported James II against William of Orange, butJames was defeated at the Battle of the Boyne in 1690, which sealed Ireland's fate as England imposed desctructive economic sanctions on the country as a result.",
        "flag": "https://www.worldometers.info/img/flags/ei-flag.gif"
    },
    {
      "country":"Israel",
        "information": "The creation of the State of Israel in 1948 was preceded by more than 50 years of efforts by Zionist leaders to establish a sovereign nation as a homeland for Jews. The desire of Jews to return to what they consider their rightful homeland was first expressed during the Babylonian exile and became a universal Jewish theme after the destruction of Jerusalem by the Romans in 70 A. D. and the dispersal that followed. It was not until the founding of the Zionist movement by Theodore Herzl at the end of the 19th century that practical steps were taken toward securing international sanction for large-scale Jewish settlement in Palestine--then a part of the Ottoman Empire. The Balfour declaration in 1917 asserted the British Government's support for the creation of a Jewish homeland in Palestine. This declaration was supported by a number of other countries, including the United States, and became more important following World War I, when the United Kingdom was assigned the Palestine mandate by the League of Nations.",
        "flag": "https://www.worldometers.info/img/flags/is-flag.gif"
    },
    {
      "country":"Italy",
        "information": "Italy's forebears, the Romans, dominated the known Western world from about 500 years before Christ until the fifth century A.D. In the fourth century, the empire began to falter when it was divided between Rome and Byzantium. While the Byzantine empire strengthened, Rome suffered waves of barbarian assaults which led to its functional dissolution into small nobilities and independent cities. These city-states eventually achieved considerable power. Venice and Genoa came to control the seas, while Florence and Sienna became wealthy through agriculture and commerce. This wealth provided the underpinnings for the Renaissance which bloomed between the 13th and 15th centuries. The powers in Europe, including Austria, Spain, and France, all tried to extend their dominion to Italy. Napoleon set up a Kingdom of Italy (as a French satellite) but his death resulted in t return to the old situation with Austria dominating in the north. In the 19th century, nationalism began to stir and another Kingdom of Italy was brought about by Garibaldi and di Cavour in 1861.",
        "flag": "https://www.worldometers.info/img/flags/it-flag.gif"
    },
    {
      "country":"Jamaica",
        "information": "Spain initially claimed Jamaica through Columbus (he came to the island in 1494) and controlled it until they were forced to cede it to Britain in 1655. During those 160-plus years, the Spanish set about eliminating the island's native population, the Arawaks. Pirates favored Jamaica and it also could claim the dubious distinction of having one of the world's most active slave markets. The economy that needed slaves to work the island's vast sugar plantations, faltered when the slavery was abolished in 1833 especially as it was coupled with the removal of tariff protection in 1846. Jamaica gained its independence in 1962 but the intervening years have been marred by an uncertain economy and bitter racial and class divisions.",
        "flag": "https://www.worldometers.info/img/flags/jm-flag.gif"
    },
    {
      "country":"Japan",
        "information": "This nation with an ancient history has played a far more pivotal role in world events than its small size would seem to warrant. Through a succession of kings, the country saw its culture develop and thrive from the 3rd century on. By 1603, the region was controlled by Tokugawa Ieyasu who established his government in Edo (later Tokyo). At this time the structure of Japanese feudalism was established, including uncompromising class divisions and Christianity was suppressed (the Jesuits had sent Francis Xavier to Japan during the late 16th century). Tokugawa and those who succeeded him were successful in isolating the country from nearly the entire outside world. With the exception of a minor Dutch trading site, Japan had no contact other peoples and cultures for 250 years to come. But in 1854, Commodore Perry came to Japan and forced the reluctant country to open diplomatic relations with the US and engage in commercial exchanges.",
        "flag": "https://www.worldometers.info/img/flags/ja-flag.gif"
    },
    {
      "country":"Jordan",
        "information": "Jordan was created out of the greater mandated Palestine following World War I. The British saw an opportunity to appease Abdullah, a son of Hussein ibn Ali, who was ruler of the Hejaz in Arabia. In 1923, the Kingdom of Transjordan was carved out of the area of mandated Palestine and the Hashemite dynasty began. Though Transjordan was an Allies supporter during World War II, in 1948 the country joined the Arab League, changed its name to Jordan. and participated in the 1948 war with Israel. As a consequence of this conflict, Jordan gained territory: the West Bank and the Old City of Jerusalem which were annexed n 1950. Many of the Arab refugees from that war were placed in camps in the West Bank and the population of Jordan is today, overwhelmingly Palestinian.",
        "flag": "https://www.worldometers.info/img/flags/jo-flag.gif"
    },
    {
      "country":"Kazakhstan",
        "information": "The people of this region are of Mongol and Turkic origin who presence in Kazakhstan dates back thousands of years. Islam came to the area between the 7th and 9th centuries and the Mongols held sway from the early 13th through the mid-15th centuries. At this point the Kazakhs were recognized as a distinct entity but eventually infighting resulted in a tri-part split into the larger, Middle, and Lesser Hordes. When the Mongols again invaded in the mid-1600s, the Kazakhs turned to Russia for protection; a century later, Russia completely dominated the Kazakh lands. The situation worsened after 1861 when Russian and Ukrainian peasants flowed into Kazakhstan after the freeing of the serfs and were given Kazakh lands.",
        "flag": "https://www.worldometers.info/img/flags/kz-flag.gif"
    },
    {
      "country":"Kenya",
        "information": "The Portuguese came early to Kenya (1498) and dominated the area until the sultans of Oman took control in 1729. Eventually, the British established a protectorate over the region, first at the coast in 1890 and later throughout the interior (1895). By 1920, Kenya held the status of colony, and was inhabited by a large and prosperous British community. Though the Italians briefly took control of northern Kenya during World War II (they came from Italian Ethiopia) Britain quickly regained control and even permitted some limited participation in local government to the native Africans in Kenya. In the 1950s, the violent Mau Mau rebellion emerged to fight against British colonial rule. In 1963, independence was achieved and Kenya joined the British commonwealth shortly thereafter. ",
        "flag": "https://www.worldometers.info/img/flags/ke-flag.gif"
    },
    {
      "country":"Kuwait",
        "information": "Part of the Ottoman empire from the late 16th century, Kuwait became a principality under the al-Sabahs in 1756. British influence grew in the region such that in 1899, Kuwait was made a British protectorate. After World War II, Kuwait's vast oil reserves helped transform it into a wealthy state indeed with citizens receiving all services at no cost (they also pay no taxes!) Kuwait won its independence in 1961. In August 1990, Iraq invaded Kuwait touching off a crisis that culminated in the Gulf War. A coalition of forces successfully defeated Iraq, though Iraq did destroy much of the country's infrastructure.",
        "flag": "https://www.worldometers.info/img/flags/ku-flag.gif"
    },
    {
      "country":"Korea",
        "information": "According to Korean legend, the god-king Tangun founded the Korean nation in BC 2333. By the first century AD, the Korean Peninsula was divided into the kingdoms of Silla, Koguryo, and Paekche. The Silla kingdom unified the peninsula in 668 AD. The Koryo dynasty (from which the Western name Korea is derived) succeeded the Silla kingdom in 935. The Choson dynasty, ruled by members of the Yi clan, supplanted Koryo in 1392 and lasted until the Japanese annexed Korea in 1910.",
        "flag": "https://www.worldometers.info/img/flags/ks-flag.gif"
    },
    {
      "country":"Kyrgyzstan",
        "information": "The Kyrgyz people date back to at least 13 centuries and were one of the significant central Asian tribes . Their territory came to be controlled by Mongols, Kalmyks, Manchus, and Russians, among others. Relatively late (the mid-1600s) the Kyrgyzstan became Muslim although they soon came under Chinese domination. In 1868 the area became a Russian protectorate and, several years later, was incorporated into the greater Russian empire. The Communist Revolution was accompanied by chaos and confusion in the region by in 1936, it was made a formal Socialist Republic of the Soviet Union. Along with other of the former SSRs, Kyrgyzstan chose independence after the fall of communism, but it did join the Commonwealth of Independent States.",
        "flag": "https://www.worldometers.info/img/flags/kg-flag.gif"
    },
    {
      "country":"Laos",
        "information": "Inhabited by the Lao and Hmong peoples and long dominated by its stronger neighbors (Thailand and Vietnam), Laos was made a protectorate of France in 1893. It was not until 1949 that France granted Laos local autonomy. With France's withdrawal from Indochina in 1954, Laos became independent. As the war in Vietnam raged, Laos faced challenges from within: the Laotian Communist Party. In 1975, the Pathet Lao took control of the capital and declared the Lao People's Democratic Republic. Many Laotians fled to Thailand in the aftermath of the communist take-over. Vietnam has played a significant role in Laos, with troops stationed in the country. The first election was not held until 1989 and a new constitution was confirmed in 1991.",
        "flag": "https://www.worldometers.info/img/flags/la-flag.gif"
    },
    {
      "country":"Latvia",
        "information": "In the 1200s, Latvia existed as a German colony, thanks to the influx of missionaries, merchants, and knights. But three hundred years later, the region came under the domination of Sweden, followed by Lithuania. In the 18th century, the Russians absorbed Latvia into Peter the Great's empire. Following World War II, Latvia was accorded political independence but that was short-lived as Stalin made the country a republic of the Soviet Union in 1940. As in many of the republics, Soviet rule was repressive and a strong undercurrent of nationalism still existed. In 1988, Latvian was made the country's official language (replacing the hated Russian) and beginning in 1990, Latvia's intention to secede were made openly. The Russians tried to prevent this -- a crackdown by the military was carried out early in 1991 but later that year, independence was declared. Along with other Baltic states, Latvia opted not to sign the agreement that created the Commonwealth of Independent States. In 1995, Latvia was made an associate member of the European Union and applied for formal membership.",
        "flag": "https://www.worldometers.info/img/flags/lg-flag.gif"
    },
    {
      "country":"Lebanon",
        "information": "Traditionally and historically a part of Syria, Lebanon's ancient cities of Tyre, Tripoli, and Sidon were key centers of the Phoenician empire. Later, the country was divided among many Christian sects, Druze, and Moslems. The region was strongly dominated by France from the late 18th century and after the first World War, France received Lebanon and Syria as a mandate from the League of Nations. Though Lebanon became a republic in 1926, full independence was not achieved until 1944. Between 1944 and the early 1970s, Lebanon enjoyed a comfortable prosperity based on international banking and trade. This period came to a close as the Palestinians began to use Lebanese territory from which to stage attacks on Israel. In 1975, civil war broke out between Christians against Moslems and the Palestinians joining in against the Maronite Christians. Thousands died and much of the formerly cosmopolitan Beirut was left in ruins. In 1981, Christian militiamen fought Syrian troops and all the others combatants joined in.",
        "flag": "https://www.worldometers.info/img/flags/le-flag.gif"
    },
    {
      "country":"Lesotho",
        "information": "The kingdom of Lesotho is completely surrounded by the Republic of South Africa. Though its original inhabitants were Bushmen, other populations arrived from the 1500s through the 1800s as refugees from various tribal conflicts in the surrounding countries. Made a British protectorate in 1868, it was not until nearly a century later (1966) that independence was attained. The country's political road has been rocky and for much of the time since independence the constitution has been in abeyance. The military ruled for a time in the early 1990s and there have been problems with elections, including the last ones in May 1998, as questions have been raised as to the reliability of their results.",
        "flag": "https://www.worldometers.info/img/flags/lt-flag.gif"
    },
    {
      "country":"Liberia",
        "information": "The Portuguese were the first Europeans to reach the region that would become Liberia in 1461, but though other soon followed, the country remained of little interest to the outside world (except for a small trade in slaves and some other products). This changed in the early 19th century when the US Congress granted a charter to the American Colonization Society to proceed with the repatriation of slaves back to Africa from America. (Interestingly, the descendants of these slaves have always played a disproportionately large role in the country's politics though they are a minority numerically). In 1822, the first group arrived and by 1838 the Commonwealth of Liberia had been organized. Independence as a republic, was declared in 1847 with a constitution designed along the lines of the US constitution. Over the course of the next 14 years, the world powers Britain, France and the US all recognized Liberia. William Tubman became president in 1944 and served until 1971. After Tubman's death, the country faltered and eventually a military government came to power through a coup (1980). Though elections were eventually held (1985) disagreement about the veracity of the tally led to another coup attempt (1985). In 1989, fighting erupted between antigovernment rebels and government supporters. Though attempts were made to end the hostilities, a ceasefire only came in late 1990. In 1995, fighting broke out once more, especially in the capital city of Monrovia. Brought to a halt by ceasefire in 1996, more than 150,000 citizens had died. The country is currently facing the challenges of rebuilding an economy and a people decimated by war.",
        "flag": "https://www.worldometers.info/img/flags/li-flag.gif"
    },
    {
      "country":"Libya",
        "information": "Libya's origins go back to the misty early eras of history. The conquerors of the coastal region included Phoenicians, Carthaginians, Berbers, Romans and Vandals until in the 4th century, the Byzantines claimed the coast. Nomadic tribes in the interior of the country were untouched by the coastal maneuvering. Early on (the 7th and 8th centuries) Islam came to Libya and in the beginning of the 16th century, the Ottomans arrived via their victory over Egypt. The Italians claimed Libya in 1911 but the country was unhappy under Italian control, mounting local resistance to the Italians. During World War II, the British ousted Italian and German forces from Libya (1943), opening the door for King Idris to return in 1944. Though a part of the country was placed under a British protectorate, a smaller portion was given to the French to administer. Independence was achieved in 1951.",
        "flag": "https://www.worldometers.info/img/flags/ly-flag.gif"
    },
    {
      "country":"Lithuania",
        "information": "Sharing linguistic and cultural roots with Latvia, Lithuania's early history was significantly different. It was successful in fending off invading knights and maintaining the country's sovereignty and religion. In the 1300s, Lithuania's empire stretched to Belarus and the Ukraine. When prince of Lithuania married a Polish princess in 1386, the Lithuanian was made King of Poland on the condition that his country accept Christianity. By the end of the 18th century, Lithuania had been subsumed into Russia. Lithuanians supported the anti-Russian rebellions that arose in 1830 and 1863. The Russians responded by trying to erase the Lithuanian national identity but the people resisted and preserved a strong (if somewhat hidden) identity based on ethnicity, religion, and language. At the dawn of the second World War, the Soviets invaded Lithuania and shortly thereafter a Soviet Socialist Republic was declared.",
        "flag": "https://www.worldometers.info/img/flags/lh-flag.gif"
    },
    {
      "country":"Luxemberg",
        "information": "One of the surviving vestiges of the once mighty Holy Roman Empire, Luxembourg shared a monarchy with the Netherlands after the empire was dissolved in 1806. This arrangement ended with the death of William III in 1890. Adolf of Nassau became the Grand Duke of Luxembourg, while Wilhelmina ascended to the throne of the Netherlands. Luxembourg has enjoyed an excellent, balanced economy since the 19th century based on both industry and agriculture. During the first World War, the country fell to Germany. The Nazis came in 1940, but Archduchess Charlotte escaped to London, returning with the liberating Allied troops in 1944. There has been complete political stability since then. Luxembourg was a founding member of the EEC. Its enormous and highly developed banking industry is the foundation of the country's economy.",
        "flag": "https://www.worldometers.info/img/flags/lu-flag.gif"
    },
    {
      "country":"Macedonia",
        "information": "The literal center of the Balkans, Macedonia is composed of a complex ethnic mix. The region of Macedonia was a Roman province in 146 BC and was part of the Byzantine realm although its population was shifting in response to invasion by Slavic peoples. The current population is unrelated to the Macedonians of ancient times (Alexander the Great or his father, Philip of Macedonia, for example). In 1371, Macedonia fell to the Ottomans, although the Bulgarians, Serbians, and Byzantines all sought to control the region. For the next hundreds of years, the people of Macedonia spoke Greek but thought of themselves as 'Slavs'. After World War I, Macedonia was partitioned among Greek, Bulgaria, and Yugoslavia. In fact, it was because Bulgaria coveted Macedonia that it allied with Nazi Germany and occupied the region in 1941. However, it was Tito who prevailed and in 1946, the Macedonian People's Republic was formed as part of the reconfigured Yugoslavia. With Tito's death decades later came uncertainty but by the early 1990s, the handwriting was on the wall: independence was being sought by various of the republics and Macedonia followed suit in January 1992. ",
        "flag": "https://www.worldometers.info/img/flags/mk-flag.gif"
    },
    {
      "country":"Madagascar",
        "information": "This large island off the coast of Africa was first settled about 2 millennia ago by a Malay-Indonesian people. Eventually other groups arrived including Africans and Arabs but the population has remained essentially Asian in both ethnicity and culture. In the 16th century, Portugal made an attempt to colonize the island but it was not a success. The British and French eventually did establish significant commercial interests on the island in the form of coffee plantations and the French named it a protectorate in 1885 and a full-fledged colony in 1896. In 1960 the Malagasy Republic was declared and twelve years later the government was brought down by a coup that placed a decidedly anti-Western and particularly anti-French government in its place. In 1992, a new constitution was adopted and the next year's election led to the ouster of Didier Ratsiraka, who had been in power for 17 years. Ratsiraka was returned to power in 1997 when the 1993 election results were overturned.",
        "flag": "https://www.worldometers.info/img/flags/ma-flag.gif"
    },
    {
      "country":"Malawi",
        "information": "Settled in the 1200s by a tribe whose descendants remain important in the country, and by the Ngoni some 600 years later, the area that would become Malawi was made a British-controlled protectorate in 1891. The Nyasaland protectorate federated with both the Rhodesias (later Zambia and Zimbabwe) in 1953 with the intention of seeking independence. Self government was granted in 1962 and Malawi Congress party leader Dr. H. Kamuzu Banda became prime minister in 1963. The next year, full independence was achieved. Banda soon mandated single-party politics and in 1971, made himself president for life. In the ensuing repression, corruption ran rife and the population grew poorer and poorer. In 1992, violence by workers resulted in the deaths of dozens of people. The next year, Malawi's citizens voted decisively to restore a multiparty political structure and proceeded to vote Banda out.",
        "flag": "https://www.worldometers.info/img/flags/mi-flag.gif"
    },
    {
      "country":"Malaysia",
        "information": "The Malay peninsula has been a commercial center since antiquity. Originally Hindu, with an Indian flavor, the region turned to Islam in the 1400s. Europeans arrived, first the Portuguese and then the Dutch (1641). Britain made its move in 1789 and eventually the Malay states became British protectorates. The British expanded mining (tin) and agriculture (rubber plantations). Because large numbers of Chinese were brought in as laborers, the balance tilted until the economy was dominated by ethnic Chinese. At the same time, Britain was also solidifying it hold on Borneo. In World War II, Japan overran Malaya and, after the war, a federation was set up to eliminate much of the confusion that exited between the Malay states. t this early 1950s period, the communist party mounted a rebellion that bedeviled the country. A home-rule government was granted in 1955 and independence in 1957 as the Federation of Malaya.",
        "flag": "https://www.worldometers.info/img/flags/my-flag.gif"
    },
    {
      "country":"Maldives",
        "information": "This island nation in the Indian Ocean is an Islamic republic today. But in 1887, it was a British protectorate. Independence was not achieved until 1965. Since independence, tourism has become a mainstay of the economy and there has been widespread uneasiness about the degree of development being pursued in Male island, to the detriment, some feel, of the other islands.",
        "flag": "https://www.worldometers.info/img/flags/mv-flag.gif"
    },
    {
      "country":"Mali",
        "information": "Mali's centrality in African history goes back thousands of years. Many civilizations flourished including mighty kingdoms built on the richness of gold. For centuries, the wealth and power of Mali was known to Africa and as far away as Europe but its importance dimmed by about 1400 with the rise of the Songhai empire centered in Gao and Timbuktu. The Moroccans destroyed Timbuktu in 1591 which precipitated the collapse of the Songhai empire and its subsequent fragmentation. France took over the region in 1896, but it was not until 1946 that the people of Mali were offered French citizenship and a measure of self-rule. In 1960, Mali became an independent republic nd eight years later, the government was ousted by a group of military officers. The military ruled until 1991 when another coup ushered in a civilian government. Though for the most part peace has prevailed, concerns about the possibility of renewed political instability have continued.",
        "flag": "https://www.worldometers.info/img/flags/ml-flag.gif"
    },
    {
      "country":"Malta",
        "information": "This Mediterranean archipelago has known many rulers, from Phoenicians, Greeks, Romans, and Byzantines to Islamic Saracens and Norman kings of Sicily. Malta came to prominence during the Crusades as Christian troops passed through on their way to the Holy Land. The Ottomans failed to conquer Malta in 1565 but Napoleon succeeded in 1798. By 1800, Malta was under British control with formal annexation following in 1814. During the second World War, German and Italian air raids created great destruction to Malta. A grateful Britain awarded the entire population of Malta the George Cross for bravery after the war. While the constitutions of 1921 and 1939 provided for limited self-rule, it was not until 1964 that Malta gained its independence within the British Commonwealth and with Elizabeth II as its monarch. In 1971, Malta became fully independent, eliminating all ties to the British crown.",
        "flag": "https://www.worldometers.info/img/flags/mt-flag.gif"
    },
    {
      "country":"Mauritania",
        "information": "This African country can be divided along population lines between north and south: the north is Arab and Berber and the south are black African peoples. Over a period of 600 years, the southern part of Mauritania belonged to the kingdoms of Ghana, then Mali, and finally Sanghay. In the early 1400s the Portuguese arrived to trade. Their dominance in the area was unchallenged for the next one hundred years when the British, French, and Dutch each contested Portuguese control. The French made the region a protectorate in 1903 and a colony in 1920, granting self-government in 1958. Independence followed in 1960. In 1978, the government was overturned in a military coup but in 1984, this government was also ousted in a military coup led by the Chief of Staff. In 1985 and 1986, elections were held on the local and regional level. By 1991, a new constitution had been approved and multiparty elections held. Elections were also held in 1992 and 1997. Border clashes with Senegal as well as racial and religious conflicts have made it a difficult challenge to grow the economy.",
        "flag": "https://www.worldometers.info/img/flags/mr-flag.gif"
    },
    {
      "country":"Mauritius",
        "information": "East of Madagascar lie the islands of Mauritius. The Dutch discovered the uninhabited islands in 1507 but never established settlements to any great extent. The French arrived in 1721, establishing plantations with slave labor from Africa. The British captured Mauritius in 1810. When the empire abolished slavery in 1834, laborers from india were brought in to work the sugar cane plantations. As a result, most of the population of Mauritius today is of Indian background. In 1968, the country became a parliamentary democracy within the British Commonwealth. Nearly a quarter of a century later, it became a republic; Caseem Uteem was elected as the first prime minster. The country has developed a strong economy, based on sugar, textiles and tourism.",
        "flag": "https://www.worldometers.info/img/flags/mp-flag.gif"
    },
    {
      "country":"Mexico",
        "information": "Mexico's history extends back to the Mayas, the Toltecs, and the Aztecs, among others. When Spain entered Tenochtitlan in 1519, the days of the Aztecs were numbered. Spain captured the city (now the site of Mexico City itself) and, at its largest, the Spanish empire eventually came to include the land extending from California to Panama, and from the Caribbean to the Philippines. But as Spain weakened in the beginning of the 19th century, the desire for independence on the part of its colonists was heating up. Throughout the 19th and till the mid-20th centuries, dictators vied with reformers, puppets, or heroes for power. A colorful collection of politicians and statesmen have held power in Mexico and while the country has made huge strides economically and politically in the last half-century, it remains a country beset with problems including corruption, a damaged environment, an intermittent brain drain, and occasional guerilla activity on behalf of the Indian populations.",
        "flag": "https://www.worldometers.info/img/flags/mx-flag.gif"
    },
    {
      "country":"Micronesia",
        "information": "Across a distance of nearly 2,000 miles, the archipelago of Micronesia encompasses a land area of only 271 square miles. It is believed that the original inhabitants of Micronesia came from the Philippines and Indonesia about 1500 years before Christ. In 1521, Magellan made landfall in the Marianas and in 1565, Spain laid claim to the islands. In 1899, the Caroline Islands were sold to Germany and after World War I, the League of Nations gave Japan a mandate over the islands. Japan successfully developed the mining industry, and the fishing and agricultural (particularly sugarcane) domains. Part of the UN Trust Territory following World War II, Micronesia became independent of US administration in 1986.",
        "flag": "https://www.worldometers.info/img/flags/fm-flag.gif"
    },
    {
      "country":"Moldova",
        "information": "Moldova was independent until it becake part of the Ottoman Empire in the 16th Century. In 1791 Russia aquired Moldova. In 1924 moldova was established as in independent republic of the USSR. In 1991 Moldova declared its independence.",
        "flag": "https://www.worldometers.info/img/flags/md-flag.gif"
    },
    {
      "country":"Mongolia",
        "information": "Famed for its conquering hordes under Genghis Khan in the early 1200s, Mongolia came to dominate a good portion of the known world, though its heydey lasted for only about two centuries. After the Mongol empire broke up, China came to dominant both Inner and Outer Mongolia. Outer Mongolia tried to assert is independence from China in 1911 (the attempt failed) and in 1924, with Soviet support, a Mongolian People's Republic was formed. Soviet-sponsored purges of Mongolian leaders coupled with poorly considered attempts to institute centralized planning, made for dark early years of the republic. In 1990, the communist government ceded its constitutional power (although they were returned to power in 1992, running on a reform platform). In 1993, a coalition of opposing parties beat the communists once more. Mongolia faces enormous problems as it makes the progression to democracy and a free market economy but its youthful and growing population and financial support from countries such as the US will doubtless help.",
        "flag": "https://www.worldometers.info/img/flags/mg-flag.gif"
    },
    {
      "country":"Morocco",
        "information": "The region that would become Morocco has been inhabited since the Neolithic era. Berbers arrived about a thousand years before Christ with Phoenician and Carthaginian settlements following on the coast. The Romans, the Vandals, and Islam all invaded Morocco. The tensions between Berbers and Arabs has existed ever since. In the 700s, King Idris ibn Abdullah brought Berbers and Arabs together under a single monarchy that was sustained over two centuries. The capital, Fez, became a major Islamic center of religion and culture. When Spain expelled the last Moors from Spain in 1492, it was the end of golden era. Morocco, Spain, and Portugal vied with each other for next centuries for hegemony over the Western Mediterranean. In the early 1800s, Moroccan piracy in the Mediterranean was a huge problem for Britain and the US. Spain set up colonies in Tangier, and along the Morocco-Mauritania coast. In the early 20th century, France -- already secure in Algeria -- cast its eye on Morocco. Europe was not interested in Morocco's maneuverings to protect its independence. Moroccan independence ended in 1912, with the Treat of Fez, by whose terms France was given Morocco and the Spanish got to retain a sphere of influence in the southwest.",
        "flag": "https://www.worldometers.info/img/flags/mo-flag.gif"
    },
    {
      "country":"Mozambique",
        "information": "Inhabited since before recorded history, Mozambique came under the control of Portugal beginning in the 16th century. Gold and ivory formed the basis of trade. Until the late 1800s, settlement by Portuguese, however, was sparse but in 1885 enough immigration had taken place to warrant the region's organization into a formal colony called Portuguese East Africa. Portugal kept Mozambique closely tied to it economically but in the 1950s, Portuguese rule began to be protested by the native peoples. Beginning in 1961 and continuing for more than a decade, the Frelimo (Front for the Liberation of Mozambique) rebellion fought a guerilla war. By 1964, the northern part of the country was almost completely in Frelimo hands. Portugal had its own revolution in 1974 and thereafter agreed to support independence for Mozambique. This led to so many Portuguese leaving Mozambique, that much of the country's administrative infrastructure was effectively wrecked. In June 1975, independence was granted and a Marxist Frelimo government was installed.",
        "flag": "https://www.worldometers.info/img/flags/mz-flag.gif"
    },
    {
      "country":"Namibia",
        "information": "Though various tribes have always lived in the region of Zambia in southwest Africa, it was not until 1872 that Britain took the area surrounding Walvis Bay, annexing it to the Cape Colony 12 years later. The Germans, too wanted a piece of the action and took over much of south-west Africa for itself. The two powers agreed to recognize each others' claims but, Britain occupied the region during World War I, and in 1920 South Africa was given a mandate over the area by the League of Nations. When the United Nations came into being, it tried to have South Africa continue its administration under a UN trusteeship -- instead, South Africa annexed South-west Africa. Guerrilla forces began to attack South African troops in 1966. SWAPO (the South-West Africa's People's Organizations) operated from bases in Zambia and Namibia. By 1971, the International Court of Justice ruled that South Africa's continued 'occupation' of the region was illegal. The UN rejected South Africa's plan for a Namibian independence based on apartheid principles.",
        "flag": "https://www.worldometers.info/img/flags/wa-flag.gif"
    },
    {
      "country":"Nepal",
        "information": "Modern Nepal was created in the latter half of the 18th century when Prithvi Narayan Shah, the ruler of the small principality of Gorkha, formed a unified country from a number of independent hill states. The country was frequently called the Gorkha Kingdom, the source of the term ''Gurkha'' used for Nepali soldiers. After 1800, the heirs of Prithvi Narayan Shah proved unable to maintain firm political control over Nepal. A period of internal turmoil followed, heightened by Nepal's defeat in a war with the British from 1814 to 1816. Stability was restored after 1846 when the Rana family gained power, entrenched itself through hereditary prime ministers, and reduced the monarch to a figurehead. The Rana regime, a tightly centralized autocracy, pursued a policy of isolating Nepal from external influences. This policy helped Nepal maintain its national independence during the colonial era, but it also impeded the country's economic development.",
        "flag": "https://www.worldometers.info/img/flags/np-flag.gif"
    },
    {
      "country":"Netherlands",
        "information": "Once part of the Holy Roman Empire, the country['s name actually describes it geography -- it is a low-lying region ever at the mercy of the sea. The Netherlands has been independent since the end of the Thirty Years War in 1648. A prosperous land, with an economy based on trade and seafaring, the Netherlands grew to empire status through its acquisition of Indonesia, Ceylon, South Africa, Surinam, portions of the West indies, and New Amsterdam. Added to this, it even came to monopolize the West's trade with Japan after 1637. The country was held in high esteem in Europe such that its influence far exceeded the importance that might be expected from its size. Germany's invasion of the country beginning in 1940 resulted in the Royal Family fleeing to safety in England for the duration of the War. The occupation caused severe damage to the country and the post-war period was difficult. The Netherlands lost Indonesia and had to work at reorganizing the country's economy. It participated in the ''economic miracle'' that transformed Europe's economic structure. Stable and successful, the netherlands continues to play a key role in European affairs.",
        "flag": "https://www.worldometers.info/img/flags/nl-flag.gif"
    },
    {
      "country":"New Zealand",
        "information": "At least 1,200 years ago, argonauts from Polynesia came to New Zealand. These Maori peoples are the country's indigenous population. Europeans first saw New Zealand in 1642 when the Dutch explorer Abel Tasman named it -- although he did not claim the land for his country. The British, however, did in 1769. In 1841, it was made a full colony of Britain. Though promises were made to the Maoris that they would retain possession of their lands, they were instead displaced by British newcomers and their growing settlements. The Maori population dwindled to such an alarming extent that by the 1890s, there were reportedly less than 50,000 of them left in the country. Recently, attempts have been made to redress the wrongs of the past and payments have been negotiated for lands taken without compensation. New Zealand enacted universal suffrage in 1893; shortly thereafter, fair labor practices were guaranteed by law along with pensions, medical care, and other social services that stand as proof of the country's enlightened status for the time. In 1907, the country became an independent member of the British Commonwealth.",
        "flag": "https://www.worldometers.info/img/flags/nz-flag.gif"
    },
    {
      "country":"Nicaragua",
        "information": "In 1821 Nicaragua achieved independence from Spain, becoming part of the United Provinces of Central America two years later. When the Federation was dissolved in 1838, Nicaragua became an independent republic. In 1909, the US sent marines to the region to support the Conservatives because Liberal leader Jose Santos Zelaya had announced his intention to pursue a canal project (the US interest was in Panama, where the canal opened in 1914). US occupation (1909-25 and 1926-33) sparked guerrilla warfare led by a Liberal officer named Sandino. In 1937, the head of the Nicaragua National Guard, named Anastasio Somoza Garcia, had Sandino assassinated and took over the Presidency himself. The Somozas controlled Nicaragua for another 42 years. The dictatorship fell in 1979 to the Sandinista National Liberation Front. For nearly a decade, the US supported the Contra forces who fought the Sandinistas in a destructive civil war. In 1990 the country held elections and the years since have been relatively peaceful.",
        "flag": "https://www.worldometers.info/img/flags/nu-flag.gif"
    },
    {
      "country":"Niger",
        "information": "Niger is a land-locked country in western Africa, covered with desert, except for a band of territory running south of the Niger River. In past centuries, Niger's territory has come under the control of successive empires originating in Mali, Chad, and Nigeria. In the 1800s, Britain and Germany came into the picture as their explorers searched for the source of the Niger River. It was the French, however, who prevailed in Niger which became a French colony in 1922, governed from Senegal. Along with other African French colonial peoples, those of Niger gained French citizenship in 1946 and some measure of self-rule followed. By 1958, Niger had become an autonomous state in the French Overseas Community. Independence was achieved in 1960. Niger's first president was overthrown by a military coup in 1974. It took 15 years for the country to start moving towards democracy. A new constitution was adopted in 1992. President Mahame Ousmane and his prime minister were ousted, again in a military coup, in 1996. Ousmane's successor was assassinated in 1999. A military junta was put in place and has promised both constitutional reform and elections.",
        "flag": "https://www.worldometers.info/img/flags/ng-flag.gif"
    },
    {
      "country":"Nigeria",
        "information": "Five hundred years before Christ, there arose in central Nigeria a culture that was among the most advanced and richest of the ancient world. By the first millennium, Islam had come to Nigeria and three centuries later, trade routes emanating from northern Nigeria stretched from Africa to Europe and the Middle East. Portugal was the first European power to establish trading stations in the 1400s. The Dutch, British, and other countries vied with Portugal to control the lucrative slave trade that was organized out of Nigeria and by the 1700s, the British controlled most of the coastal region. The tide changed after Britain abolished slavery and sought to eliminate slave trading. In 1861, Nigeria was made a British colony and in 1906, land east of the Niger River was incorporated into the colony. Slowly, Britain began to prepare the country for self-rule: in 1946 Britain divided Nigeria into three parts, each with an advisory assembly. Nigeria was restructured as the Nigerian Federation in 1954. The country experienced difficulties in the 1960s as the various ethnic groups making up the country battled for control. In 1966, a civil war erupted following a coup in which the prime minster and many others were killed. Between 1967 and 1970, the war in Biafra raged. Biafra was the region that seceded from Nigeria after rejecting a plan that divided the country into 12 states. This devastating conflict cost the lives of at least a million Biafrans (mostly of the Ibo tribe) and severely damaged the Nigerian economy. But through the years, political instability, as manifested by coup after coup, has been a constant in the country. In 1999, the first popularly-elected president in 16 years came into office.",
        "flag": "https://www.worldometers.info/img/flags/ni-flag.gif"
    },
    {
      "country":"Norway",
        "information": "Norway traces its proud history to the Vikings, whose legendary seafaring skills took them to almost every place reachable by water. Before the year 1000, the norse had traveled on sea voyages as far as Greenland, which was colonized then. Christianity came relatively late (the beginning of the 11th century) and soon, Norway had achieved the apex of its power. In 1397, all the Scandinavian kingdoms were united under Danish control. At that point, Norway per se ceased to exist as an independent entity -- Danish rule would continue for another 400 years. During the early 19th century, Norway tried to reestablish its own sovereignty and in 1815, Sweden conceded an independent Norway in union with Sweden. This union scheme was never popular and in 1905 the Norwegian Storting pronounced the union over; the Swedish king was replaced with a prince of Denmark, who ruled Norway for over half a century as Haakon VII. Though Norway had been neutral during World War I, and tried to remain so during the Second World War, Germany invaded in 1940. A government-in-exile was established in London. Resistance to the collaborationist government of Vidkun Quisling was strong and with the Nazi exit in 1945, the King and his government-in-exile were returned victorious. Post war, Norway became an original member of the United Nations. A Norwegian, Trygve Lie, was the first Secretary General of the organization. It became a member of NATO and the European Free Trade Association. Though Norway provided its citizens with a model society in many ways, it also faced the burdensome economic consequences of such a society but has continued to enjoy, for the most part, enviable stability and prosperity.",
        "flag": "https://www.worldometers.info/img/flags/no-flag.gif"
    },
    {
      "country":"Oman",
        "information": "Oman is situated on the Arabian peninsula and has been, since antiquity, a trade center in the Persian Gulf and Indian Ocean. The Portuguese took Oman's principal port, Muscat in 1508 and held it for over 150 years. At that point, the Ottomans arrived for an 82-year long stay. The sultanate of Oman was consolidated under Ahmed ibn Said of Yemen in 1744. The present royal family are his descendants. Oman controlled African Zanzibar, southern coastal Iran, and the area between Pakistan and Iran, in the early 1800s. Nearly all these possessions were lost over the course of the 19th century except for an area ceded to Pakistan in 1958 (there was a monetary settlement). Oman became a British protectorate in 1891. The protectorate came to an end in 1971. Oman's wealth is derived from oil, as the country lacks other natural resources.",
        "flag": "https://www.worldometers.info/img/flags/mu-flag.gif"
    },
    {
      "country":"Pakistan",
        "information": "A region inhabited since ancient times, Pakistan has been an attractive target for invaders since the Aryans (around 1500 BC) to Alexander the Great (more than 1100 years later) to the empire of Asoka (300 BC). Until the land fall to Islamic invaders, it was a Buddhist center, although portions of the country were more closely tied to Persia and Afghanistan, and others to northern India. The Mongols invaded in the 1200s and were then displaced by the Timur Leng at the end of the 1300s. When that empire fell, the country was divided into several kingdoms, but it came together again in 1526 with the rise of the Mogul empire. By the 1800s, British rule had become dominant and after 1857, that country controlled the area, some regions directly and other as protectorates. Though Muslims and Hindus appeared allied against the British, their Non-Cooperation Movement of the 1920s eventually deteriorated into disarray. In 1940, the Muslim League began agitating for an independent Muslim state. At the time India withdrew in 1947, Hindus and Muslims fled in opposite directions, accompanied by violence and the loss of hundreds of thousands of lives. Pakistan was granted status within the Commonwealth in 1947 and independence in 1956. During the 1960s, Pakistan and India clashed at their border and Pakistan faced difficulties as martial law was declared in 1969. Civil war was followed by the secession of the Eastern half of the country; it became the nation of Bangladesh. india also joined the fray (1972) but the two countries ultimately came to terms and diplomatic relations were restored in 1976. The political instability that has characterized the country has persisted to the present, with military coups, executions, and charges of corruption.",
        "flag": "https://www.worldometers.info/img/flags/pk-flag.gif"
    },
    {
      "country":"Panama",
        "information": "Panama was claimed by the Spanish in 1501. Nearly two decades later, the City of Panama was established. A part of New Granada after 1739, Panama (and the rest of New Granada) left the Empire over 80 years later. At that point, Panama became part of Gran Colombia. Panama was viewed as a potential route between the Atlantic and the Pacific as far back as 1825. By 1855, the United States had bankrolled a railroad from Colon to Panama City. In 1903, Panama broke with Colombia and soon agreed to develop a canal zone that would be under US control. Eleven years later, the mighty Panama Canal was opened. Functioning as a protectorate of the US (i.e., the US guaranteed the 'independence' of the country), the US maintained that it had the right to intervene militarily when its interests were threatened, as it did in 1918. In 1936, the protectorate status was abolished and the US agreed that it would not have the right to intervene in the cities of Panama and Colon. A new canal treaty was negotiated in 1977; it provided for the Panamanians to take control of the canal in 2000. Politically, Panama experienced some instability when the country's military head (and, basically, the leader of the country) General Manuel Noriega, was indicted by the US on drug charges. Noreiga refused to resign and the US ended up freezing Panamanian assets in US banks. A year later, Noreiga nullified the results of the election (he was losing) and made himself the sole power in the country. The US responded by invading the country, capturing Noreiga, trying him in the US and convicting him.",
        "flag": "https://www.worldometers.info/img/flags/pm-flag.gif"
    },
    {
      "country":"Papua New Guinea",
        "information": "New Guinea is the second-largest island in the world. Its indigenous population is made up of Papuan and Melanesian peoples who developed an astonishing array of languages and tribes, generally hostile to one another. The Dutch, British, and Germans divided the island in the 1800s. Germany lost its portion as a consequence of World War I after Australia occupied it in 1914. Following the war, the League of Nations gave Australia a mandate to administer the region. Several occupation attempts were made by Japan in 1942 were of only limited success and Japan was completely ousted by the Allies in 1944. The nascent United Nations turned the once-British and German colonies into mandated territory under Australian administration in 1949. Self-governing since 1973, and fully-independent since 1975, Papua New Guinea remains closely tied to Australia but its own government has had to face some rough patches since independence, including (since 1989) a rebellion on the island of Bougainville.",
        "flag": "https://www.worldometers.info/img/flags/pp-flag.gif"
    },
    {
      "country":"Paraguay",
        "information": "The region that would become Paraguay was inhabited by a number of indigenous peoples prior to the arrival of the Europeans in the early 1500s. Thanks to the Jesuits' work, a network of missions were established in the south. The city of Asuncion, later to become capital city, was populated by the country's so-called elite and a struggle would emerge between the Jesuits and these Asuncionis over how the colony would develop. Independence was declared in 1813 two years after the Asuncion elite overthrew the Spanish. As a consequence of the War of the Triple Alliance (1865-1870) Paraguay was devastated: the population decimated (nearly all adult males died), tens of thousands of square miles of territory lost, and a huge debt accrued. Authoritarian rule was a constant in Paraguay from the 19th century through the 20th. One of the most notorious leaders was General Alfredo Stroessner, who ruled from 1954 till 1989. In March 1999, the country was again in turmoil as the vice president was assassinated, the president impeached on charges of complicity (he fled to Brazil), and a new president installed.",
        "flag": "https://www.worldometers.info/img/flags/pa-flag.gif"
    },
    {
      "country":"Peru",
        "information": "The brilliant civilization of the Incas originated in Peru. Their empire dominated the Andes by the end of the 1400s. Pizarro's arrival on behalf of Spain in 1532 hastened the end of the Incas, although their subjugation would not be complete until nearly 40 years later. The rich natural resources of Peru, specifically gold and other metals, made it especially attractive to the Spanish and for the next 200 years, Lima was the center of the region's wealth and power. In 1821, Simon Bolivar and Jose de San Martin defeated the royalist forces and Peru was independent, though in the next four decades, power changed hands 35 times and the country went through more than 15 constitutions. For over fifty years (from the 1930s till the 1980s) there was great hostility between the armed forces and the supporters of Peru's most important political party, the so-called Apristas. Consequently, APRA was prevented from taking power until 1985. Peru's problems exacerbated in the 1980s with the rise of the Maoist 'Shining Path' guerrillas, continuing into the '90s.",
        "flag": "https://www.worldometers.info/img/flags/pe-flag.gif"
    },
    {
      "country":"Philippines",
        "information": "The Philippines indigenous peoples originated in Southeast Asia, probably from the Malay peninsula. A variety of political structures existed, from tribal societies to small monarchies ruled by princes. Early on, commercial links were established between the Philippines and places such as China and the East Indies. The first known European to arrive were led by the explorer Magellan in 1521 (he was actually killed there). Four decades later, the Spanish began their conquest of the region. Manila dates back to 1571 and the city quickly became an important stop for trade between the Orient and Mexico. Though the Philippines had long been Muslim, the Spanish managed to convert nearly the entire population to Christianity (except for some of the southwestern area, where Islam continued to thrive). Though the Spanish empire viewed the Philippines as important, their rule was semi-eclipsed by the Catholic Church which became both wealthy and powerful in the Philippines. Eventually, the islands passed from Spanish rule to US control (after the Spanish American War in 1898) and after the US suppressed the Philippines initial bid for independence in a bloody six-year conflict, independence was finally granted in 1946. Politically, the Philippines has faced some rocky times in the second half of the 20th century. Ferdinand Marcos became president in 1966 and proceeded to concentrate extraordinary power in that office (he also extended it to his wife, Imelda). Corruption, poverty, and general unrest worsened until Marcos was forced to flee the country in 1986. Mrs. Corazon Aquino, widow of marcos opposition leader Benito, was declared president. Her decision not to run for reelection in 1992 resulted in an election victory for Fidel Ramos.",
        "flag": "https://www.worldometers.info/img/flags/rp-flag.gif"
    },
    {
      "country":"Poland",
        "information": "A proud country with a history that dates back at least 1,100 years, Poland has outlived many of the powers that sought to absorb it. The Holy Roman Empire, Sweden, Prussia, Russia, and Austria all tried to expand at the expense of Poland. Though partitioning all but erased Poland from the map of Europe in the late 18th century, Napoleon created the Grand Duchy of Warsaw and later, the Congress of Vienna restored a Kingdom of Poland in 1815, with the Russian czar as monarch. From 1830 on, Poland became more and more Russified. This came to a halt with the rise of Josef Pilsudski's socialists who fought against the Russian Bolsheviks after World War I. By the terms of the Treaty of Riga in 1921, Poland was returned to borders approximating those of 1793 with a population about 70% ethnically Polish. There was also in Poland the largest population of Jews in Europe, at this point. In 1939, Germany attacked Poland along with the Soviet Union. Divided between the two then-allies, Poland suffered great losses during the war,including the destruction of nearly its entire population of 3,000,000 Jews to the Nazi concentration camps erected all over Poland. A Polish government-in-exile was established in London but its effectiveness was limited. The Soviets took control of Poland as the war drew to a close, and recognizing a provisional government based in Lublin. The Allies met in Yalta in 1945 and there were convinced by the USSR to allow the eastern part of Poland to be absorbed into the Soviet Union and that some of eastern germany should be incorporated into Poland, giving Poland roughly the borders of its 10th century incarnation.",
        "flag": "https://www.worldometers.info/img/flags/pl-flag.gif"
    },
    {
      "country":"Portugal",
        "information": "Portugal's independence dates back to the 12th century, although its tribal roots extend back beyond Roman times. The borders of Portugal as they are today were already in place by 1267. The Spanish monarchy managed to retain its independence into the 20th century (except for a 60-year period when the country was ruled by the Spanish Habsburgs. A nation with a deep connection to the sea, Portugal attained an empire for itself thanks to the exploits of its explorers. Regions under the control of Portugal included the Azores, the west African coast, parts of southern Asia, Brazil. What checked the Portuguese empire was the rise of two other great powers: the Netherlands and Spain. In 1910, the Kingdom of Portugal took the then-unusual step of becoming a republic. But changing the political status of the country has some devastating consequences: a succession of 8 presidents, 44 governments, and a reeling economy. The military responded with a takeover and the ensuing dictatorship endured for decades. Antonio Salazar, the civilian dictator chosen by the military, ruled Portugal with little leniency but with enough skill to keep his country out of World War II as a neutral country, although he supported Britain.",
        "flag": "https://www.worldometers.info/img/flags/po-flag.gif"
    },
    {
      "country":"Qatar",
        "information": "Originally ruled as part of Bahrain, Qatar became an informal British protectorate in 1868. From 1872 until 1916, however, the sheikhs of Qatar were largely controlled by the Ottoman Empire and it was not until 1916 that Qatar was declared a formal British protectorate. The British withdrew from the area in 1971 and Qatar made some attempts to join the United Arab Emirates. This came to naught and the country decided on independence as of September 3, 1971. The healthy economy of Qatar rests on oil reserves, vast supplies of natural gas, the supply of shipping services, and banking.",
        "flag": "https://www.worldometers.info/img/flags/qa-flag.gif"
    },
    {
      "country":"Romania",
        "information": "An ancient province of Rome (hence its name), the region of Romania was conquered by a succession of invaders: Bulgars, Mongols, and Ottomans. Long one of Europe's poorest and least developed countries, it was only in 1878 that independence was achieved. The 20th century was marked by turmoil including the Balkan Wars and the pro-Hitler government during World War II. After the Soviets 'liberated' Romania in 1944, the country became what has been termed a virtual colony of the USSR. In fact, the Soviet army did not leave the country until 14 years later. In 1965, Nicolae Ceausescu assumed power, pursuing repressive policies and poorly-developed economic strategies that left Romania in terrible straits. In 1989, Romania plunged in the throes of violent change from communism to a nascent democracy and the years since have been witness to continued instability, both economic and, sometimes, political.",
        "flag": "https://www.worldometers.info/img/flags/ro-flag.gif"
    },
    {
      "country":"Russia",
        "information": "Russia's history extends back over 1,000 years with the establishment by Vikings of a territory they named Rus. The Viking presence diminished through gradual absorption by the native Slavic peoples and by 988, the prince of Kiev had converted to eastern Orthodox Christianity (based in Constantinople). Several hundred years later, the Mongols swept over Russia, remaining through the 14th century. A new ruler named Ivan the Great, brought Moscow to the fore and developed an empire based on his marriage to a Byzantine princess. It was Ivan's grandson, Ivan IV (the Terrible) who took the title Tzar (from the Latin Caesar) and expanded Moscow's realm. The expansion only continued over the next several hundred years and by the end of the 17th century, Peter the Great had made great strides towards transforming Russia into a true power. He devised a new capital called St. Petersburg, which became a glittering European center. But it was Catherine the Great, at the beginning of the 18th century, who entered into treaties and alliance with Prussia and Austria that solidified Russia's position as a true power in Europe. Alexander I, part of the group that successfully defeated Napoleon, held the title not only of Tzar, but grand duke of Finland and king of Poland. The 19th century saw Russia begin to industrialize with development extending to the far reaches of the tzar's realm. In 1917, the tzarist regime fell to revolution led by socialists who intended to create a republican government. This first revolution failed and was supplanted by Bolshevik forces later that year, with Vladimir Lenin as chairman.",
        "flag": "https://www.worldometers.info/img/flags/rs-flag.gif"
    },
    {
      "country":"Rwanda",
        "information": "Though its indigenous population is ancient, Europeans first came to the area in the 19th century; it was made a German protectorate in 1899 and turned over to Belgian control by the League of Nations after World War I. After the Second World War, Rwanda was made a UN trusteeship. Independence was declared in July 1962, after several years of turmoil between the Tutsi and the Hutu tribes. In an exodus of mind-boggling proportions at least a million Rwandans were displaced by civil war that raged in the 1990s. Untold numbers of citizens were killed as the violence continued. It was not until 1999, that things seemed to be calming down, but renewed violence has continued to occur.",
        "flag": "https://www.worldometers.info/img/flags/rw-flag.gif"
    },
    {
      "country":"Samoa",
        "information": "Samoa, once known as the Navigator's Islands, was originally partitioned between the US and Germany. During World War I, New Zealand forces took the German islands, later administering so-called Western Samoa under a mandate declared by the League of Nations. Western Samoa achieved independence in 1962, forming a constitution-based blend of parliamentary government and traditional Samoan rule. Samoa's economy is largely dependent on tourism, forestry, fishing, and subsistence agriculture.",
        "flag": "https://www.worldometers.info/img/flags/ws-flag.gif"
    },
    {
      "country":"Saudi Arabia",
        "information": "The Arabian peninsula is best known for being the birthplace of Islam in the 7th century. By the time of Mohammed's death in 632, all of Arabia was Islamic. In the early 16th century the Ottoman Empire tried to take Arabia but were never truly successful in establishing complete dominance. The house of Saud took control at Riyadh in 1902 and a decade later led a revolt against the Ottomans, assisted by the British. Eventually, the Sauds took over the entire peninsula and the country was named Saudi Arabia in 1932. As an absolute monarchy the House of Saud has been in control ever since, with only occasional blips of instability over the years, including the assassination of King Faisal by a nephew in 1975. Saudi Arabia, conservative and always worried about left-leaning opponents and neighbors has been viewed as a friend of the West for decades, a friendship which was protected during the Gulf War in 1991.",
        "flag": "https://www.worldometers.info/img/flags/sa-flag.gif"
    },
    {
      "country":"Senegal",
        "information": "Though ancient historically, Senegal came to European attention in the 15th century. Portugal was the first country to try to exert its hegemony over the area, but soon found itself in competition with the British, Dutch, and French. French control was virtually unchallenged after 1659. Senegal became a French colony in the 20th century. It was not until 1946 that a territorial assembly was set up with powers that gradually were extended over the next years. Independence was achieved in 1960 after Senegal seceded from the newly created Federation of Mali. Leopold Sedar Senghor became the president. He retired from office over two decades later and his successor, Adbou Diouf, has been in office ever since -- in fact, in 1998 Parliament passed a law permitting him to be president for life! Although there have been some problems with the northern region of the country (where a separatist movement exists), Senegal has enjoyed a largely stable and relatively prosperous commercial life.",
        "flag": "https://www.worldometers.info/img/flags/sg-flag.gif"
    },
    {
      "country":"Serbia",
        "information": "Serbia (Yugoslavia) can be viewed as a collection of disparate ethnic groups who are largely hostile to one another, following a long history of conflict. Though Serbia had been independent at various points in time, the Ottoman conquest in 1389 kept Serbia submissive until 1878, when it reestablished its independence. The Balkans engaged in a series of wars, the last of which led directly to the outbreak of World War I. After the war, Yugoslavia was cobbled together from many small nations and peoples: Serbs, Slovenes, Croats, Bulgarians, Albanians, Macedonians, and more. The uneasy alliance shredded with the coming of the Nazis in World War II as some looked to Germany as liberators and others assumed an anti-German posture. The anti-forces were led by Josip Broz Tito. Though he was victorious, the war had cost millions their lives and left the country in shambles. The federal People's Republic of Yugoslavia endured while Tito lived, thanks to his iron control of the country, and for a short time after. His death in 1980 was not followed by immediate trouble -- it took the fall of communism in 1989 to destabilize the country. At that point, only Serbia and Montenegro voted for Communist rule, while Croatia, Slovenia, Macedonia, and Bosnia-Herzegovina chose the route to independence. The violent civil war that ensued shocked the world and required the efforts of the United Nations and NATO to bring to a still-uncertain conclusion.",
        "flag": "https://www.worldometers.info/img/flags/ri-flag.gif"
    },
    {
      "country":"Seychelles",
        "information": "After being wrested from the French, these widely scattered islands in the Indian Ocean existed under British control from 1794 to 1976, when independence was declared. Although the political equilibrium was initially somewhat challenged with a coup shortly after independence, the Seychelles have been reasonably stable for decades. Tourism has become the economic bulwark of the country.",
        "flag": "https://www.worldometers.info/img/flags/se-flag.gif"
    },
    {
      "country":"Sierra Leone",
        "information": "Another African country dominated initially by the Portuguese, Sierra Leone became a British colony in 1808. The diverse population has been a hallmark of Sierra Leone, comprised of native peoples and the descendants of ex-slaves. Since independence was attained in 1961, the country has withstood great difficulties, including a civil war raging on-and-off for the better part of the 1990s and a situation which has still not been fully resolved.",
        "flag": "https://www.worldometers.info/img/flags/sl-flag.gif"
    },
    {
      "country":"Singapore",
        "information": "Singapore is said to have derived its name from the word 'singapura' which by translation means 'Lion City'. This name was allegedly coined by a prince from Sumatra who upon landing on the island, saw a lion and took it as a good omen. Singapore was a colony state ruled by the British. The British rule of the island lasted for 144 years. This rule was however brought to an end when the crown colony was dissolved in 16 September 1963 when Singapore became part of Malaysia. Malaysia comprised of the Federation of Malaya, Singapore, Sarawak and North Borneo now known as Sabah. However, Singapore's merger proved unsuccessful. Communal tensions that resulted in racial riots in July and September 1964 were as a result of deep political and economic differences between the ruling parties of Singapore and Malaysia. Singapore separated from Malaysia to become an independent and sovereign state in 9 August 1965.",
        "flag": "https://www.worldometers.info/img/flags/sn-flag.gif"
    },
    {
      "country":"Slovenia",
        "information": "It would be correct to say that for at least 1000 years, Slovene history was essentially Austrian history. It Catholicism was Roman (not Eastern) and priests played an important political role in this country without an established aristocracy or merchant class. During the period of the Austro-Hungarian empire, Slovenia was part of the Austrian side of the dual monarchy and when it collapsed as a consequence of World War I, Slovenia, together with Serbs and Croats, came together as ''The National Council'' out of which Yugoslavia would later be born. Within Yugoslavia, Slovenia held something of an anomalous position since its language was different and the population was, on the whole, better educated and more advanced industrially than other parts of the country. After the brief break-up of Yugoslavia perpetrated by the Nazis, Tito reconstituted the country with Slovenia as a constituent `republic.' In 1990, a decade after Tito's death, Communism fell and Slovenia wasted little time in proclaiming its first true independence in 1991. With strong economic links to Austria, Italy, and Hungary, Slovenia has remained prosperous and secure, with little involvement in the troubles to the south.",
        "flag": "https://www.worldometers.info/img/flags/si-flag.gif"
    },
    {
      "country":"Slovokia",
        "information": "Through a long history linked to the Czechs, Slovakia spent a millennium under Hungarian domination. In the 20th century, Slovakia became part of a newly-created Czechoslovakia prior to World War II. A brief 'independent' moment existed as the Nazis permitted 'Slovakia' to exist from early 1940. The country, led by Magr Tiso, allowed the expulsion and destruction of more than 60,000 Jews during World War II. In 1948, Czechoslovakia came under Communist domination, which would persist until the final break between the Czechs and the Slovaks in the early 1990s.",
        "flag": "https://www.worldometers.info/img/flags/lo-flag.gif"
    },
    {
      "country":"Solomon Islands",
        "information": "The Solomon Islands became a British protectorate towards the end of the 19th century. During World War II, the Japanese occupied the Solomons, which were recaptured by the Allies only after fierce and deadly battles. Independence was declared in 1978 and the country has managed to do well economically as an exporter of copra, cocoa, palm oil, and lumber and particularly since it sold tuna fishing rights in its waters.",
        "flag": "https://www.worldometers.info/img/flags/bp-flag.gif"
    },
    {
      "country":"Somalia",
        "information": "The Arabs came to Somalia some fourteen centuries ago. Over 800 years later, the Portuguese arrived, building forts and creating settlements. The northern part of the country came under British control in the early 19th century, while Italy dominated the south by the early 20th century. The Italian Fascist army drove Britain from the country early in World War II but the British returned, counterattacking and eventually controlling the entire country by 1941. The two parts of what was known as Somaliland -- protectorate British Somaliland and the former Italian Somaliland -- became Somalia in 1960. There has been little political stability for the country with border conflicts erupting between Somalia and Ethiopia and internal conflicts and tribal warfare. And, complicating all this, Somalia sustained dreadful starvation and refugee conditions as a result of a severe drought in the early 1990s. At least 300,000 people died between 1991 and 1992. Flooding in 1998 killed thousands and left hundred of thousands without a home; coupled with renewed inter-clan violence and the looming threat of famine, Somalia continues to face difficult times ahead.",
        "flag": "https://www.worldometers.info/img/flags/so-flag.gif"
    },
    {
      "country":"South Africa",
        "information": "Blessed with incredible natural resources, the region known as South Africa has had a difficult history marked by ethnic conflicts and struggle. Originally settled by a variety of native peoples, the Dutch founded a settlement they called Cape Town in 1652. It was an important stop on the trade routes between Europe and Asia. These Dutch became known as Afrikaaners and later Boers. In 1841, Cape Town came under British control, but other Afrikaaner provinces (Orange Free State and the Transvaal) did not. The discovery of rich diamond mines and gold in these areas generated great interest among the British which led to Boer rebellions. Full-fledged war erupted in 1881-1882. It was inconclusive and a second conflict arose in 1899-1902. The British defeated the Boers and gained complete control of the country. The Union of South Africa was formed in 1910, with the country becoming a self-governing part of the British empire 24 years later. The next decades were marked by conflict between the British and Afrikaaner South Africans. Following World War II, racial politics came to the fore with the establishment of the policy known as apartheid.",
        "flag": "https://www.worldometers.info/img/flags/sf-flag.gif"
    },
    {
      "country":"Spain",
        "information": "Spain's roots date back thousands of years when the Phoenicians traded at the country's Mediterranean ports and the population included Celts, Basques, and Iberians. The Romans arrived in 200 B.C. and their rule lasted for nearly 4 centuries, until the Visigoths invaded. Christianity conquered the Visigoths (they converted) but the Berber-Arab North African Moors captured the peninsula in 711 and led to an unprecedented period of culture and civilization. Slowly but surely, however, the Christians reconquered the region and after over 700 years, the last Moorish city, Granada, fell in 1492. The reign of Isabella and Ferdinand brought exploration of the New World to the fore (they supported the voyages of Christopher Columbus) but included the horrors of the Inquisition (begun in 1478) which cost untold thousands of Jews their lives. All the Jews were expelled in 1492. A decade later, so were the Muslims. By 1700, Spain had reached the apogee of its power as a conqueror: South America, Central America, Mexico, western North America, the Philippines and other areas of Africa and Asia were in Spanish hands. By the 19th century, Spain had lost nearly all its major possessions. It weakness was underscored by its humiliating defeat at the hands of the United States in the Spanish-American War in 1898. Civil war in the late 1930s cost Spain dearly: it was help in the grip of dictatorship for nearly the next 40 years under General Francisco Franco. Only after his death in 1975, did the country return to its monarchist roots with the ascension to the Spanish throne of Juan Carlos. Unexpectedly, King Juan Carlos has succeeded in reforming Spain and bringing it fully into the European family of nations.",
        "flag": "https://www.worldometers.info/img/flags/sp-flag.gif"
    },
    {
      "country":"Sudan",
        "information": "Sudan in its early history was part of the Kingdom of Nubia. In 1820 it was conquered by Egypt underMohammed Ali. Sudan came under English-Egyptian control. In 1953 Sudan was given self-government and became fully independent in 1955.In 1969 General Gaafar Mohamed Nimeiri became Prime Minister, two years later he became the first elected President. He was ousted in 1985. Sudan has been engaged in a civil war for over 15 years between the North and the South.",
        "flag": "https://www.worldometers.info/img/flags/su-flag.gif"
    },
    {
      "country":"Suriname",
        "information": "Suriname, located on the northeastern coast of South America, was settled by the Dutch and the British in the early 1600s. In 1667, the region became a Dutch colony. That status continued virtually unchanged (except for brief interludes of British control) until independence, which was achieved in 1975. In 1980, Suriname's became a military-controlled government, one which eliminated opposition parties. Eight years later, military rule was removed but the limitations placed on civil liberties remained in place. It was not until 1991 that civilian rule was reestablished (although there is evidence that the true ruler of the country remains the former military ruler, Col. Desi Bouterse).",
        "flag": "https://www.worldometers.info/img/flags/ns-flag.gif"
    },
    {
      "country":"Swaziland",
        "information": "As was the case in many African countries, Swaziland's indigenous population came under the control of colonial powers -- in this case, British and Boer -- beginning in the 19th century. Independence from Britain was a long while coming: a constitutional monarchy was declared in 1968. Although the King, Sobhuza II, discarded the original constitution in 1973, a new legislature was formed in 1979. Sobhuza died in 1982 and was succeeded by his son.",
        "flag": "https://www.worldometers.info/img/flags/sz-flag.gif"
    },
    {
      "country":"Sweden",
        "information": "Sweden's history dates back to the 6th century. As disparate kingdoms, the peoples of Sweden participated in Viking raids that took place for hundreds of years. Though Christianity came to the region in the 9th century, it took another three hundred years for the religion to fully establish itself. For a time, the Swedish and Norwegian realms merged and in 1397, Sweden, Denmark, and Norway were united by Queen Margaret. In 1523, the Swedish aristocracy rose against the Danish and declared Swedish monarchy under Gustavus I. By 1604, Lutheranism had taken over and Catholicism was outlawed. Sweden participated in various European conflicts in the 17th and 18th centuries and it was not until 1905 that Sweden's modern borders were finally established. Long known for being politically neutral, Sweden continues to play an important role in Scandinavian and European affairs.",
        "flag": "https://www.worldometers.info/img/flags/sw-flag.gif"
    },
    {
      "country":"Switzerland",
        "information": "Switzerland was the Roman province of Helvetica. In 1291 three independent cantons came together to form an alliance against the expansion of the Hapsburg power. The league slowly grew to 22 states in 1815. In 1648 The Treaty of Westphalia which ended the Thirty Years war officially recognized the independence of Switzerland. Switzerland has guarded its neutrality in the many wars the racked Europe ever since 1648.",
        "flag": "https://www.worldometers.info/img/flags/sz-flag.gif"
    },
    {
      "country":"Syria",
        "information": "Syria's history dates back to the ancient empires of the Hittites, Assyrians, and Persians. A number of conquerors controlled the region, including Babylonians, Egyptians, Phoenicians, Greeks, the Seleucid empire and Rome. Islam came to the region early on and for a period of 90 years (661-751), Damascus was the center of Islamic rule. The Turks arrived in the late 11th century and were in turn threatened by the Crusaders. But the 12th century's Saladin, succeeded in defeating both Turks and Crusaders. The Mamluk empire followed Saladin and Syria was twice attacked by the Mongols during the Mamluk era. The Mamluks were not defeated until the early 16th century by the Ottomans, who essentially retained control until the early 20th century. The League of Nations placed Syria and Lebanon under the control of France. As a reaction to the French in Syria professing loyalty to the Vichy government, Britain together with Free French forces invaded Syria in 1941, creating a Syrian republic the same year. Complete independence was declared in 1944. For the last fifty-plus years, Syria has been an implacable foe of its Middle East neighbor, Israel. Through various configurations, the government of Syria has spent most of its energies on maintaining either a hot war or an uneasy ceasefire with Israel. In 1967, Syria lost the Golan Heights to Israel, which remains in Israeli hands though Syria tried (and failed) to recapture the area during the 1973 Yom Kippur War. Tensions have persisted between Israel and Syria over Lebanon. Since the extremist Ba'ath party came to power in 1963, Syria has maintained a radical stance on most Middle Eastern affairs including terrorism. Syria's long-time leader Hafez el-Assad died in June 2000, a situation which will doubtless have significant ramifications on the stability of the country and the region.",
        "flag": "https://www.worldometers.info/img/flags/sy-flag.gif"
    },
    {
      "country":"Taiwan",
        "information": "Taiwan, located off the coast of China, came to prominence in 1949 when the Nationalist forces (about two million strong) retreated from the Mainland as Communism took over the country. For decades, the world recognized Taiwan as the legitimate government of China but in 1971, Communist China assumed the United Nations seat that had been occupied by Taiwan. Eight years later, Taiwan's firmest ally, the United States, recognized the People's Republic of China. Worries that Taiwan would be harmed economically were misplaced and in the decades since, it has become one of the strongest in the world. Taiwan's government has maintained coolness towards any suggestion that Taiwan 'reunify' with the Communist Mainland.",
        "flag": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Flag_of_the_Republic_of_China.svg/220px-Flag_of_the_Republic_of_China.svg.png"
    },
    {
      "country":"Tajikistan",
        "information": "The current Tajik Republic hearkens back to the Samanid Empire (A.D. 875-999), which ruled what is now Tajikistan as well as territory to the south and west, as their role model and name for their currency. During their reign, the Samanids supported the revival of the written Persian language in the wake of the Arab Islamic conquest in the early 8th century and played an important role in preserving the culture of the pre-Islamic Persian-speaking world. They were the last Persian-speaking empire to rule Central Asia. After a series of attacks beginning in the 1860s during the ''Great Game'' between the British Empire and the Russian Empire for supremacy in Central Asia, the Tajik people came under Russian rule. This rule waned briefly after the Russian Revolution of 1917 as the Bolsheviks consolidated their power and were embroiled in a civil war in other regions of the former Russian Empire. As the Bolsheviks attempted to regain Central Asia in the 1920s, an indigenous Central Asian resistance movement based in the Ferghana Valley, the ''Basmachi movement,'' attempted to resist but was eventually defeated in 1925. Tajikistan became fully established under Soviet control with the creation of Tajikistan as an autonomous Soviet socialist republic within Uzbekistan in 1924, and as one of the independent Soviet socialist republics in 1929.",
        "flag": "https://www.worldometers.info/img/flags/ti-flag.gif"
    },
    {
      "country":"Tanzania",
        "information": "Once called Tanganyika, this region has been an important element in East African trade routes since antiquity. Both a mainland (Tanganyika) and island (Zanzibar) land, it was inhabited by a variety of native peoples. Though Arabs and Persians controlled the area at different times, the land that would become Tanzania eventually fell under Portuguese influence -- at least as far as coastal trade was concerned (they never did colonize the interior sections of the country). By 1506, they claimed the entire coast, although they were driven out by the sultan of Oman about a century-and-a-half later. The Omanis opened up the slave trade, as well as trade in gold, ivory, and gems. During the 19th century, Britain and Germany both cast their eyes on Zanzibar, dividing up the territory such that Zanzibar became a British protectorate and Tanganyika, a colony of German East Africa. During World War I, the British and the Germans clashed here in battle. The League of Nations turned over the region to Britain as a mandate in 1920, and later the United Nations made it a British trusteeship. Independence for Zanzibar was achieved in 1963, but a revolt one year later resulted in the wholesale departure of thousands of Arab citizens (and the deaths of thousands more). Tanganyika became independent in 1961, led by Julius Nyerere. The two countries united as Tanzania in 1964.",
        "flag": "https://www.worldometers.info/img/flags/tz-flag.gif"
    },
    {
      "country":"Thailand",
        "information": "Thailand existed in the form of many small states as far back as 1000 AD. Much influenced by India, Burma and the Khmer peoples, the region soon came under the sway of Buddhism. The kingdom of Siam was created in about 1350. Less than two centuries later, the Portuguese had arrived, along with other Europeans (bent on trade and missionizing). Siam managed to avoid European colonization but was forced to cede control of some of its more far-flung possessions (portions of Malaya, Laos, and Cambodia) to Britain and France. Though the absolute monarchy ended in 1932, a monarchy has endured. Occupied by the Japanese in 1941, Siam declared war on the US and Britain, while the monarchy secretly backed anti-Japanese actions on the part of the resistance. During the Vietnam War, Thailand was an important staging area for the US military. Attractive to investors and tourists alike, Thailand had been doing well economically until a decline in 1996 (brought about by the actions of a military-dominated government).",
        "flag": "https://www.worldometers.info/img/flags/th-flag.gif"
    },
    {
      "country":"Togo",
        "information": "This West African country was inhabited by native peoples when the Portuguese in the late 1400s. It was dubbed ''the slave coast'' because of the vigorous slave trade carried on for about 200 years (1600s to 1800s). In 1884, the Germans made Togo a protectorate, but as in much of Africa, the aftermath of World War I left the country divvied up between Britain and France, an arrangement supported by the League of Nations. The British sector later became a part of Ghana, while the French portion became independent in 1960, becoming the Independent Republic of Togo. In 1967, a military coup overthrew the government. Lt. Col. Gnassingbe Eyadema was installed as president; he served until 1990, when democratic reformers forced him out. Though he briefly returned to serve in 1992, a new constitution (1992) and new elections (1994) changed the course of the government to multiparty democracy.",
        "flag": "https://www.worldometers.info/img/flags/to-flag.gif"
    },
    {
      "country":"Trinidad and Tobago",
        "information": "Though a Spanish possession for three centuries, Trinidad was ceded to the British in 1797. Tobago came under British control five years later. British rule came to an end in 1962 and the country has largely achieved political stability with the exception of an Islamic militant-run seizure of Parliament in 1990. Reforms were promised and the hostages -- including the prime minister -- were released. In the cause of stability and peace, amnesty was granted to the Muslim militants in 1992.",
        "flag": "https://www.worldometers.info/img/flags/td-flag.gif"
    },
    {
      "country":"Tunisia",
        "information": "TFrom Phoenician settlements begun in about 1000 BC, including Carthage, the region known today as Tunisia has figured in Mediterranean history ever since. The Romans, followed by the Vandals and the Byzantines, all desired Tunisia. Islam spread here in the seventh century and led to the country's emergence as an important Islamic center. In 1574, the Ottomans made Tunisia part of their empire, ruling from Constantinople. Tunisia became French protectorate in 1881 and by the 20th century, nationalist movements began to surface. Their activities subsided during World War II, when Allied and Axis powers fought here, but resumed after the war. By the 1950s, it was clear that French control was coming to an end and independence was declared in 1956. Habib Bourguiba's New Constitution party took control of the government in 1957; he himself was named president for life in 1959. He was overthrown, however, in 1987. The stability of Tunisia has been challenged by radical Islamic groups in Tunisia and Algeria.",
        "flag": "https://www.worldometers.info/img/flags/ts-flag.gif"
    },
    {
      "country":"Turkey",
        "information": "An ancient civilization dating back to the Hittites, Turkey has witnessed all the great empires and conquerors marching on its territory. From Troy, to the Assyrians, from the Persians to Alexander, Rome and the Byzantines, history is encapsulated in this region of Asia Minor. By the end of the 13th century, the Ottomans had begun to expand, eventually encompassing Europe, the Middle East, Arabia, and Iran. After some 500 years, the Ottomans began to weaken. Known as 'the sick man of Europe', the empire saw its possessions begin to disappear. By the first World War, the empire was almost completely reduced and it took the Father of modern Turkey, Kamal Ataturk, to seize power, regain territory (with the help of the Soviet Union) and set the borders of what is modern Turkey. In 1923, it was declared a republic and the last vestiges of Ottoman power (the Caliphate) was officially at an end. Turkey became a founding member of the United Nations following World War II (for much of the war, Turkey maintained a careful neutrality but did end up declaring war on Nazi Germany in 1945). Turkey became a major ally of the United States, which regarded it as an important bulwark both against communism and Islamic fundamentalism. Turkey has faced a variety of political crises over the years, including Cyprus (major conflict with Greece), corruption, and the emergence of Islamic fundamentalist agitation.",
        "flag": "https://www.worldometers.info/img/flags/tu-flag.gif"
    },
    {
      "country":"Turkmenistan",
        "information": "This remote former republic of the now-vanished Soviet Union declared its independence in 1991. Its people are descendants of Mongol tribes, Turkic peoples, Persians, and Uzbeks. Because of its natural resources of oil and gas, the country is expected to make significant economic progress in the years to come. Under the Soviet Union, relatively little industrialization had been pursued and most of the population remains involved in agriculture.",
        "flag": "https://www.worldometers.info/img/flags/tx-flag.gif"
    },
    {
      "country":"Uganda",
        "information": "The British came to Uganda in the mid-1800s, though the region had been home to a number of kingdoms long before Europeans arrived. By 1890, the region was under the control of the British East Africa Company and a mere four years later, A British protectorate was declared. British settlers, who developed the agricultural possibilities of the country, prospered. By the 1950s, Britain was preparing the region for eventual independence, setting up a parliamentary government that seated both blacks and whites. Under the leadership of Milton Obote, the Uganda People's Congress became the most important political entity. In 1962, the country became independent within the British Commonwealth with Obote as president. In 1967, the country was declared independent. Four years later, Obote was ousted by Idi Amin Dada, the commander of Uganda's military. He became an absolute ruler, expelled Uganda's large Asian (Indian and Pakistani) population, and declared himself president-for-life. The degree of violence and repression under Idi Amin was unprecedented at the time. During his eight-year rule, Amin may have been responsible for the deaths of more than 300,000 of his countrymen.",
        "flag": "https://www.worldometers.info/img/flags/ug-flag.gif"
    },
    {
      "country":"United Kingdom",
        "information": "The history of Britain extends back to the megalithic and Iron Age peoples who were conquered by the Romans in 43 AD. Some 400 years later, the Romans withdrew from Britain, leaving the door open for Jute, Angle, and Saxon invaders. Native Celts continued to prosper in Wales, Scotland, and Ireland. The Vikings arrived in the eighth century and in 1066, the Conqueror, William of Normandy, crossed the English Channel and took over the country. In 1215, the Magna Carta was signed, a document which laid down legal rights (albeit for the nobility) and prepared the basis of parliamentary government. For three hundred years, the Plantagenets ruled England and Ireland, Wales, and portions of France. By 1453, England had lost it French territories thanks to the Hundred Years War. Two years later, the Plantagenets were supplanted by the Tudors, whose most famous member, Henry VIII, broke with Roman Catholicism in 1534 and established the Church of England. Henry's daughter Elizabeth I was perhaps the greatest monarch in the nation's history but she was the end of the Tudor line. Next came the Stuarts, whose hold on the monarchy was interrupted by Cromwell and the Civil War in 1642. Though they later tried to re-assert their claims to the throne, the crown would pass to successive dynasties culminating in the current House of Windsor. After the Restoration of the monarchy, Britain functioned more and more as a constitutional monarchy with Parliament occupying the supreme position. In the 18th century, Britain became the world's leading naval power with an empire that stretched from North America to India. With the Industrial Revolution, the nation also became the world's economic giant. Britain played pivotal roles in the two World Wars of the 20th century and though successful, saw the gradual dismemberment of their empire as nation after nation became independent. Though Britain is still regarded as a world power, and still maintains a Commonwealth composed of its former possessions, it is no longer the powerhouse of the past.",
        "flag": "https://www.worldometers.info/img/flags/uk-flag.gif"
    },
    {
      "country":"Ukraine",
        "information": "The area of the Ukraine represents the beginnings of the original Russian state, about twelve centuries ago. The Mongols invaded the area in the 13th and 14th centuries. At that point, control of the region was in Lithuanian and Polish hands. In 1654, Ukraine became part of the Russian empire though shortly thereafter it was partitioned between Poland and Russia. The part annexed by Poland later came under the influence of Austria as Poland itself was partitioned. After the Russian Revolution, the Ukraine made an attempt to establish its autonomy but it eventually became a Soviet republic. In 1921, the region was once again divided: the western portion of the country was given to Poland, Czechoslovakia, and Romania and the eastern Ukraine became the Ukrainian Soviet Socialist Republic. Stalin's attempts to force collectivism on the Ukraine in the 1930s, resulted in millions of deaths, chaos, and famine (as in other of the SSRs at the time). The Ukraine declared itself sovereign in 1990 and the Communist party was outlawed in 1991, leading to a declaration of total independence. In December of that year, Ukraine joined other former SSRs in the creation of the Commonwealth of Independent States. Tensions with Russia since then have revolved around conflicts over nuclear warheads and other issues. The Ukrainian economy has yet to stabilize.",
        "flag": "https://www.worldometers.info/img/flags/up-flag.gif"
    },
    {
      "country":"United Arab Emirates",
        "information": "Early Years: The United Arab Emirates (UAE) was formed from the group of tribally organized Arabian Peninsula sheikhdoms along the southern coast of the Persian Gulf and the northwestern coast of the Gulf of Oman. This area was converted to Islam in the seventh century and forcenturies afterward was embroiled in dynastic disputes. Most UAE nationals are descended from two tribal groupings, the Qawasim and the Bani Yas, which emerged as leading powers in the eighteenth century. The Qawasim, mainly land and sea traders, dominated what are today the emirates of Ras al Khaymah and Sharjah. The Bani Yas, who were agricultural and pastoral, lived in what are today the emirates of Abu Dhabi and Dubai. From the seventeenth to the nineteenth century, the area became known as the Pirate Coast, as both European and Arab pirates attacked foreign ships. The British mounted expeditions against the pirates during this period, culminating in an 1818 campaign against the pirate headquarters of Ras al Khaymah and other harbors along the coast. This action ostensibly was taken to safeguard British maritime routes, particularly those of the British East India Company, but some historians have noted that the war was in fact motivated by the British desire to establish supremacy in the region against the claims of other European powers.",
        "flag": "https://www.worldometers.info/img/flags/ae-flag.gif"
    },
    {
      "country":"United States",
        "information": "Even before the Mayflower touched ground off Cape Cod, African Americans were living in British North America. Although slavery itself was not foreign to West Africans, the brutal nature of the TRANS-ATLANTIC SLAVE TRADE and the nature of COLONIAL SLAVERY was without parallel in African history. Millions of people deemed savages by their new 'MASTERS' were uprooted from their ways of life and forced to adopt new ones. Europeans and even some Africans would participate in the slave trade that brought millions of Africans to the New World. African SLAVE TRADERS would ruthlessly bring their captives from the interior of the continent where they would await the business transaction that would take them thousands of miles from their homeland. Slaves bound for the North American British colonies overcame tremendous odds to reach their destinations. The dreaded 'Middle Passage' often claimed half or more of its human cargo. Most of the survivors lived harsh lives as plantation slaves. Some lived in the towns and learned trades and some lived as domestic slaves, particularly in the North. Often overlooked are free African Americans, who managed to escape or were lucky enough to be granted their freedom. Yet as the seventeenth century became the eighteenth century, the institution grew. Harsh CODES were adopted across the South, and although slavery was less common in the North, many New England shippers profited from the so-called triangular trade. Slavery was indeed becoming entrenched in British colonial life. The colonization of the Americas brought together for the first time three distinctive peoples from three distant continents. The Native Americans, Europeans, and Africans that inhabited what would become the United States of America each previously had glorious civilizations and would contribute to a new glorious civilization that would follow.",
        "flag": "https://www.worldometers.info/img/flags/us-flag.gif"
    },
    {
      "country":"Uzbekistan",
        "information": "Uzbekistan is an authoritarian state with a population of approximately 27.6 million. The constitution provides for a presidential system with separation of powers among the executive, legislative, and judicial branches. In practice President Islam Karimov and the centralized executive branch dominated political life and exercised nearly complete control over the other branches. Of the 150 members of the lower house of parliament, 135 are elected, and 84 of the 100 senators are chosen in limited elections open only to elected members of local councils. The president appoints the remainder. In December 2007, the country elected President Karimov to a third term in office; however, according to the limited observer mission from the Organization for Security and Cooperation in Europe (OSCE), the government deprived voters of a genuine choice. Parliamentary elections took place on December 27. While noticeable procedural improvements were observed, the elections were not considered free and fair due to government restrictions on eligible candidates and government control of media and campaign financing. Civilian authorities generally maintained effective control of the security forces.",
        "flag": "https://www.worldometers.info/img/flags/uz-flag.gif"
    },
    {
      "country":"Vanuatu",
        "information": "These Pacific Islands were once known as the New Hebrides. Beginning in 1887, the New Hebrides were jointly controlled by Britain and France. Having escaped Japanese occupation, the islands, siding with the Free French, were used as bases for Allied attacks during the second World War. Independence was declared in 1980 and Vanuatu joined the British Commonwealth.",
        "flag": "https://www.worldometers.info/img/flags/nh-flag.gif"
    },
    {
      "country":"Venezuela",
        "information": "Although Columbus is said to have ''discovered'' Venezuela in 1498, the region was already home to thousands of indigenous Indians. Spanish exploration became important in the 1520s as the Europeans quested for gold and other precious items. Caracas was founded in 1567 and, helped by African slave labor, the area became an agricultural center for both cocoa and wheat. By the end of the 18th century, the country was chafing under Spanish rule and after fairly destructive wars of independence, the goal was achieved in 1821. The country federated with New Granada and Ecuador but it was short-lived and Venezuela was declared an independent republic in 1830. Periods of instability occurred during the latter half of the 19th century as military control waxed and waned. Between 1908 and 1935, the country was controlled by General Juan Vincente Gomez. Over the next decades, power shifted from military to non-military leaders and back again. In 1958, multiparty democracy took hold and, despite problems centering on foreign debt and other economic issues, the country has remained under civilian control. Challenges occurred, however, such as an attempted military coup in 1992 which would have brought down Latin America's longest-lived civilian government; antigovernment rioting linked to an austerity plan in 1996; and more recently, the worldwide economic crunch of 1998.",
        "flag": "https://www.worldometers.info/img/flags/ve-flag.gif"
    },
    {
      "country":"Vietnam",
        "information": "In the first millennium BC, the Chinese empire expanded into what is now Vietnam. China's hold on the area was maintained, more or less, for about the next 1000 years. Europeans came to the region in the 1500s and by the early 19th century, France was the undisputed foreign force in Indochina. French colonial rule expanded, which ultimately led to popular discontent. In 1954, the Vietnamese under Ho Chi Minh defeated the French at Dienbienphu. By armistice, the country was divided into a northern, Communist entity and a south under the French-created king Bao Dai. Refugees poured into the south and in 1955, the king was dismissed as a result of elections held in October of that year. The Republic of Vietnam was declared soon after. The conflict between the north and the south soon widened into a quagmire that engulfed the United States, some of its allies, and neighboring parts of Southeast Asia. The withdrawal of the US military from the country in 1975, led to the entire country coming under communist control, which is how it remains today. The US has made some inroads into establishing a relationship with Vietnam but progress is slow and the memories still relatively fresh of the conflict that claimed so many lives over so many years.",
        "flag": "https://www.worldometers.info/img/flags/vm-flag.gif"
    },
    {
      "country":"Yemen",
        "information": "The ancient kingdom of Sheba, and its port of Aden, occupied a strategic location on the Arabian peninsula, allowing it to have dominated the trade routes that passed from Africa through the Middle East to India and back again. Islam came early to the region and in the 10th century, the Zaidi sect gave Yemen its kings (and, concurrently, its religious leaders). The Zaidis ruled until 1962. But control over Aden was disputed by many peoples including the Portuguese, the Ottomans, and the British. Britain made Aden a crown colony in 1839, with portions of the country becoming a protectorate. The Ottomans exerted control over the region twice: from the mid-16th to the mid-17th centuries and from 1849 to 1918; they were expelled only at the conclusion of World War I and Yemen became independent in 1918. All did not go smoothly, however, as conflict arose with the Saudis, who invaded in 1934, and with Britain in 1954 over Aden. The throne was challenged in 1955 and when the imam died in 1962, the country was divided into North and South. Shortly thereafter, Aden and the protectorate began agitating for independence. South Yemen declared independence in 1967. Its leftist regime was socialist in nature. The North, civil war continued between royalist and republican elements until 1970. Clashes between north and south occurred in the early '70s and in 1979, full-scale war was launched by the South. North and South were reunited in 1990.",
        "flag": "https://www.worldometers.info/img/flags/ym-flag.gif"
    },
    {
      "country":"Zambia",
        "information": "Though the Portuguese came to this region in south central Africa in the 18th century, it was not until the mid-19th century that he Europeans turned their attention to the area. The arrival of merchants and missionaries, such as Cecil Rhodes and David Livingstone paved the way for the development of the country. By 1888, Rhodesia was made an official British sphere of influence; a protectorate was declared three years later. It was soon enlarged. In 1924, direct colonial rule was instituted, and British settlers began arriving in formidable numbers. Ranching, mining, agriculture all prospered. In 1953, Northern and Southern Rhodesia joined with Nyasaland in a federation. Significant unrest between the white colonials and the native peoples followed. The federation dissolved in 1962 and Northern Rhodesia was declared the independent Republic of Zambia in 1964.",
        "flag": "https://www.worldometers.info/img/flags/za-flag.gif"
    },
    {
      "country":"Zimbabwe",
        "information": "Huge ruins in Zimbabwe allude to the developed society that existed here in southern Africa between the 9th and 13th centuries. The Portuguese were followed by the British and the region became a British protectorate in 1888. Two years later, Salisbury (Harare) was established and the area of Zambia and Zimbabwe was named Rhodesia. Partitioned into Southern and Northern parts in 1923, the North became a British colony while the South became a self-governing, white-ruled state in the British Empire. The white settlers enjoyed great prosperity, while the native peoples had little say and reaped few, if any, of the economic benefits. In 1961, Southern Rhodesia promulgated a constitution that protected the white minority. Four years later, independence was declared, although the British government viewed the act as invalid and illegal. The United Nations, too, rejected the independence of Rhodesia under the white-led government of Ian Smith, and proceeded to impose sanctions and later, a trade embargo. It was not until years later that guerrilla warfare and unabated world pressure led to the establishment of a representative government. But the country has known little stability since and the economy has continued to deteriorate as the political situation remains uncertain.",
        "flag": "https://www.worldometers.info/img/flags/zi-flag.gif"
    }
]