[
    {
      "country": "Afghanistan",
        "information": "Afghanistan remained neutral during World War I, despite German encouragement of anti-British feelings and Afghan rebellion along the borders of British India. The Afghan king's policy of neutrality was not universally popular within the country, however. Habibullah, Abdur Rahman's son and successor, was assassinated in 1919, possibly by family members opposed to British influence. His third son, Amanullah, regained control of Afghanistan's foreign policy after launching the Third Anglo-Afghan war with an attack on India in the same year. During the ensuing conflict, the war-weary British relinquished their control over Afghan foreign affairs by signing the Treaty of Rawalpindi in August 1919. In commemoration of this event, Afghans celebrate August 19 as their Independence Day.",
        "flag": "https://www.worldometers.info/img/flags/af-flag.gif"
    },
    {
      "country": "Albania",
        "information": "Albania began as a colony established by the Greeks over 600 years before Christ. After periods under the control of the Romans, Byzantines, Normans, Venetians, Slavs, and kings of Naples, Albania came under the control of the Ottoman Empire for over 400 years. Independence was achieved in 1912, although the country was occupied by Austria-Hungary and Italy, countries which had been instrumental in its creation. Eventually, a tribal chief named Ahmed Zogu was named president of the republic in 1924, though he named himself King Zog I, four years later. A socialist republic was established in 1946, after World War II. During that war, a resistance leader emerged, named Enver Hoxha. He had seized power in 1944. After 1946, the country was virtually closed to the outside world and a totalitarian regime developed. Hoxha became closely involved with China, following his break with the Soviet Union over Communist doctrine. That link, too, was broken in 1977 and Albania all but ceased to participate in any world affairs. Hoxha died in 1985 and by the early 1990s, anarchy and chaos was the norm in the country. In 1994, a measure of order was restored, only to have problems return in 1997. NATO came to help establish an Albanian army in 1998 at a time when ethnic Albanians began rebelling in Kosovo (Yugoslavia) and were ultimately driven out of that province and into Albania. In late 1998, internal disarray continued with violence erupting between the Democratic Party and the Socialists, who had been in control since 1997.",
        "flag": "https://www.worldometers.info/img/flags/al-flag.gif"
    },
    {
        "country": "Algeria",
        "information": "Algeria is an ancient country with a history that extends back several thousand years to the time of the Phoenicians. The Romans, followed by the Germanic Vandal tribes and the Byzantines all ruled the area. When Islam grew mighty in the 8th century A.D., the Berbers of Algeria were converted to that religion and a unique civilization flourished. Some eight centuries later, Spain conquered Algiers and other cities but was driven out by Barbarossa who brought Algeria into the Turkish Ottoman Empire. From this point, piracy became an important money-making tool for the country, so much so that by 1800, the US, England, and France joined in an effort to combat piracy in the Mediterranean. Ottoman rule over the country was brought to an end by the French in 1830. In 1848, following an Islamic rebellion, France made Algeria a legal part of France. In the mid-1950s, a guerilla effort arose to oust the French led by the FLN (Front de Liberation Nationale) and in 1962, independence was declared. Immediately, about a million colonists left Algeria for France. Times have been turbulent for Algeria since independence, including close relations with the Soviet Union and a struggle between fundamentalist Islamists and the military. Since 1992, over 40,000 people have died due to civil unrest and assassinations. In 1999, elections were held; only one candidate remained in the race: Abdelazziz Bouteflika. His government reached agreement with the Islamic rebels in September 1999.",
        "flag": "https://www.worldometers.info/img/flags/ag-flag.gif"
    },
    {
      "country" : "Angola",
        "information": "Angola's land has been inhabited by Bantu tribes for thousands of years. The Portuguese arrived in 1575 and began an enormous slave trade from Angola to Brazil that took over 3 million people into slavery over the course of 3 centuries. By the late 19th century, Angola was a colony of Portugal, with Portuguese in control of the local government, commerce, and agriculture. But by the 1950s, there was a call for independence, led by the National Front. Guerilla activity soon ensued. The Portuguese ultimately fled and independence was declared on November 11, 1975. Peace did not arrive, however, with civil war erupting between the MPLA and UNITA factions. Though the MPLA set up a Marxist regime, many parts of the country were actually under UNITA control. Fighting continued through the 1980s and it was not until 1991 that a cease-fire was obtained between the government and UNITA. It was short-lived, however, since renewed fighting began after the results of the 1992 elections (the first in the country since 1975). The MPLA won but UNITA's Jonas Savimbi did not accept the election outcome. Though the United Nations tried for 4 years to get the situation under control, the conflict continues and has taken at least 100,000 lives since the 1970s.",
        "flag": "https://www.worldometers.info/img/flags/ao-flag.gif"
    },
    {
      "country" : "Antigua",
        "information": "Antigua was claimed by Christopher Columbus in 1493 and settled by the British some 140 years later. Tobacco and sugar were the two commercial mainstays but with slavery abolished in 1834, several natural disasters occurring in the 1840s, and the closing of a Royal Dockyard in 1854, the economy suffered. Independence was granted in 1981 and the Antigua Labor Party remains at the government helm. Tourism forms the principal economic base of the country today.",
        "flag": "https://www.worldometers.info/img/flags/ac-flag.gif"
    },
    {
        "country" : "Argentina",
        "information": "Europeans first discovered Argentina in 1502 during the voyage of Amerigo Vespucci. In 1580 the Spanish founded a colony in Buenos Aires. By 1800 Buenos Aires had a population of 50,000. In 1816 Argentina declared it independence from Spain. In 1824 a constitutional assembly passed a constitution. Conservative political forces for the rest of the 19th century dominated Argentina. During this period the country grew rapidly. In 1916 Radical forces took control of the government. They were ousted in 1935. In 1946 Juan Peron took control of the government. Peron was ousted in 1955 by the military. The military maintained power until 1973, when violence forced the military to allow the return of Peron. He died the next year and his third wife Isabella Peron took over. She was able to maintain power for only two years. The military regained power and instituted a very repressive regime in which 20,000 leftist disappeared. When Argentina occupied the Falkland Islands in 1982 the British defeated the Argentineans and reoccupied the Falklands. The defeat resulted in the fall of military government. In 1989 Carlos Memen became the President of the country and began serious economic and political reform.",
        "flag": "https://www.worldometers.info/img/flags/ar-flag.gif"
    },
    {
        "country" : "Armenia",
        "information": "After the destruction of the Seleucid Empire, the first Armenian state was founded in 190 BC. At its zenith, from 95 to 55 BC, Armenia extended its rule over the area of what is now eastern Turkey. For a time, Armenia was the strongest state in the Roman East. It became part of the Roman Empire and adopted a Western political, philosophical, and religious orientation. In 301 AD, Armenia became the first nation to adopt Christianity as a state religion, establishing in the 6th century a church that still exists independently of both the Catholic and the Eastern Orthodox churches. During its later political eclipses, Armenia depended on the church to preserve and protect its unique identity. Between the 4th and 19th centuries, Armenia was conquered and ruled by, among others, Persians, Byzantines, Arabs, Mongols, and Turks. For a brief period from 1918 to 1920, it was an independent republic. In late 1920, the communists came to power, and in 1922, Armenia became part of the Trans-Caucasian Soviet Socialist Republic. In 1936, it became the Armenian Soviet Socialist Republic. Armenia declared its independence from the Soviet Union on September 23, 1991.",
        "flag": "https://www.worldometers.info/img/flags/am-flag.gif"
    },
    {
        "country" : "Australia",
        "information": "In 1770 Captain James Cook discovered Australia in 1770. The British first settled Australia in 1788 as a penal colony. On January 1 1901 commonwealth was declared in Australia. Australian forces fought in both World Wars. In 1973 racially discriminatory immigration policies were ended. IN 1998 the Australian Constitutional Convention voted to sever all ties with Great Britain. A national referendum failed to approve this move.",
        "flag": "https://www.worldometers.info/img/flags/as-flag.gif"
    },
    {
        "country" : "Austria",
        "information": "The Austro-Hungarian Empire played a decisive role in central European history. It occupied strategic territory containing the southeastern routes to Western Europe and the north-south routes between Germany and Italy. Although present-day Austria is only a tiny remnant of the old empire, it retains this unique position. Soon after the Republic of Austria was created at the end of World War I, it faced the strains of catastrophic inflation and of redesigning a government meant to rule a great empire into one that would govern only 6 million citizens. In the early 1930s, worldwide depression and unemployment added to these strains and shattered traditional Austrian society. Resultant economic and political conditions led in 1933 to a dictatorship under Engelbert Dollfuss. In February 1934, civil war broke out, and the Socialist Party was outlawed. In July, a coup d'etat by the National Socialists failed, but Dollfuss was assassinated by Nazis. In March 1938, Austria was incorporated into the German Reich, a development commonly known as the ''Anschluss'' (annexation).",
        "flag": "https://www.worldometers.info/img/flags/au-flag.gif"
    },
    {
        "country": "Azerbaijan",
        "information": "This ancient region has been occupied by a variety of peoples including the indigenous nomadic Azeris, as well as Persians, Muslims, Arabs, Turks, Mongols, and Russians. Because of its geographic location, the capital Baku has been important in controlling the Caspian Sea. Though the Persians, Ottomans, and Russians wrestled with each other for hegemony over the area during the 18th and 19th centuries, it was the Russians who eventually gained the upper hand through the Treaty of Turkmenchai (1828), which gave them the northern part of the land. Persia got the southern half. The Russians transformed Azerbaijan into an industrial center. It also became a revolutionary center. Though the first republic established in 1918 was overthrown in 1920 by the Soviet Red Army, a separate Azerbaijan Soviet Socialist Republic did come into being. During the period under Soviet domination, the country underwent industrial growth, collectivization of agriculture, and religious persecution. In 1988, Azerbaijan went to war against neighboring Armenia over the Naborno-Karabakh region (ethnically Armenian, but within Azerbaijan territory). The ensuing hostilities continue. With the fall of the Soviet Union, Azerbaijan has had difficulties with issues of democracy as it tried to hold free and honest elections in 1995 and 1998. Charges of vote-rigging persist and officials sent to monitor the elections of 1998 charged that there were serious irregularities in the process.",
        "flag": "https://www.worldometers.info/img/flags/aj-flag.gif"
    },
    {
        "country": "Bahamas",
        "information": "In 1492, Christopher Columbus made his first landfall in the Western Hemisphere in The Bahamas. Spanish slave traders later captured native Lucayan Indians to work in gold mines in Hispaniola, and within 25 years, all Lucayans perished. In 1647, a group of English and Bermudan religious refugees, the Eleutheran Adventurers, founded the first permanent European settlement in The Bahamas and gave Eleuthera Island its name. Similar groups of settlers formed governments in The Bahamas until the islands became a British Crown Colony in 1717. The first Royal Governor, a former pirate named Woodes Rogers, brought law and order to The Bahamas in 1718, when he expelled the buccaneers who had used the islands as hideouts. During the American Civil War, The Bahamas prospered as a center of Confederate blockade-running. After World War I, the islands served as a base for American rumrunners. During World War II, the Allies centered their flight training and anti-submarine operations for the Caribbean in The Bahamas. Since then, The Bahamas has developed into a major tourist and financial services center. Bahamians achieved self-government through a series of constitutional and political steps, attaining internal self-government in 1964 and full independence within the Commonwealth on July 10, 1973.",
        "flag": "https://www.worldometers.info/img/flags/bf-flag.gif"
    },
    {
        "country": "Bahrain",
        "information": "For thousands of years, the area of Bahrain has been on the trade route between India and Arabia. Though the Portuguese managed to gain control of the area in the 16th century, the Persians ousted them in the 17th century. A century later, Bahrain was a sheikhdom of the Ottoman Empire and by 1861, it was a British protectorate. It took over another 100 years for the country to achieve independence. At present, the United States maintains a base here that played an important role during the Gulf War of 1991. Though there has been unrest in the country, reflecting its high unemployment, repressive government, and the vast gap between rich and poor, the family-run government has maintained control with Hamad bin Isa al-Khalifa succeeding his father, the founding emir, in 1999.",
        "flag": "https://www.worldometers.info/img/flags/ba-flag.gif"
    },
    {
        "country": "Bangladesh",
        "information": "The area that came to be Bangladesh was ruled by Buddhist kings for 400 hundred years until being conquered by the Muslims about 1200 A.D. In the 16th century it was absorbed into the Moghul Empire and by 1642 the British had arrived in the form of the British East India Company. One hundred years later, the area was entirely under British rule. In 1947, India achieved independence with Hindu (West) Bengal assigned to India and the East (Muslim) area given to Pakistan. Nearly a quarter of a century later, the Eastern Bengal claimed its own independence with civil war ensuing. An astounding 10 million refugees fled to India. Since independence, Bangladesh has remained one of the world's poorest nations, marked by instability in every realm along with a tendency to be in the path of natural disasters.",
        "flag": "https://www.worldometers.info/img/flags/bg-flag.gif"
    },
    {
        "country": "Barbados",
        "information": "Great Britain claimed Barbados in 1620 by that time all local inhabitants were removed by the Spanish. The island remained a British colony, until it achieved independence in 1963. It remains part of the British Commonwealth.",
        "flag": "https://www.worldometers.info/img/flags/bb-flag.gif"
    },
    {
        "country": "Belarus",
        "information": "Belarus has been inhabited since prehistoric times, and the first recorded settlements date back to the 6th century AD. The princes of Kiev ruled Belarus until the invasion of the Mongols in 1240, when most of its towns were destroyed. The region came under the control of powerful Lithuanians and, in 1386, under the Lithuanian-Polish Jagiellonian Dynasty. For centuries, the Poles and the Muscovites struggled bitterly over Belarus. In 1772, Catherine the Great gained control over part of the country, and, by 1795, Russia ruled all of Belarus. During the 19th and 20th centuries, the country again became a European battleground. Napoleon passed through Belarus--and fought there--in 1812, and the Germans fought the Soviets on Belarusian territory in World War I. Although a Soviet Socialist Republic was proclaimed in January 1919, fighting with Poland continued until 1921. Belarus suffered heavy losses in World War II, when some 2.2 million inhabitants perished. The postwar period saw a significant rebirth-- especially in the economic sphere. On August 25, 1991, Belarus declared its independence from the Soviet Union.",
        "flag": "https://www.worldometers.info/img/flags/be-flag.gif"
    },
    {
        "country": "Belgium",
        "information": "From the time of Julius Caesar Belgium was ruled by a series of rulers. In 1830 Belgium became and an independent monarchy. In both World War I and World War II Belgium's neutrality was violated by the Germans who invaded. It was a major battleground during the war. Belgium recovered rapidly from World War II and was a founding member of European Union.",
        "flag": "https://www.worldometers.info/img/flags/be-flag.gif"
    },
    {
        "country": "Belize",
        "information": "The Mayan civilization spread into the area of Belize between 1500 BC and AD 300 and flourished until about AD 1200. Several major archeological sites -- notably Caracol, Lamanai, Lubaantun, Altun Ha, and Xunantunich -- reflect the advanced civilization and much denser population of that period. European contact began in 1502 when Columbus sailed along the coast. The first recorded European settlement was begun by shipwrecked English seamen in 1638. Over the next 150 years, more English settlements were established. This period was also marked by piracy, indiscriminate logging, and sporadic attacks by Indians and neighboring Spanish settlements. Great Britain first sent an official representative to the area in the late 18th century, but Belize was not formally termed the Colony of British Honduras until 1840. It became a crown colony in 1862. Subsequently, several constitutional changes were enacted to expand representative government. Full internal self-government under a ministerial system was granted in January 1964. The official name of the territory was changed from British Honduras to Belize in June 1973, and full independence was granted on September 21, 1981.",
        "flag": "https://www.worldometers.info/img/flags/bh-flag.gif"
    },
    {
      "country":"Benin",
        "information": "Benin was a center of African civilization, wealth, and strength seven hundred years ago, though its early history goes back even farther. Much of its commercial success came as a result of the slave trade, which began after Europeans arrived there in the late 15th century and continued until 1885. Under French domination until independence in 1960, the country found it hard to stabilize after the French withdrew. Over two decades of corrupt Marxist-led rule left the economy in disastrous shape and led to the ouster of the Marxist regime in 1991. In 1995, the Marxists regained power but in 1998, were again ousted.",
        "flag": "https://www.worldometers.info/img/flags/bn-flag.gif"
    },
    {
      "country":"Bhutan",
        "information": "A Lamaistic Buddhist theocracy was established in Bhutan in the 16th century. Bhutan came under the domination of the British in India in 1865. It became a British protectorate in 1910. After India was granted independence from Great Britain, it granted Bhutan independence in 1949.",
        "flag": "https://www.worldometers.info/img/flags/bt-flag.gif"
    },
    {
      "country":"Bolivia",
        "information": "Bolivia was part of the Incan Empire from the 13 th century until the Spanish conquered it in the 1500's. The Spanish discovered large amounts of silver which in the area, and that became the primary focus of the colony. Simon Bolivar liberated Bolivia in 1825, being the last Spanish possession in South America to achieve independence. . Bolivia was on the losing side of a number of wars over the years with its neighbors; each war resulted in Bolivia losing territory to its neighbors. From 1962 until 1984 Bolivia was ruled by the military.",
        "flag": "https://www.worldometers.info/img/flags/bl-flag.gif"
    },
    {
      "country":"Bosnia and Herzegovina",
        "information": "It geographic location has placed the region squarely in the midst of European political power struggles for hundreds of years. Racial divisions, made worse by ever-changing borders and religious rivalries: Muslim, Roman Catholic, and Eastern Orthodoxy. While Yugoslavia kept the peace under Marshall Tito (and for a time after his death, as well) the fall of Communism signaled the beginning of the end for the tenuous unity of the area. In 1992, Bosnia and Herzegovina voted for independence, but the military (of Yugoslavia and mostly Serb) refused to recognize this move and began the siege of Sarajevo. Horrific episodes of so-called ''ethnic cleansing'' began as the Serbs attempted to clear Bosnia of Muslims and Croats. In 1995, a peace accord was finally signed dividing the region into a Serb republic and a Muslim-Croat federation, which would be governed under the same president and legislature. UN peacekeeping have been in the area since 1995.",
        "flag": "https://www.worldometers.info/img/flags/bk-flag.gif"
    },
    {
      "country":"Botswana",
        "information": "The Batswana, a term inclusively used to denote all citizens of Botswana, also refers to the country's major ethnic group (the ''Tswana'' in South Africa), which came into the area from South Africa during the Zulu wars of the early 1880s. Prior to European contact, the Batswana lived as herders and farmers under tribal rule. In the late 19th century, hostilities broke out between the Batswana and Boer settlers from the Transvaal. After appeals by the Batswana for assistance, the British Government in 1885 put ''Bechuanaland'' under its protection. The northern territory remained under direct administration and is today's Botswana, while the southern territory became part of the Cape Colony and is now part of the northwest province of South Africa; the majority of Setswana-speaking people today live in South Africa.",
        "flag": "https://www.worldometers.info/img/flags/bc-flag.gif"
    },
    {
      "country":"Brazil",
        "information": "Portuguese arrived in Brazil in 1500. They found a local Indian population. They first began trading with the Indians and then subdued them. The Portuguese and other Europeans started growing sugar in Brazil. The Portuguese gained full control over the early part of the 17th century. In 1822 Brazil became independent, with Don Pedro as the emperor. In 1865 Brazil became involved in a bloody five-year war with Paraguay. In 1888 slavery was abolished and the next year the emperor was overthrown by the military. 1889-1930 was the period of the ''old Republic''. It was overthrown by the military in 1930. From 1945 until 1964 the Second Republic was in power. Democracy was reinstituted in 1985.",
        "flag": "https://www.worldometers.info/img/flags/br-flag.gif"
    },
    {
      "country":"Brunei",
        "information": "The Brunei Empire achieved its height during between the 15 and 17th centuries. European influence resulted in the decline of the empire. Brunei was part of the British sphere of influence, and in 1881 it became a British protectorate. The discovery of oil in Brunei insured the fact that the colony became very wealthy. In 1984 Brunei was granted independence from Great Britain.",
        "flag": "https://www.worldometers.info/img/flags/bx-flag.gif"
    },
    {
      "country":"Bulgaria",
        "information": "Bulgaria was initially a part of the Byzantine Empire. When the Byzantine Empire fell it became independent. The Ottoman Empire conquered it in 1396. Bulgaria remained a member of the empire until 1878 when it became partially independent. It achieved full independence in 1908. Bulgaria participated in the Balkans Wars, which resulted in its loss of territory. During World War II Bulgaria was allied with Germany. At the end of the war the Soviet Union occupied the country and installed a communist government in Bulgaria. In 1990 a democratic government took control of Bulgaria.",
        "flag": "https://www.worldometers.info/img/flags/bu-flag.gif"
    },
    {
      "country":"Burkino",
        "information": "Until the end of the 19th century, the history of Burkina Faso was dominated by the empire-building Mossi, who are believed to have come from central or eastern Africa sometime in the 11th century. For centuries, the Mossi peasant was both farmer and soldier, and the Mossi people were able to defend their religious beliefs and social structure against forcible attempts to convert them to Islam by Muslims from the northwest. When the French arrived and claimed the area in 1896, Mossi resistance ended with the capture of their capital at Ouagadougou. In 1919, certain provinces from Cote d'Ivoire were united into a separate colony called the Upper Volta in the French West Africa federation. In 1932, the new colony was dismembered in a move to economize; it was reconstituted in 1937 as an administrative division called the Upper Coast. After World War II, the Mossi renewed their pressure for separate territorial status and on September 4, 1947, Upper Volta became a French West African territory again in its own right.",
        "flag": "https://www.worldometers.info/img/flags/uv-flag.gif"
    },
    {
      "country":"Burundi",
        "information": "The Hutu were the original settlers of Burundi. A few hundred years ago the Tutsi's arrived in the area and gained control over the Hutu in a semi feudal arrangement. European exploration of Burundi began in 1858. In 1899 Burundi was incorporated into German East Africa. Following World War I the League of Nations award the Burundi territory to Belgium. In 1962 Burundi achieved independence. Its government was initially a constitutional monarchy, but a military coup soon brought the military to power. In 1972 a Hutu rebellion left 10, Tutsi dead, a year later the Tutsi responded by slaughtering 150,000 Hutu. In the years, since Burundi has had one unstable government after another. Violence between Hutu and Tutsi has continued on and off throughout these years.",
        "flag": "https://www.worldometers.info/img/flags/by-flag.gif"
    },
    {
      "country":"Cambodia",
        "information": "Cambodia was an important power in Southeast Asia as far back as 13 centuries ago, with the Khmer Empire stretching from Cambodia, to Thailand, to Laos, and Vietnam. Their dominance of the area waned in the 14th century and the area eventually became a French protectorate (1863). Japan occupied Cambodia during World War II, but the French returned following the war's conclusion. In 1953, Prince Norodom Sihanouk led Cambodia to independence, the french having been defeated in Indochina. Cambodia's stability was severely challenged during the Vietnam War with the rise of the Khmer Rouge (Communist rebels). Sihanouk was deposed in 1970 by Lon Nol. Five years later, the Khmer Rouge captured Phnom Penh. Their leader, the despotic Pol Pot , conducted a reign of terror unlike any every seen in Asia. His regime was responsible for the deaths of at least 3 million people and the dispersion of hundreds of thousands more. Through the 1980s and early 1990s, various degrees of chaos plagued the country, which finally held elections in 1993. Though the Royalist forces captured about 40% of the vote, they agreed to join with the Cambodian People's Party in government sharing but by 1997, the coalition plan had deteriorated and Sihanouk was exiled. New elections were held in 1998 with the People's Party candidate Hun Sen victorious. Another coalition government was organized with Hun Sen as Premier and Sihanouk's son as President of the Assembly. By 1999, the last of the Khmer Rouge had surrendered or captured. The delicate balance of peace in Cambodia may hang on how the country handles the issue of war trials in the near future.",
        "flag": "https://www.worldometers.info/img/flags/cb-flag.gif"
    },
    {
      "country":"Cameroon",
        "information": "This African nation was settled over a millennium ago. Outsiders, in the form of the Portuguese who arrived about 500 years ago, eventually made their way to this coastal region. The brisk slave trade decimated the indigenous population, leaving the country unable to resist foreign domination. The Germans created it a protectorate in 1884, but the British and French invaded the area during World War I. The war's end saw Cameroon divided into French and British mandated regions. During the Second World War, the French mandate declined to accept Vichy control and instead made itself available to the Free French forces under Charles de Gaulle. In 1960, independence was achieved following the elimination of the French mandate. A portion of the British mandate later joined with Cameroon with the remaining areas choosing to unite with Nigeria. In 1972, the United Republic of Cameroon was created, though it became once again the Republic of Cameroon in 1984. Over the ensuing decades, the political structure has evolved from a one-party system to multiparty with the first such elections held in 1992.",
        "flag": "https://www.worldometers.info/img/flags/cm-flag.gif"
    },
    {
      "country":"Canada",
        "information": "Canada's earliest inhabitants arrived via the Berling land bridge 15,000 years ago. The first Europeans were the Vikings who established a short-lived colony in New Foundland. In 1608 a French trading post was established at Quebec. In 1663 New France was organized as a French colony. The French lost Canada to the British in the French and Indian war which lasted from 1756-63. During the US Revolutionary War 40,00 loyalist fled the American colonies for Canada. The US failed to capture Canada during the War of 1812. After the war of 1812 Britain e3ncouraged large scale immigration to Canada from Great Britain. In 1867 the Dominion of Canada a self-governing body within the British Empire was established. Sir J.A. Macdonald became the dominions first Prime Minister.",
        "flag": "https://www.worldometers.info/img/flags/ca-flag.gif"
    },
    {
      "country":"Central A. R.",
        "information": "Though this African region has been open to development since the 1800s, it was not until 1889 that a European settlement was set up by the French. Five years later, the region became the territory of Ubangi-Shari and in 1910, became part of French Equatorial Africa. Self-governing since 1958, the country was granted independence two years later. Originally a republic, the army overthrew the elected government in 1966. The coup leader, Jean-Bedel Bokassa, was given the title of president-for-life in 1972 but four years later, declared himself an emperor and the country the Central African Empire. In 1979, Bokassa was exiled to France and country became a republic once more. But in 1981, the army once again took over, banning political parties and it was not until 1991 that the country legalized opposition parties. Since elections in 1993, the government led by Ange Felix Patisse has attempted to limit the powers of the army but the military has not been quelled. In 1996 alone, France was asked to help Patisse twice in keeping army-led rebellions in check.",
        "flag": "https://www.worldometers.info/img/flags/ct-flag.gif"
    },
    {
      "country":"Chad",
        "information": "A nation long on history but short on development, Chad has faced serious difficulties over the centuries since ancient settlements were supplanted by the kingdoms of Kanem-Bornu, Baguirmi, and Ouaddai. For three hundred years beginning in 1500, the slave trade was active in the area, with Arab raiders providing slaves for European traders. In the lat 19th century, the French penetrated into the area and fought the Arab Muslim local leaders until the region became a French governorship in 1905. Control was not easy for the French to establish, and it took nearly another decade until French dominance was complete. It became a colony within French Equatorial Africa in 1920. After the dissolution of FEA in 1950, Chad became a member of the French Community, with full independence achieved in 1960. Five years later, a civil war began pitting the Muslim north and east against the southern-led government. French assistance was unsuccessful in preventing the hostilities. A military coup in 1975 was an attempt to bring the dispute to a close but it filed and despite some transient governmental compromises, civil war flared again in 1980. Libya was asked to help restore the peace, which it did, briefly before civil war broke out again in 1982. It was not until 1988 that the war was declared over. Stability was still not in sight as the 1990s dawned with another attempt to change the system by force: General Idriss Deby ousted the ruling government, with the idea of instituting a multiparty democracy. Deby won elections that were held in 1996. The country remains desperately poor and underdeveloped industrially.",
        "flag": "https://www.worldometers.info/img/flags/cd-flag.gif"
    },
    {
      "country":"Chile",
        "information": "The Spanish came to the region in the 1530s, but indigenous peoples had long populated the area. For several hundred years, Spanish rule continued but eventually the forces of independence won out in 1818. With independence did not come stability, however, and a decade-and-a-half elapsed until a constitution was promulgated that established the government format for almost the next 60 years when a civil war erupted between presidential forces and the Congress. With the defeat of the presidentialists, the system shifted to one of parliamentary dominance. This led to difficulties in political and social decision-making with the result being strikes and other problems at the turn of the century. The military, responding to the government's inability to arrange for their wages, ousted the parliamentary government in 1925. By 1933, a new constitution had been instituted, which set the tone for government for almost the next four decades. In 1970, Dr. Salvador Allende Gossens became president after an intense Congressional debate. Allende proceeded to nationalize the country's vital copper industry and the international community responded with a boycott that helped cripple the economy, particularly as the government also nationalized the coal and steel industries and much of the banks. Unhappiness in the country reached such levels that the military took action in 1973, taking over the government and killing Allende. General Augusto Pinochet Ugarte became president and the next years saw thousands of Chileans arrested and killed by the junta. Pinochet lasted until 1988 as calls for the end of the Pinochet dictatorship became impossible to resist. He was replaced by a member of the Christian Democratic Party in 1990, bringing to a close 17 years of military rule.",
        "flag": "https://www.worldometers.info/img/flags/ci-flag.gif"
    },
    {
      "country":"China",
        "information": "China, an ancient civilization, was largely indifferent to the ebb and flow of European concerns until the late 18th century when social and other pressures led to the country acceding to the establishment of foreign enclaves in Chinese territory. In the decades between 1850 and 1870, more than 20 million Chinese died as a result of multiple uprisings including the Taiping Rebellion. The country's movement towards a non-imperial political system began with the fall of the last dynasty in 1911 and the rise of Sun Yat-sen's Nationalist Party in 1919 and Mao Zedong's Chinese Communist Party in 1921. Though the two briefly collaborated in 1922, they eventually parted company when Chiang Kai-shek took over the Nationalist party after the death of Sun Yat-sen in 1925. The fierceness of their rivalry led to civil war following World War II. The Nationalist forces fled to Taiwan and the Communists declared a People's Republic in 1949. During much of the early Cold War, the Soviet Union and China were cooperative partners but Chinese fears about Soviet intentions in the nuclear arena led Mao to expel Soviet advisors in 1958 and break with the USSR.",
        "flag": "https://www.worldometers.info/img/flags/ch-flag.gif"
    },
    {
      "country":"Columbia",
        "information": "Another of the South American regions that fell to conquerors in the 1500s, Colombia was part of the Spanish Viceroyalty of Peru till the mid-18th century when it became part of a new viceroyalty encompassing what is now Colombia, Ecuador, Panama, and Venezuela. In 1810, the region achieved independence from Spain but it would not be until 1886 that Colombia was made a single republic. As in much of the world, the depression of 1929 augured serious economic and political problems for the country and a civil war broke out in 1930. In 1934, President Alfonso Lopez Pumarejo put forth a plan for reform known as ''Revolution on the March.'' In the decade between 1948 and 1957, 'La Violencia' erupted, leading to the deaths of hundreds of thousands of Colombians. The 1957 plan that ended the violence laid out the provisions for power-sharing between the warring Conservative and Liberal parties. This system came to be weakened with the rise of terrorist and other groups -- both left and right -- that challenged the two-party arrangement. Fighting the mushrooming drug trade has taken center stage in Colombia for decades and with it, violence against the government, the military, and civilians.",
        "flag": "https://www.worldometers.info/img/flags/co-flag.gif"
    },
    {
      "country":"Comoros",
        "information": "This island nation has been Islamic since the 16th century. French colonial rule was advanced in the decades between 1841 and 1912; political autonomy was not granted until 1961 and independence not until 1975. The president, Ahmed Abdallah Abderemane, was ousted that year by a mercenary force, though he returned to power three years later. In 1989, he was assassinated but the rebels responsible were forced to back down under French pressure. The 1990s brought a new constitution and the first democratic elections in 1992. Problems such as difficult weather, the lack of much arable land, and a poor infrastructure linking the islands has kept the Comoros underdeveloped.",
        "flag": "https://www.worldometers.info/img/flags/cn-flag.gif"
    },
    {
      "country":"Dem. Rep. Congo",
        "information": "Portuguese traders and explorers brought the slave trade to the Congo, wreaking havoc on the native peoples of the region. The Belgians hired Henry Stanley to set up trading stations along the Congo River in 1878; soon after, King Leopold created the Congo Free State as a personal possession that he ruled both as king and as chief shareholder! The harsh conditions of the Free State drew the ire of both the US and Britain and, with promises of reform, Belgium transformed the Free State into a true colony called the Belgian Congo. The region was rich in natural resources and by the 1920s, it was a major provider of diamonds, gold, copper, rubber, and other products. The entire infrastructure of the country was in the hands of the Belgians -- native peoples participated in only the most local levels of government. Independence was declared in 1960 -- and many Europeans fled immediately, fearing the consequences: a bloody conflict and many atrocities.",
        "flag": "https://www.worldometers.info/img/flags/congo-flag.gif"
    },
    {
      "country":"Costa Rica",
        "information": "Costa Rica became an independent republic in 1838. Democratic elections did not occur until more than 50 years later. While the country has enjoyed a largely peaceful history since 1948 when a brief civil war erupted over the issue of electoral fraud. After the hostilities ceased, the Costa Rican army was abolished. Major government concerns at present revolve around the economy with attempts to reign in government spending.",
        "flag": "https://www.worldometers.info/img/flags/cs-flag.gif"
    },
    {
      "country":"Croatia",
        "information": "Croatia's history as an independent nation dates back to the 10th century. In 1102, Hungary's king began to rule over the Croats. From the 1300s on, Croatia, together with Hungary and Serbia, represented Europe's defensive wall against the encroaching Ottoman empire. In 1526, the region was added to the Habsburg dynasty, coming under Austrian control. After the collapse of the Habsburgs during the first World War, Croatia became part of Yugoslavia but chafed under Serbian control. During World War II, the Croats engaged in ''ethnic cleansing'' such that about 100,000 Serbs and Jews were murdered in Croatia. In 1946, the Croats joined the newly re-established Yugoslavia (Tito was himself a Croat). They declared their secession from the republic in 1991 and war broke out. In 1996, the Yugoslav-Croat war was ended with Yugoslavia recognizing formal borders for Croatia and establishing diplomatic relations.",
        "flag": "https://www.worldometers.info/img/flags/hr-flag.gif"
    },
    {
      "country":"Cuba",
        "information": "Indigenous peoples of several tribes occupied Cuba by the time Columbus first made his way there in 1492. And while much of Spain's American empire dissolved in the early part of the 19th century, Cuba remained a colonial outpost of Spain until the 1890s. With the end of the Spanish American War, Cuba was made a US protectorate and the United States was given the right to intercede in Cuba as it saw fit. In the first half of the 20th century, Cuba experienced many political problems, starting with corruption and going on to include repression. When Fidel Castro and his revolutionary followers overthrew the long-time dictator Batista in 1959, there was hope and expectation that he would usher in democratic reform to the island. Instead, Castro has ruled Cuba since then with an iron hand. It has angered the US with its support for left-leaning regimes and its stubborn adherence to Communism even after the fall of its chief patron, the USSR.",
        "flag": "https://www.worldometers.info/img/flags/cu-flag.gif"
    },
    {
      "country":"Cyprus",
        "information": "Cyprus been revealed through archeological work as having been inhabited for at least 10,000 years. Long an important part of eastern Mediterranean trade, Cyprus saw civilizations come and go: the Phoenicians, the Romans, the Byzantines, even the English passed through during the Crusades as Richard the Lion-Hearted established a crusader entity at the end of the 12th century. In 1489, Venice took over Cyprus and then came the Ottomans in 1571. Placed under British control by the Congress of Berlin in 1878, it was annexed by Britain in 1914. Eleven years later, Britain made Cyprus a formal colony. Tensions between the Greek Cypriots and the Turkish Cypriots have led to violence at various points, post World War II. In 1974, Turkey invaded Cyprus and occupied the northern 40% of the island. The occupation has continued, though the international community has not seen fit to recognize the area's self-proclaimed status as the Turkish Republic of Northern Cyprus (1983). The rest of the island has prospered with reasonable political stability, foreign investment, and tourism.",
        "flag": "https://www.worldometers.info/img/flags/cy-flag.gif"
    },
    {
      "country":"Czech Rep.",
        "information": "The origins of the Czech republic go back to the Moravian empire of the ninth century. After being destroyed by the Magyars, Bohemia and Moravia existed as an independent kingdom within the Holy Roman Empire. From 1526 until the first World War, the throne was held by the Habsburgs. Of the entire Austro-Hungarian empire, no where was richer than this region due to a combination of natural resources and well-developed agriculture. Industry was also pursued in urban areas and comfortable middle classes developed, principly Jewish and German. The state of Czechoslovakia was an outgrowth of the end of the Habsburg monarchy. Czechs (less than half the population) were placed in the position of controlling a variety of different ethnicities including Germans, Slovaks, magyars, Poles and Ukrainians. This relatively stable and workable arrangement came to an end with Hitler's annexation of the Sudetenland in 1938.",
        "flag": "https://www.worldometers.info/img/flags/ez-flag.gif"
    },
    {
      "country":"Denmark",
        "information": "Denmark controlled an enormous swath of land in the 1000s: Iceland, Greenland, Britain, Norway, and more. Several hundred years later, Britain was out of Denmark's orbit but Sweden and Finland had been acquired. But through the succeeding centuries, Finland, Sweden, and Norway all took different paths -- Finland and Sweden to independence and Norway to the control of Sweden. Other possessions went to Prussia (Schleswig-Holstein) and even the United States (Virgin Islands, sold in 1914). Iceland became independent, too, in 1944. Before World War II, Denmark signed a nonaggression agreement with Germany which was broken months later when the Nazis invaded Denmark. Despite this occupation, the Danes managed to save over 7,000 Jews by sending them to safe haven in Sweden. Post-war, Denmark has enjoyed peace and fluctuating economic fortunes. As in many of the Scandinavian countries, Denmark's comprehensive social welfare policies requires high taxes and even Denmark's generally impressive economic growth faltered in the 1970s. But, along with the rest of the world, Denmark's economy improved in the 1980s.",
        "flag": "https://www.worldometers.info/img/flags/da-flag.gif"
    },
    {
      "country":"Djibouti",
        "information": "This strategically-located small region became important in 1869 with the opening of the Suez Canal. The French maintained their sphere of influence, called French Somaliland, through agreements with Ethiopia. After the Italian invasion of Ethiopia in the 1930s, tensions flared between the French and the Italians. With the outbreak of World War II, the territorial government initially sided with Vichy France, but shortly thereafter went with the Free French and the Allies. Though it became part of the French Overseas community in 1958, nationalist fervor was growing and in 1977, the republic was born.",
        "flag": "https://www.worldometers.info/img/flags/dj-flag.gif"
    },
    {
      "country":"Dominica",
        "information": "Before Columbus' voyages to the Caribbean, Dominica was inhabited by Carib indians. Though Spanish ships passed through from then on, the island was actually settled by Europeans in the 17th century and those Europeans were French missionaries. The island came under British rule in 1763. Variously tied to the Leeward Islands, the Windward Islands, and then the West Indies Federation, Dominica embarked upon a political relationship with Britain (1967) which culminated in independence for Dominica in 1978.",
        "flag": "https://www.worldometers.info/img/flags/do-flag.gif"
    },
    {
      "country":"Dominican Rep.",
        "information": "Two-thirds of the island of Hispaniola is accounted for by the Dominican Republic (the rest of the island is Haiti). Another of Columbus' stops in 1492, the Dominican Republic boasts the oldest continually inhabited European-founded settlement in the New World. The hemisphere's oldest monastery, hospital and cathedral are all here. Variously under Spanish, Haitian, and even US rule, the Dominican Republic came under the dictatorial rule of Rafael Trujillo in 1930 that lasted for the next three decades. In the 1960s, political instability in the country led to a US invasion in 1965. From 1966 to 1978, Joaquin Balaguer served as president. He was returned to the office in 1986, 1990, and 1994 (although the last election was challenged on the grounds of fraud leading Balaguer to serve only until 1996 (he was 89 years old at the time).",
        "flag": "https://www.worldometers.info/img/flags/dr-flag.gif"
    },
    {
      "country":"Ecuador",
        "information": "Under the rule of the Incan empire until the coming of the Spanish in 1532, Ecuador came to serve as an important administrative center for the viceroyalty of Peru. Independence came centuries later in 1822. For the next eight years, Ecuador was part of the Gran Colombia federation. Eventually, the Catholic Church achieved special prominence in the country such that citizenship was linked to the religion, Jesuits were brought in to oversee education, among other actions. But in 1895, the anti-church party, the Radical Liberals, seized power and held it for the next half-century. Politically, the country has been essentially stable with the economy generally secure, particularly as oil was discovered in the 1960s.",
        "flag": "https://www.worldometers.info/img/flags/ec-flag.gif"
    },
    {
      "country":"El Salvador",
        "information": "The indigenous people of El Salvador resisted the coming of the Spanish in 1524. But it took another three hundred years for them to finally throw off the yoke of Spain, becoming first a jurisdiction of Mexico, and then a member of the United Provinces of Central America. in 1840, after a bloody civil war, El Salvador achieved independence as a republic. Coffee was the mainstay of the country's economy from about 1860 and the country structured its laws such that a coffee oligarchy was created. A reform candidate who won election in 1931 was dismissed by the military which set off a revolt that killed perhaps 20,000 citizens, mostly peasants. But from that period until the 1970s, the country experienced political stability. But in 1979, a military-led coup overthrew the government and a civil war was unleashed that lasted for over 12 years and caused over 70,000 deaths. Peace was officially restored by treaty in 1992.",
        "flag": "https://www.worldometers.info/img/flags/es-flag.gif"
    },
    {
      "country":"Egypt",
        "information": "One of the best known of the ancient civilizations was that of Egypt. At least 5000 years before Christ, there arose on the Nile a culture of brilliance which still captivates the world. Dynasty followed dynasty until the Persians replaced the last one about 340 years before Christ. But the Persians were themselves overthrown by Alexander, the Ptolemys, and finally the mighty Romans. But with the crumbling of the Roman empire, the Byzantine arose which ruled until the Arab Islamic wave spread over the region. The Mamelukes controlled Egypt from about 1250 until their defeat by the Ottomans in 1517.",
        "flag": "https://www.worldometers.info/img/flags/eg-flag.gif"
    },
    {
      "country":"Eq. Guinea",
        "information": "This western African country includes both mainland territory and a number of islands. The indigenous Pygmy population was supplanted by various peoples from about the 1600s on. The Portuguese explorer Fernando Po came to the islands in 1473 and the area remained under Portuguese control until 1778, when it was relinquished to Spain. Development, however, was sparse under the Spanish, with the exception of plantations devoted to the production of cocoa. The region was accorded the status of a Spanish province in 1959 and at this point, investment from the mother country made Equatorial Guinea's population one of the most prosperous and well-educated in Africa. Granted autonomy in 1963, independence followed in 1968. The country's first president banned opposition parties two years later and in 1972, made himself president for life. His rule by decree was marked by a reign of terror such that at least a third of the population was killed or exiled. Nigerian workers, who had long formed the backbone of the plantation economy, were expelled (along with other foreigners) in 1976, a move which proved ruinous to the once-healthy economy.",
        "flag": "https://www.worldometers.info/img/flags/ek-flag.gif"
    },
    {
      "country":"Eritrea",
        "information": "This region once part of Ethiopia, fought for thirty years to gain independence and in May 1993, the Eritrean People's Liberation Front declared itself independent, a move recognized by the US, Sudan, and other countries, including Ethiopia. Part of the Italian empire in the beginning of the 20th century, it was ruled by Britain during World War II. Though Britain appended the area to Ethiopia in 1952, secession efforts commenced almost immediately. Though hopes were high that independence would bring all hostilities to a close, in 1995, Eritrea began to skirmish with Yemen over control of Greater Hanish Island in the Red Sea. Then, in 1998, Eritrea and Ethiopia heated up their border. This costly effort has resulted in many casualties on both sides, though the US tried to mediate. The war came to an end with a ceasefire in June 2000.",
        "flag": "https://www.worldometers.info/img/flags/er-flag.gif"
    },
    {
      "country":"Estonia",
        "information": "Though related to the people of Finland, the Ests of Estonia had been a colony of Denmark, the Teutonic Knights, Swedes, Poles, and Russians. And through it all, Germanic burghers ruled the towns of the region. The Ests, tied to the land, were primarily serfs (serfdom not being abolished until 1819). A nationalist spirit began to surface with interest in folklore, language, and history. In 1920, a fully independent Estonia emerged thanks to the 1918 Treaty of Brest-Litovsk. This period of independence came to a halt with the 1939 Hitler-Stalin pact as Estonia was given over to the Soviets as a sphere of influence.",
        "flag": "https://www.worldometers.info/img/flags/en-flag.gif"
    },
    {
      "country":"Ethiopia",
        "information": "Legend tells us that Ethiopia was founded by the son of King Solomon and the Queen of Sheba. Whether this is so or not, indisputable is that Ethiopia was known as an important part of classical trade routes as far back as 500 years before Christ. Christianized in the 4th century, Ethiopia managed to counter Islamic invasion in the 600s. But its Coptic Christians were then cut off from Christian centers by the now-Islamic countries of northern Africa and the rest of the Middle East. Portugal arrived in the 15th century, using Ethiopia to bolster their trade across the Indian Ocean. The Portuguese tried to introduce Roman Catholicism to little avail. In the early 17th century, Ethiopia expelled all missionaries. An Italian effort to invade in 1880 was also successfully foiled.",
        "flag": "https://www.worldometers.info/img/flags/et-flag.gif"
    },
    {
      "country":"Fiji",
        "information": "Though the islands of Fiji were first visited by Abel Tasman in the mid-17th century, it was not until 1874 that the region was made a British crown colony. To work the enormous sugar plantations, the British brought in so many Indians, that the indigenous population soon was outnumbered by those of Indian heritage. In 1970, Fiji was declared an independent parliamentary democracy with most of the power resting in the hands of the Fijian minority. Seventeen years later, the Indian party came to power but was ousted in a military coup almost immediately. Lt. Col. Sitiveni Rabuka took over the government; five years later he became prime minister. A new constitution was adopted that guaranteed ethnic Fijians the majority of seats in the legislature. In May 1999, new elections brought another Indo-Fijian candidate to the premiership but simmering resentments came to the boiling point a year later when ethnic Fijians overthrew the government.",
        "flag": "https://www.worldometers.info/img/flags/fj-flag.gif"
    },
    {
      "country":"Finland",
        "information": "Originally from the Ural mountains and with a semi-unique language related more to Hungarian and Estonian than to any of the Scandinavian tongues, Finns came to their land via Siberia in the 700s. The indigenous peoples, the Lapps, were displaced into the northernmost areas of Scandinavia. Four hundred years later, Christianity arrived in the form of Swedish conquerors. In the 1500s, the land of the Finns became a Swedish grand duchy and even today, ethnic Swedes comprise about 7% of the population. Located unluckily between Sweden and Russia, Finland was often the site of battles between the dueling competitors. In 1809, the country was ceded to Russia. After the communist revolution, Finland perceived its chance to try for independence; after a civil war, Finland became independent for the first time ever in its history.",
        "flag": "https://www.worldometers.info/img/flags/fi-flag.gif"
    },
    {
      "country":"France",
        "information": "Celtic tribes were the original inhabitants of the territory known as Gaul. Two hundred years before Christ, the Romans conquered the Mediterranean coast, colonized long before by Phoenicians and Greeks. Julius Caesar successfully conquered all of Gaul between 58 and 51 B.C., making the region a province of the Roman empire. Christianity quickly reached Gaul in the first century A.D. Visigoths, Franks, and Burgundii, barbarian invaders all, arrived in the fifth century and by 486, the Franks had unified the country, become Christians, and established the Merovingian line. Saracens attacked in the 600s but in 732, they were defeated by Charles Martel, whose grandson was Charlemagne. The Pope declared Charlemagne ruler of the West in 800. As a result of waves of Viking assaults in the ninth century, France was broken up into regions that were ruled by nobles -- some were actually independent states, more or less, such as Aquitaine, Burgundy, Flanders, Anjou, and Blois.",
        "flag": "https://www.worldometers.info/img/flags/fr-flag.gif"
    },
    {
      "country":"Gabon",
        "information": "This western African republic's population is a eclectic blend of peoples who arrived there over the course of some 700 years. The Portuguese first came in the 1400s, and then the Dutch, French, and british arrived several hundred years later, their eyes on the slave trade, primarily. France made the area a semi-protectorate in 1839-41 and worked to abolish the still-active slave trade. In 1903, France put a colonial administration in place and in 1910, the region became part of French Equatorial Africa. In gratitude for the part played by its residents during World War II (it was a base for Free French activity), Charles de Gaulle gave French citizenship to all the territory's people. Gabon became independent in 1960. Politically, the country has been relatively stable since independence and has recently been successful in drawing foreign investment to the country, particularly since it has evolved into a multiparty democracy.",
        "flag": "https://www.worldometers.info/img/flags/gb-flag.gif"
    },
    {
      "country":"Gambia",
        "information": "French and British colonial interests collided on this region around the Gambia river in Africa. The Portuguese arrived first in 1455, but British traders obtained from them exclusive rights to the river in 1588. The French and British tussled for two centuries to control the area but in 1783, the French conceded. It became a British crown colony in 1889 and a constitutional monarchy within the British Commonwealth in 1965. Five years later, The Gambia became a republic, under Sir Dawda K. Iawara. His rule lasted until 1994, when he was ousted in a coup led by Yahya Jammeh. The US, the UK and the European Union all cut off further aid until such time as democracy would be restored.",
        "flag": "https://www.worldometers.info/img/flags/ga-flag.gif"
    },
    {
      "country":"Georgia",
        "information": "Though first independent four centuries before Christ in the time of Alexander the Great, Georgia's history since is one of domination by other powers and peoples. From the Persians to the Mongols, to the Turks and Persians again, the region of the Gorj people was divided up into petty principalities, some under Turkish rule and others under Persian. The Persian principalities were absorbed into Russia in 1801 and by the turn of the 20th century, the remaining Turkish hold-out was also taken by Russia. The communist revolution of 1917 seemed to be an opportunity for Georgia to reassert its independence, Georgia was incorporated into the Soviet Union in 1921 and made one of the union republics in 1936. But nationalism has always been strong in Georgia, and in 1988 the call became irresistible. But though Georgia was seeking to break free of the Soviet Union, some of its provinces were trying to break free of Georgia. Fighting broke out, particularly in Abkhazia, and the conflict raged for two years (1991-1993). More than 2,000 died. President Eduard Shevardnadze asked his Parliament to grant him extraordinary powers to put down the rebellion. In 1994, Georgia became a member of the Commonwealth of Independent States. In 1995, Shevardnadze won reelection to a new term, but the unrest in Abkhazia continues, Russian troops are still present, and there have been attempts on Shevardnadze's life, which make future developments difficult to predict.",
        "flag": "https://www.worldometers.info/img/flags/gg-flag.gif"
    },
    {
      "country":"Germany",
        "information": "The region that would become Germany was populated by Germanic tribes well before the coming of the Roman empire to the region. Though they largely resisted Rome, some served in the Roman legions. Germanic barbarian invasions did, however, contribute to the ultimate fall of Rome. Charlemagne united most of the region, but it was a fragile unity and during the time of the Holy Roman Empire, there were several hundred individual political bodies in the territory of the Germanic peoples. The political fragmentation grew only more complex in the 16th century with the Protestant Reformation, which had its roots in Germany. The Congress of Vienna agreed to the creation of a German League composed of 39 states. Of these were 5 kingdoms including Prussia which went on to conquer its neighboring states and declare a German empire under its chancellor, Otto von Bismarck. Germany became an industrial powerhouse in the late 19th century, with a modest colonial empire and serious military aspirations. Kaiser Wilhelm II ruled the german empire at its height just prior to the First World War. Germany's defeat in that war was so complete, however, and the terms of its surrender so humiliating that the seeds were sown for an even greater catastrophe, the Second World War. The Weimar Republic, set up after the war, was never able to truly overcome the economic problems, labor unrest, and political fragmentation of the post-war period. Hitler became chancellor in 1933, functionally ending the Weimar Republic and ushering in one of the darkest chapters in world history.",
        "flag": "https://www.worldometers.info/img/flags/gm-flag.gif"
    },
    {
      "country":"Ghana",
        "information": "The Portuguese first came to the area in 1471, lured by gold and slavery. The British, Danes, and Dutch all came to trade slaves here and this is where most American slaves originated. After the abolition of the slave trade, the British made the region a protectorate in 1871 and a colony in 1886. In 1952, Kwame Nkrumah became the colony's prime minister and later, the country's first prime minster after independence was achieved in 1960. Blessed with gold and diamonds, the country seemed poised for development and economic wealth. But Nkrumah began to look to the Communist bloc; he also outlawed opposition in 1964. In 1966, Nkrumah was ousted by a military council. Though there have been some civilian governments since, in 1981 another military man took power. Flt. Lt Jerry Rawlings had been unable to improve Ghana's serious economic difficulties until the World Bank intervened. In 1989, Ghana managed a 6% growth rate, although political instability remains. In 1994, fighting erupted between the Konkomba and Manumba peoples in the north of the country, leaving many dead and over 150,000 refugees.",
        "flag": "https://www.worldometers.info/img/flags/gh-flag.gif"
    },
    {
      "country":"Greece",
        "information": "Greece produced the most brilliant of the ancient civilizations. At its apex, between the fifth and third centuries B.C., the Greeks were the indisputable leaders of the world in philosophy, art, politics, and science. The civilization of Greece was spread by commerce and by war, as much of the known world fell to Alexander the Great. Upon his death, however, the empire began to disintegrate. It was absorbed into the Roman Empire, and later into the Byzantine. When the Ottomans swept to power, they also took over Greece (1460) which they controlled for the next 350 years. Under the Ottomans, the Greeks preserved their national heritage and in 1821, Greece rebelled against the Ottomans. Supported by a powerful trio of friends (Russia, Britain, and France), Greece declared its independence in 1827.",
        "flag": "https://www.worldometers.info/img/flags/gr-flag.gif"
    },
    {
      "country":"Grenada",
        "information": "Grenada was under the control of the Carib Indians in the 1600s. Then the British and French struggled to establish control over the island until 1783 when the British won. Gaining independence in 1974, the government was displaced in a coup headed by the leftist New Jewel Movement in 1979. Another coup in 1983 ended with the assassination of New Jewel Movement leader Maurice Bishop. The United States invaded and power was restored to the hands of the governor-general. In the early 1990s, a coalition government was in place until 1995 when the New National party, headed by Keith Mitchell, gained a majority in Parliament. Mitchell became prime minister. In 1999 elections, the party won all 18 seats in Parliament.",
        "flag": "https://www.worldometers.info/img/flags/gj-flag.gif"
    },
    {
      "country":"Guatemala",
        "information": "Heart of the Mayan empire, the region that would become Guatemala, was taken by the Spanish in 1524. Guatemala also became the center of the United Provinces of Central America after 1821, when Spanish rule was overthrown. In 1838, Guatemala became independent, following the dissolution of the United Provinces. For nearly a century, the Liberal party held power in Guatemala. Communist support became evident in the 1945 elections and Jacobo Arbenz was deposed in 1954 in a US-supported military coup. Since then, it has been the military which controls Guatemala's government. All has not been peaceful, however, as civil war between the military and antigovernment guerrillas raged from 1960 to the 1990s. In 1994, an agreement was reached to bring the civil war to a close, but implementation stalled while aspects of the pact were debated including amendments to the constitution. The US, angered by the country's failure to bring to justice military officers who had committed war crimes. In 1997, the 36-year long civil war seemed to have been concluded.",
        "flag": "https://www.worldometers.info/img/flags/gt-flag.gif"
    },
    {
      "country":"Guinea",
        "information": "A trade crossroads long before Europeans appeared on the scene, Guinea was part of several empires over the 500 year period between the 10th and 15th centuries. The French came early in the 1600s and in 1845, they formalized the relationship by making Guinea a French colony (it was named French Guinea in 1893). After World War II, French Guinea became part of the Federation of French West Africa. In 1958, the region rejected membership in the Fifth French Republic and all political ties were dissolved. Independence was declared. Sekou Toure led the new government, remaining in power until his death in 1984. A military government, headed by General Lansana Conti, took over almost immediately upon Toure's passing. Conti was elected president in 1993 and in 1995, Guineas's first multiparty elections took place, with Conti's Unity Progress party taking 71 of 114 seats in the legislature. In 1996, Conti was succeeded by Sidia Toure.",
        "flag": "https://www.worldometers.info/img/flags/gv-flag.gif"
    },
    {
      "country":"Guyana",
        "information": "The Dutch began colonizing this South American region in the early 17th century. The British and the French also sought to dominate here and eventually, the British succeeded: it became a British colony in 1831. In 1966, independence was declared and from then till 1992, the same party was in power (People's National Congress). The party, socialist in ideology, nationalized most of the large companies in the country which contributed to a resource-rich country remaining relatively poor and dependent on foreign aid. In 1992, the People's Progressive Party took over but made little inroads into privatizing the potentially lucrative bauxite and sugar industries. After the death of party leader Cheddi Jagan in March 1997, the prime minister became president and Jagan's widow became prime minister. Elections held later that year brought Mrs. Jagan into power but opposition to these results by the members of the People's National Congress led to mass demonstrations and rioting. The PNC represents the interests of black Guyanese while the PPP is primarily the party of Guyana's East Indians. In 1999, Mrs. Jagan resigned and was succeeded by Bharrat Jagdeo.",
        "flag": "https://www.worldometers.info/img/flags/gy-flag.gif"
    },
    {
      "country":"Haiti",
        "information": "Haiti occupies part of the island of Hispaniola, which was 'discovered' by Columbus in 1492. The indigenous tribe, the Arawaks, were either murdered, worked to death, or killed off by European diseases against which they had no defenses. The french got control of the western third of the island in 1697 because French pirates so relentlessly beleaguered the area. Slaves made the region economically advantageous to the French. A slave revolt, however, resulted in abolition of slavery. Independence was declared in 1804, but political stability would be a long time coming for the country. From the mid-1800s through the mid-1900s, the US began to exert considerable influence in Haiti. For nearly two decades, in fact, Haiti was under US military occupation (1915-194). In 1957, Francois ''Papa Doc'' Duvalier seized control and commenced a repressive rule of the country. His son, Jean-Claude (''Baby Doc'') came to power in 1971. under the Duvalier's most of the better-educated and wealthy citizens fled to more hospitable locales. ",
        "flag": "https://www.worldometers.info/img/flags/ha-flag.gif"
    },
    {
      "country":"Honduras",
        "information": "Though the Mayan empire extended to the area of what became Honduras, the region became important to Europeans in the 1570s when silver was discovered. Honduras was a province of Spain in the 1700s, though the British controlled the Caribbean coast. Honduras joined the federation United Provinces of Central America, after winning its freedom from Spain, and later, Mexico, but the United Provinces fell in 1838, leaving Honduras an independent republic. An element of political unrest was constant in Honduras until 1932 when gen. Tuburcio Carias Andino became president, a position he held until 1949. Civilian rule was interrupted in 1963 with a military coup. The military controlled the country until 1982. The civil wars raging in Nicaragua and El Salvador were of concern to Honduras, particularly since the Nicaraguan Contras used Honduran territory. The US, which supported the Contras, also funneled military and other aid to Honduras. With the demobilization of the Contras, tensions were relieved and Honduras began to concentrate on reducing the power of the military. In 1999, the legislature voted to put the military, heretofore sacrosanct, under civilian control.",
        "flag": "https://www.worldometers.info/img/flags/ho-flag.gif"
    },
    {
      "country":"Hungary",
        "information": "Since its conversion to Western Christianity before AD 1000, Hungary has been an integral part of Europe. Although Hungary was a monarchy for nearly 1,000 years, its constitutional system preceded by several centuries the establishment of Western-style governments in other European countries. Following the defeat of the Austro-Hungarian Dual Monarchy (1867-1918) at the end of World War I, Hungary lost two-thirds of its territory and nearly as much of its population. It experienced a brief but bloody communist dictatorship and counterrevolution in 1919, followed by a 25-year regency under Adm. Miklos Horthy. Although Hungary fought in most of World War II as a German ally, it fell under German military occupation following an unsuccessful attempt to switch sides on October 15,1944. In January 1945, a provisional government concluded an armistice with the Soviet Union and established the Allied Control Commission, under which Soviet, American, and British representatives held complete sovereignty over the country. The Commission's chairman was a member of Stalin's inner circle and exercised absolute control.",
        "flag": "https://www.worldometers.info/img/flags/hu-flag.gif"
    },
    {
      "country":"Iceland",
        "information": "The Vikings came to Iceland in the ninth century. There, Europe's oldest representative body was founded, the Althing. About the year 1000, Christianity arrived. First under Norwegian rule (1200s) and then under the Danish (1380), Iceland had to wait until 1918 to gain its independence, although it continued to share a king with Denmark. When the Nazis occupied Denmark during World War II, Iceland declared itself a republic. An early member of the United Nations and NATO, Iceland has no armed forces (the US operated a base at Keflavik). The population of Iceland is one of the world's most educated and healthiest; comprehensive social benefits are available to all thanks to the country's Scandinavian-style welfare state.",
        "flag": "https://www.worldometers.info/img/flags/ic-flag.gif"
    },
    {
      "country":"India",
        "information": "Dating back at least 5000 years, civilization in India has been a rich and complicated mix of peoples and religions. Brahminism, Buddhism, Jain, Hinduism all developed here in a series of kingdoms and empires. The Gupta dynasty ruled over a golden age for north India for about two hundred years (320-544 A.D.). In the 600s, the Indus River Valley was invaded by Arabs, who brought with them Islam, which took hold in northern India. The Sultanate of Delhi was established in 1206. It managed to withstand repeated Mongol invasions and eventually succeeded in bringing together nearly all of India (with the exception of some of the southern states). But the Sultanate of Delhi was weakened by the stresses of internal rebellion, particularly when combined with the attack of Timur Leng (Tamerlane) in 1398. In 1526, Babur established the Moghul empire, whose culture thrived under Akbar the Great. Threats to the Moghul empire from Marathan and Rajput were compounded by the encroaching interests of the European powers, who came to india in 1498 in the person of Vasco de Gama.",
        "flag": "https://www.worldometers.info/img/flags/in-flag.gif"
    },
    {
      "country":"Indonesia",
        "information": "The region once known as the East Indies was home to several Hindu and Islamic kingdoms long before Europeans arrived in the 16th century. A century later, the Dutch East India Company was largely in control, although in 1799, its bankruptcy forced the Dutch government to establish direct rule, The Dutch managed to maintain their hold on the East Indies, even in the face of growing nationalism and anticolonial uprisings. Though the Japanese captured the islands during World War II -- and some viewed them as liberators -- the nationalists prevailed and in 1945, declared Indonesia's independence under Sukarno. Indonesia took its place as a leader of the nonaligned nations of the Third World. Under Sukarno, Indonesia moved left (looking towards China) but when the army crushed an attempted coup in 1965, the ensuing turmoil resulted in the deaths of hundreds of thousands, killed as suspected communists.",
        "flag": "https://www.worldometers.info/img/flags/id-flag.gif"
    },
    {
      "country":"Iran",
        "information": "Persia and Babylonia were unified into the Persian Empire by Cyrus the Great in 549 B.C. Though Alexander the Great conquered Persia about two hundred years later, Persia did regain its independence after Alexander's death. The Persian Sassanian empire established in 226 A.D. was a formidable rival to the Roman Empire. It remained until Islam swept into the region in 641, displacing Zoroastrianism which had been the principal religion. The Mongols arrived in the early 1200s and their rule persisted until 1502. The Safavid dynasty ruled until 1736 but its end ushered in two hundred years of decline for Persia. Britain and Russia began to assert control over Persia in the 19th century. The defacto situation was formalized in a 1907 agreement between the two powers that divided Persia into specified spheres of influence. After the First World War, Persia was independent -- but in reality, the country was still treated as a protectorate of Britain. By 1921, the Soviet Union had given up all claims to Persian territory.",
        "flag": "https://www.worldometers.info/img/flags/ir-flag.gif"
    },
    {
      "country":"Iraq",
        "information": "Mesopotamia, the ancient name for the region now known as Iraq, was the birthplace of one of the oldest civilizations known to mankind. The Sumerians arose some 3000 years before Christ and from their city-states, the empire of Babylonia developed. Babylon fell to the Assyrians in 1350 B.C., and then to the Persians under Cyrus and Darius. persian rule would define the area for the next millennium. Islam began expanding in the 600s A.D. and quickly absorbed the Persian-ruled areas. The Caliphate was moved to Baghdad in 762. After the Mongols attacked Baghdad in 1258, the region declined such that it was easy pickings for the Ottomans in 1534 and thus Iraq remained for nearly 400 years. In 1915, the British occupied Iraq and after World War I, Britain continued to govern under the provisions of a League of Nations mandate. Under British supervision, a Hashemite monarchy was established in 1921. The kingdom became independent in 1932 but continued its close relationship with Britain, one predicated on the oil and defense interests of the British.",
        "flag": "https://www.worldometers.info/img/flags/iz-flag.gif"
    },
    {
      "country":"Ireland",
        "information": "St. patrick converted the Celtic tribes of Ireland to Christianity in the fifth century. Irish missionaries then went out to Scotland, England, and Europe and, while Rome disintegrated, Ireland stood as a cultureal, religious, and educational center. But the Viking invasion changed Ireland: the destruction wrought in the 9th and 10th centuries left ireland isolated and poor. In 1014, Brian Boru reestablished an Irish monarchy. A century later, England turned its eye to Ireland as henry II became overlord. Eventually, another Henry -- the Eighth -- would declare himself monarch of Ireland as well. Henry brought the Reformation to Ireland at great hardship to the Catholic country. The Catholic Mass was made an act of treason. When rebellion arose in 1641, it was crushed by Cromwell over the course of a ten-year struggle, ending with the terrible massacre at Drogheda. The Irish supported James II against William of Orange, butJames was defeated at the Battle of the Boyne in 1690, which sealed Ireland's fate as England imposed desctructive economic sanctions on the country as a result.",
        "flag": "https://www.worldometers.info/img/flags/ei-flag.gif"
    },
    {
      "country":"Israel",
        "information": "The creation of the State of Israel in 1948 was preceded by more than 50 years of efforts by Zionist leaders to establish a sovereign nation as a homeland for Jews. The desire of Jews to return to what they consider their rightful homeland was first expressed during the Babylonian exile and became a universal Jewish theme after the destruction of Jerusalem by the Romans in 70 A. D. and the dispersal that followed. It was not until the founding of the Zionist movement by Theodore Herzl at the end of the 19th century that practical steps were taken toward securing international sanction for large-scale Jewish settlement in Palestine--then a part of the Ottoman Empire. The Balfour declaration in 1917 asserted the British Government's support for the creation of a Jewish homeland in Palestine. This declaration was supported by a number of other countries, including the United States, and became more important following World War I, when the United Kingdom was assigned the Palestine mandate by the League of Nations.",
        "flag": "https://www.worldometers.info/img/flags/is-flag.gif"
    },
    {
      "country":"Italy",
        "information": "Italy's forebears, the Romans, dominated the known Western world from about 500 years before Christ until the fifth century A.D. In the fourth century, the empire began to falter when it was divided between Rome and Byzantium. While the Byzantine empire strengthened, Rome suffered waves of barbarian assaults which led to its functional dissolution into small nobilities and independent cities. These city-states eventually achieved considerable power. Venice and Genoa came to control the seas, while Florence and Sienna became wealthy through agriculture and commerce. This wealth provided the underpinnings for the Renaissance which bloomed between the 13th and 15th centuries. The powers in Europe, including Austria, Spain, and France, all tried to extend their dominion to Italy. Napoleon set up a Kingdom of Italy (as a French satellite) but his death resulted in t return to the old situation with Austria dominating in the north. In the 19th century, nationalism began to stir and another Kingdom of Italy was brought about by Garibaldi and di Cavour in 1861.",
        "flag": "https://www.worldometers.info/img/flags/it-flag.gif"
    },
    {
      "country":"Jamaica",
        "information": "Spain initially claimed Jamaica through Columbus (he came to the island in 1494) and controlled it until they were forced to cede it to Britain in 1655. During those 160-plus years, the Spanish set about eliminating the island's native population, the Arawaks. Pirates favored Jamaica and it also could claim the dubious distinction of having one of the world's most active slave markets. The economy that needed slaves to work the island's vast sugar plantations, faltered when the slavery was abolished in 1833 especially as it was coupled with the removal of tariff protection in 1846. Jamaica gained its independence in 1962 but the intervening years have been marred by an uncertain economy and bitter racial and class divisions.",
        "flag": "https://www.worldometers.info/img/flags/jm-flag.gif"
    },
    {
      "country":"Japan",
        "information": "This nation with an ancient history has played a far more pivotal role in world events than its small size would seem to warrant. Through a succession of kings, the country saw its culture develop and thrive from the 3rd century on. By 1603, the region was controlled by Tokugawa Ieyasu who established his government in Edo (later Tokyo). At this time the structure of Japanese feudalism was established, including uncompromising class divisions and Christianity was suppressed (the Jesuits had sent Francis Xavier to Japan during the late 16th century). Tokugawa and those who succeeded him were successful in isolating the country from nearly the entire outside world. With the exception of a minor Dutch trading site, Japan had no contact other peoples and cultures for 250 years to come. But in 1854, Commodore Perry came to Japan and forced the reluctant country to open diplomatic relations with the US and engage in commercial exchanges.",
        "flag": "https://www.worldometers.info/img/flags/ja-flag.gif"
    },
    {
      "country":"Jordan",
        "information": "Jordan was created out of the greater mandated Palestine following World War I. The British saw an opportunity to appease Abdullah, a son of Hussein ibn Ali, who was ruler of the Hejaz in Arabia. In 1923, the Kingdom of Transjordan was carved out of the area of mandated Palestine and the Hashemite dynasty began. Though Transjordan was an Allies supporter during World War II, in 1948 the country joined the Arab League, changed its name to Jordan. and participated in the 1948 war with Israel. As a consequence of this conflict, Jordan gained territory: the West Bank and the Old City of Jerusalem which were annexed n 1950. Many of the Arab refugees from that war were placed in camps in the West Bank and the population of Jordan is today, overwhelmingly Palestinian.",
        "flag": "https://www.worldometers.info/img/flags/jo-flag.gif"
    },
    {
      "country":"Kazakhstan",
        "information": "The people of this region are of Mongol and Turkic origin who presence in Kazakhstan dates back thousands of years. Islam came to the area between the 7th and 9th centuries and the Mongols held sway from the early 13th through the mid-15th centuries. At this point the Kazakhs were recognized as a distinct entity but eventually infighting resulted in a tri-part split into the larger, Middle, and Lesser Hordes. When the Mongols again invaded in the mid-1600s, the Kazakhs turned to Russia for protection; a century later, Russia completely dominated the Kazakh lands. The situation worsened after 1861 when Russian and Ukrainian peasants flowed into Kazakhstan after the freeing of the serfs and were given Kazakh lands.",
        "flag": "https://www.worldometers.info/img/flags/kz-flag.gif"
    },
    {
      "country":"Kenya",
        "information": "The Portuguese came early to Kenya (1498) and dominated the area until the sultans of Oman took control in 1729. Eventually, the British established a protectorate over the region, first at the coast in 1890 and later throughout the interior (1895). By 1920, Kenya held the status of colony, and was inhabited by a large and prosperous British community. Though the Italians briefly took control of northern Kenya during World War II (they came from Italian Ethiopia) Britain quickly regained control and even permitted some limited participation in local government to the native Africans in Kenya. In the 1950s, the violent Mau Mau rebellion emerged to fight against British colonial rule. In 1963, independence was achieved and Kenya joined the British commonwealth shortly thereafter. ",
        "flag": "https://www.worldometers.info/img/flags/ke-flag.gif"
    },
    {
      "country":"Kuwait",
        "information": "Part of the Ottoman empire from the late 16th century, Kuwait became a principality under the al-Sabahs in 1756. British influence grew in the region such that in 1899, Kuwait was made a British protectorate. After World War II, Kuwait's vast oil reserves helped transform it into a wealthy state indeed with citizens receiving all services at no cost (they also pay no taxes!) Kuwait won its independence in 1961. In August 1990, Iraq invaded Kuwait touching off a crisis that culminated in the Gulf War. A coalition of forces successfully defeated Iraq, though Iraq did destroy much of the country's infrastructure.",
        "flag": "https://www.worldometers.info/img/flags/ku-flag.gif"
    },
    {
      "country":"Korea",
        "information": "According to Korean legend, the god-king Tangun founded the Korean nation in BC 2333. By the first century AD, the Korean Peninsula was divided into the kingdoms of Silla, Koguryo, and Paekche. The Silla kingdom unified the peninsula in 668 AD. The Koryo dynasty (from which the Western name Korea is derived) succeeded the Silla kingdom in 935. The Choson dynasty, ruled by members of the Yi clan, supplanted Koryo in 1392 and lasted until the Japanese annexed Korea in 1910.",
        "flag": "https://www.worldometers.info/img/flags/ks-flag.gif"
    },
    {
      "country":"Kyrgyzstan",
        "information": "The Kyrgyz people date back to at least 13 centuries and were one of the significant central Asian tribes . Their territory came to be controlled by Mongols, Kalmyks, Manchus, and Russians, among others. Relatively late (the mid-1600s) the Kyrgyzstan became Muslim although they soon came under Chinese domination. In 1868 the area became a Russian protectorate and, several years later, was incorporated into the greater Russian empire. The Communist Revolution was accompanied by chaos and confusion in the region by in 1936, it was made a formal Socialist Republic of the Soviet Union. Along with other of the former SSRs, Kyrgyzstan chose independence after the fall of communism, but it did join the Commonwealth of Independent States.",
        "flag": "https://www.worldometers.info/img/flags/kg-flag.gif"
    },
]